[{"REVIEWTEXT":"The food was delicious and our waitress was very cheerful, knowledgeable and full of suggestions and made sure we were well taken care of.","predicted":1,"actual":0,"pos_prob":0.9920484057,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-10 17:45:00.0","ID":80815371.0,"Restaurant":"Jasper's - The Woodlands"},{"REVIEWTEXT":"Visiting Seattle for my birthday and picked this place to go for \"the day\". Great decision. I loved this place and would go back tonight if I weren't back in Los Angeles. Can't say enough about the great staff and the great food.","predicted":1,"actual":0,"pos_prob":0.9533606026,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-24 20:30:00.0","ID":66493991.0,"Restaurant":"Poppy"},{"REVIEWTEXT":"We ordered from the light dinner menu and it was just the right amount of food-allowing us room for dessert.  The mini filet was outstanding and the accompaniments were delicious as well.  We ordered the molten lava chocolate cake for dessert and it was well worth the wait.  One of our best dinners in Key West!","predicted":1,"actual":0,"pos_prob":0.9860597962,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-18 18:30:00.0","ID":76802443.0,"Restaurant":"Michaels Restaurant"},{"REVIEWTEXT":"Yet again, we were treated to excellent food and service.  They seated us immediately and took great care of our needs.","predicted":1,"actual":0,"pos_prob":0.9822092014,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-12 20:30:00.0","ID":79283618.0,"Restaurant":"Tee-Jay Thai Sushi - Wilton Manors"},{"REVIEWTEXT":"Brook's Steak House and Cellar has the ambiance of stately private dining room that exudes elegance and pride of quality.  It is the perfect place for a that special evening.  The food is superb and its presentation is outstanding.  Although the wait staff are cordial and knowledgeable, the service slips towards the marginally-attentive.","predicted":1,"actual":0,"pos_prob":0.9675808405,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-04 18:30:00.0","ID":66973920.0,"Restaurant":"Brook's Steak House & Cellar"},{"REVIEWTEXT":"We arrived a few minutes early for our reservation and were seated quickly.  The service was great, we didn't wait too long for anything.  The food was excellent, we had filet and crab cakes.  Overall the entire evening was great.","predicted":1,"actual":0,"pos_prob":0.9577224806,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-07 17:00:00.0","ID":80205845.0,"Restaurant":"J. Alexander's - Oak Brook"},{"REVIEWTEXT":"My wife and I enjoyed great food and wonderful service here. The staff was interesting with some great stories about the history since 1928 here. Piano music from the bar area filtered in during dinner to create a special ambiance.","predicted":1,"actual":0,"pos_prob":0.9906439237,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-03 18:45:00.0","ID":65731499.0,"Restaurant":"The English Grill at Brown Hotel"},{"REVIEWTEXT":"Vibrant, fun, energetic atmosphere!  Great food, wonderful service!","predicted":1,"actual":0,"pos_prob":0.9897418618,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-02 19:30:00.0","ID":80039985.0,"Restaurant":"The Capital Grille - Chestnut Hill"},{"REVIEWTEXT":"Lovely new building, with great decor. Guitarist next to fireplace made for a charming cozier dining room. Food and service is absolutely 5 star. We had a wonderful experience!","predicted":1,"actual":0,"pos_prob":0.9804762888,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-12 18:00:00.0","ID":66080977.0,"Restaurant":"Le Yaca"},{"REVIEWTEXT":"Everything about Bob's was perfect for a Business dinner with Customers.  The food was perfectly prepared and the atmosphere was elegant but fun.  What made the meal special for my guests was Shelly, our waitperson.  She had just the right amount of attentiveness and sass to make us relax and laugh and really enjoy ourselves without being overbearing or pretentious  She even charged my cell phone for me!   Make sure that you ask for Shelly the next time that you eat at Bob's. of you have an important occasion.","predicted":1,"actual":0,"pos_prob":0.9825854219,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-01 18:00:00.0","ID":65652748.0,"Restaurant":"Bob's Steak & Chop House - San Francisco"},{"REVIEWTEXT":"First time visitor to this restaurant and we LOVED it!! The building is  historic and has been perfectly restored. it is vibrant and comfortable with great period details. Service was great; waiter was attentive and knowledgeable. Food was fabulous!! We are very picky and expect high quality  when we dine out and Light Horse delivered. The Friday night bouillabaisse special was on point! You won't be disappointed.","predicted":1,"actual":0,"pos_prob":0.9869388884,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-01 19:15:00.0","ID":78625671.0,"Restaurant":"Light Horse Tavern"},{"REVIEWTEXT":"Our server made the night! We had family in from out of town and he really took his time and expertly walked us through the menu.  The food was fantastic and unique.  We loved the guitar player but would have preferred being further away as it was somewhat hard to hear.","predicted":1,"actual":0,"pos_prob":0.9707246291,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-14 18:30:00.0","ID":80813838.0,"Restaurant":"Barcelona Restaurant & Bar"},{"REVIEWTEXT":"My wife and I celebrate our anniversary at Forbes Mill Steakhouse recently. The service was excellent. A gentlemen named Heaven was our waitperson, and he was attentive, personable and we would ask for him again the next time we visit. The salads, the French Onion Soup, meat entrees were all excellent and nicely presented. The dessert, which was \"on the house\" was an excellent mix of caramel and dark chocolate. We will definitely return to this restaurant. Note: When we entered the restaurant, we asked for a quiet, romantic table, and we were seated in a quiet area with few tables. All was perfect for the evening.","predicted":1,"actual":0,"pos_prob":0.9887505114,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-28 18:00:00.0","ID":76450328.0,"Restaurant":"Forbes Mill Steakhouse - Los Gatos"},{"REVIEWTEXT":"A terrific experience, in all respects.  Beautiful space that evokes the time of great steakhouses.  Wonderful warm greeting, terrific service staff.  Food was delicious and served with care and grace.  And we could talk and be heard!!  Not the case with many steakhouses these days.  I recommend Gallaghers without any hesitation.","predicted":1,"actual":0,"pos_prob":0.9772987922,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-12 18:15:00.0","ID":77229768.0,"Restaurant":"Gallaghers Steakhouse - Manhattan"},{"REVIEWTEXT":"Everything was tops both the food and service :    We'll be back.","predicted":1,"actual":0,"pos_prob":0.9753991965,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-24 12:00:00.0","ID":77844090.0,"Restaurant":"Sea Salt"},{"REVIEWTEXT":"We had a wonderful dinner to celebrate our wedding anniversary.  The service was as outstanding as the tasty food. Dayn is a culinary genius.    We look forward to coming back with our friends!","predicted":1,"actual":0,"pos_prob":0.9895952972,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-16 19:00:00.0","ID":79284010.0,"Restaurant":"Houndstooth"},{"REVIEWTEXT":"This is truly one of the most vibrant restaurants in NYC!  Great food, service, wine list, and flair!","predicted":1,"actual":0,"pos_prob":0.9827907717,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-21 20:30:00.0","ID":66386142.0,"Restaurant":"The NoMad"},{"REVIEWTEXT":"One of the best calamari dishes I've ever had.","predicted":1,"actual":0,"pos_prob":0.9782431722,"food_rating":2,"overall_rating":3,"dined_date":"2015-06-07 20:00:00.0","ID":80242764.0,"Restaurant":"Chart House Restaurant - Monterey"},{"REVIEWTEXT":"This is my all time go-to restaurant when in Vegas. We always have a beautiful night with great food and great ambience. The staff are always so nice and welcoming, our server was Paul and he made us feel so relaxed and happy to be there. The food was delicious, the fountains give the romance to any meal here and I didn't want the night to end.","predicted":1,"actual":0,"pos_prob":0.9937197862,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-19 17:15:00.0","ID":77282881.0,"Restaurant":"OLiVES - Bellagio"},{"REVIEWTEXT":"Love the atmosphere and location.  Food was excellent, presentation had a French flare.  Service exceeded expectation!  Excellent wine choices.  Great short ribs!","predicted":1,"actual":0,"pos_prob":0.9931532567,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-10 19:00:00.0","ID":77006578.0,"Restaurant":"Mercat"},{"REVIEWTEXT":"We were at Muriel's for the Mother's Day brunch which turned out to be a wonderful experience.  Everything we ate was delicious, but the highlight of my meal was the appetizer, crawfish and goat cheese crepes with a Creole cream sauce.  Absolutely one of the most delicious dishes I have ever eaten.  When we return to New Orleans in the future, Muriel's will definitely be on our 'must go to' list.","predicted":1,"actual":0,"pos_prob":0.9896345163,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-10 10:00:00.0","ID":79066011.0,"Restaurant":"Muriel's Jackson Square"},{"REVIEWTEXT":"Evening out with the girls to celebrate. We had a great table and the service couldn't have been better, they even made great recommendations based on the individual tastes of each person. The wine was fantastic and our event was a great success!!!! Thank you to the restaurant staff and to the owners, you are doing something right!!","predicted":1,"actual":0,"pos_prob":0.981797459,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-17 18:30:00.0","ID":78696861.0,"Restaurant":"Nonna Silvias Trattoria and Pizzeria"},{"REVIEWTEXT":"We have been several times and twice for the James Beard preview dinners.  This place is a little far from us but worth the trip, we have never been disappointed as they do a great job with the food and the staff is top notch.","predicted":1,"actual":0,"pos_prob":0.9561511258,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-24 18:30:00.0","ID":76249281.0,"Restaurant":"The Salty Sow"},{"REVIEWTEXT":"We had a special dining experience here.  Food was delicious; we appreciated local items.  Our server Bethany knew the menu items.  All in all, a very good meal.  Only thing we missed was bread served with out cocktails.  We'll know the next time to order some of the flatbread to with our drinks.","predicted":1,"actual":0,"pos_prob":0.968476616,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-01 17:15:00.0","ID":65675416.0,"Restaurant":"The Obstinate Daughter - Sullivans Island"},{"REVIEWTEXT":"Wanted to eat here for a long time; worth the wait.  Fantastic food with great flair.  The service is also great.  Highly recommended.","predicted":1,"actual":0,"pos_prob":0.9954007266,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-23 12:00:00.0","ID":79455624.0,"Restaurant":"Swallow Restaurant"},{"REVIEWTEXT":"We almost had the restaurant to ourselves.  Our server, Richard, was very professional and efficient.  The filet with scallops, shrimp, and truffled mashed potatoes was excellent and an incredible deal at $49.  Overall a great dining experience.","predicted":1,"actual":0,"pos_prob":0.970505145,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-09 20:00:00.0","ID":70359812.0,"Restaurant":"Mignon's Steak and Seafood"},{"REVIEWTEXT":"My boyfriend and I planned to go to another restaurant for Valentine's Day, but all the ones we wanted to go to in Old Town were already booked.  We searched for \"romantic\" restaurants on the Web and Geranio was on the list and one of the few with some availability, so we took a chance and made a reservation, and now we are so glad we did!  When we arrived, we were a bit early but they sat us right away.  They sat us upstairs, which was a very warm, quiet and romantic setting. The food was absolutely delicious. And all through the evening, the service was impeccable.  Great find and we plan to come here more often!","predicted":1,"actual":0,"pos_prob":0.9590797836,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-14 17:30:00.0","ID":71794247.0,"Restaurant":"Geranio"},{"REVIEWTEXT":"Each dish was amazing! The presentation was out of this world.  Can't wait to go back!","predicted":1,"actual":0,"pos_prob":0.995759334,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-10 12:45:00.0","ID":78787732.0,"Restaurant":"The Gadarene Swine"},{"REVIEWTEXT":"I have stayed at the Mirage several times. This was my second visit to Stack and I have nothing but wonderful things to say about it. Everything was great...the serviced, the food and the staff. I highly recommend Stack.","predicted":1,"actual":0,"pos_prob":0.9532824423,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-27 21:00:00.0","ID":78152888.0,"Restaurant":"Stack - The Mirage"},{"REVIEWTEXT":"We flew into Idaho from the California and saw this place on Open Table and decided to give it a try. We were seated out on the patio with a view of the sun streaming through the trees by the river--very beautiful and peaceful. Get the calamari appetizer--it's awesome.  We had a fantastic dinner of homemade fresh pasta and fabulous wine. We met the owner Bill, who helped us explore some other Italian wines and dessert and had a great time. The service was also top notch. We never expected to find a place like this in Eagle Idaho. It was so good we went back 3 more times during our stay. I wish there was a restaurant like this here in California without having to go to Beverly Hills.","predicted":1,"actual":0,"pos_prob":0.9577324055,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-06 19:00:00.0","ID":64885089.0,"Restaurant":"Bella Aquila"},{"REVIEWTEXT":"The food, service, and ambiance were excellent!  We had a wonderful dinner and enjoyed celebrating our wedding anniversary.","predicted":1,"actual":0,"pos_prob":0.9926020151,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-04 17:30:00.0","ID":78522851.0,"Restaurant":"Morton's The Steakhouse - Las Vegas"},{"REVIEWTEXT":"Great menu with spicey entrees. Wonderful wine list and a very good value TBOY","predicted":1,"actual":0,"pos_prob":0.9831710192,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-27 18:30:00.0","ID":74200795.0,"Restaurant":"Tom Colicchio's Heritage Steaks - The Mirage"},{"REVIEWTEXT":"Great place to eat in charlottesville! Highly recommended! Carmen was great!!","predicted":1,"actual":0,"pos_prob":0.978901292,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-17 12:30:00.0","ID":79283444.0,"Restaurant":"Rhett's River Grill and Raw Bar"},{"REVIEWTEXT":"Best Saltimboca I've had in many years.  Great food, friendly, quick service, but not rushed.  Wish we lived closer!","predicted":1,"actual":0,"pos_prob":0.9736409637,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-14 18:30:00.0","ID":79173610.0,"Restaurant":"Massimo's - Fremont"},{"REVIEWTEXT":"We went to the Farmhouse for our anniversary. The service was fantastic and the food was awesome.  We liked how the restaurant and the farmers have a real connection. They know their farmers by name and recognize and thank them in the restaurant. The farm to fork  approach guaranties great tasting food while reinforcing and supporting local farmers.  The service was spot on and personal. Our server knew about every meal and was a great representative of the farm to fork approach. The farmhouse seems like a great place to work and that is felt when you eat there.","predicted":1,"actual":0,"pos_prob":0.9549123767,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-28 18:30:00.0","ID":79779448.0,"Restaurant":"The Farmhouse - Kansas City"},{"REVIEWTEXT":"I love dining here   I usually sit at the bar.  Sammy, one of the bartenders, always takes very good care of me.  The food is consistently wonderful and comes out in a timely manner.","predicted":1,"actual":0,"pos_prob":0.9892941508,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-09 17:00:00.0","ID":80359977.0,"Restaurant":"Noche Tequila & Tapas Bar - Johns Creek"},{"REVIEWTEXT":"Wonderful service, friendly staff all around and our dinner was excellent!","predicted":1,"actual":0,"pos_prob":0.9944905449,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-17 17:45:00.0","ID":77485106.0,"Restaurant":"Stoney River Steakhouse and Grill - Chesterfield"},{"REVIEWTEXT":"Our waiter was very attentive and knowledgeable about the food.  All of our dishes were delicious and served hot.  We would definitely come back.","predicted":1,"actual":0,"pos_prob":0.9907466214,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-08 13:15:00.0","ID":75435601.0,"Restaurant":"Devon Seafood + Steak - Hershey"},{"REVIEWTEXT":"they have a great wine list and the food and service are 1st class","predicted":1,"actual":0,"pos_prob":0.957086396,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-15 20:00:00.0","ID":79197490.0,"Restaurant":"Downtown Kitchen"},{"REVIEWTEXT":"The small plate options are wonderful.  The four course option has a variety that would appeal to everyone with tastes that more than satisfy.  We have never been disappointed.  The service is commendable.  Our server was knowledgeable and attentive.","predicted":1,"actual":0,"pos_prob":0.9583763397,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-21 18:30:00.0","ID":77709289.0,"Restaurant":"JoLe"},{"REVIEWTEXT":"Excellent for a special occasion and has excellent menu","predicted":1,"actual":0,"pos_prob":0.9935394913,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-08 19:00:00.0","ID":78681041.0,"Restaurant":"La Bergerie"},{"REVIEWTEXT":"We ate at the Trencherman on a chilly, rainy Friday night before an event at the Flat Iron buildng.   Our server was attentive and knweledgeable.  The drinks were inventive and delicious and the food was truly outstanding.  We enjoyed it all so much, we came back to the bar after the play to relax in the beautiful bar area.  I highly recommend the Trencherman.","predicted":1,"actual":0,"pos_prob":0.9682159135,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-24 18:30:00.0","ID":77818949.0,"Restaurant":"Trenchermen"},{"REVIEWTEXT":"The food was great, we got take home an extra meal, the service was very good, and the deserts were  the best, yummy!!","predicted":1,"actual":0,"pos_prob":0.9798166589,"food_rating":1,"overall_rating":2,"dined_date":"2015-05-01 18:00:00.0","ID":78201644.0,"Restaurant":"Maggiano's - Columbia"},{"REVIEWTEXT":"One of the best dining experiences anywhere. Extraordinary hospitality! Service and food among the best we've ever experienced.  This is what dining out should be!","predicted":1,"actual":0,"pos_prob":0.9685815142,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-18 19:00:00.0","ID":79460179.0,"Restaurant":"Halls Chophouse"},{"REVIEWTEXT":"The food was great, well presented  with a nice comfortable pace to the service","predicted":1,"actual":0,"pos_prob":0.9840466637,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-11 18:30:00.0","ID":77045117.0,"Restaurant":"The Roundhouse"},{"REVIEWTEXT":"Service was great food was excellent ambiance very pleasing. What else could one want in a dining establishment.","predicted":1,"actual":0,"pos_prob":0.9597531686,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-30 18:45:00.0","ID":79892165.0,"Restaurant":"Pietro's Italian Restaurant"},{"REVIEWTEXT":"We were celebrating my friend's birthday.  The dinner and evening was great.  The chef was entertaining and the food was delicious.  The clientele was very diverse.  There were several tables of families and also couples.  Our sever was pleasant and attentive.  She anticipated our every need.","predicted":1,"actual":0,"pos_prob":0.9797527246,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-18 18:30:00.0","ID":70761647.0,"Restaurant":"Fujiyama Steak House of Japan"},{"REVIEWTEXT":"Fun and delicious.  Great atmosphere for a special occasion.  I want to try everything on this menu.","predicted":1,"actual":0,"pos_prob":0.9965458706,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-04 19:30:00.0","ID":76776424.0,"Restaurant":"DRAKE"},{"REVIEWTEXT":"Wonderfully pictureque view.  Friendly and attentive staff... Thank you, Sarah.","predicted":1,"actual":0,"pos_prob":0.9518973384,"food_rating":2,"overall_rating":3,"dined_date":"2015-04-28 19:00:00.0","ID":78102896.0,"Restaurant":"Coast"},{"REVIEWTEXT":"Excellent, from the greeting at the door by Tom to the thank you as we where leaving, 2 and 1\/2 hours later. I had my family of six ages 11 to 72 and we all  excellent choices. Seafood, steaks and Quail. I would recommend to everyone I know. Dick Carmichael","predicted":1,"actual":0,"pos_prob":0.9784378154,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-12 17:00:00.0","ID":66086734.0,"Restaurant":"Halls Chophouse"},{"REVIEWTEXT":"This is our fourth time dining at Ricciuti's.  After our first visit, we came back with my parents, who also loved the place (they still talk about it).  We love the setting of the old house and the food was fantastic each time.  Unique dishes all designed around meat and produce from the local community.  I've tried something I've never had before on each of our visits.  This last visit my wife had lasagna (ok, she's Italian) and I had the risotto with lamb, both were excellent.  If you go, be prepared to step away from your foodie comfort zone and try one of their unique dishes, I think  you will be pleasantly surprised.","predicted":1,"actual":0,"pos_prob":0.9874770227,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-30 17:30:00.0","ID":78608948.0,"Restaurant":"Ricciuti's Restaurant"},{"REVIEWTEXT":"The wait staff were all very special to say Happy Anniversary and our Server Jennifer took our picture with our phone and took it twice just to make sure it turned out.  The meal was fantastic and prepared just the way we like it.  The 1\/2 portion worked excellent for us.  Not eating too much but just enough to fill us up.  Steak was delicious and so were the mushrooms and everything was HOT the way we like it.  Thanks for a wonderful memory Ruth Chris....We'll do it again next year.  That is if the Good Lords willing and the creeks don't rise.","predicted":1,"actual":0,"pos_prob":0.9554728486,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-01 20:00:00.0","ID":80000756.0,"Restaurant":"Ruth's Chris Steak House - Biloxi"},{"REVIEWTEXT":"My husband and I went to Hugo's for our anniversary.  We ordered the Filet Mignon and it was delicious.  It was cook just as we requested it and the flavor was just right.   Service was also great, our waiter was very attentive and very helpful.  Will definitely go back and recommend this place to all our friends.","predicted":1,"actual":0,"pos_prob":0.9606115723,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-27 17:00:00.0","ID":76562567.0,"Restaurant":"Hugo's Frog Bar & Chop House - Des Plaines"},{"REVIEWTEXT":"This was our 2nd visit to EVO. Great food and service once again,","predicted":1,"actual":0,"pos_prob":0.9779903311,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-17 18:00:00.0","ID":75902401.0,"Restaurant":"EVO Italian"},{"REVIEWTEXT":"The service here was excellent, as was the food.  Meals are carefully prepared and presented.  The flavors complement each other. I highly recommend this restaurant.","predicted":1,"actual":0,"pos_prob":0.9893683719,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-08 18:00:00.0","ID":75586195.0,"Restaurant":"Fleur by Hubert Keller - Las Vegas"},{"REVIEWTEXT":"Loved sitting by the window,watching people, wonderful non interruptive wait person, great lunch, relaxed atmosphere.","predicted":1,"actual":0,"pos_prob":0.9743180131,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-28 12:45:00.0","ID":69792190.0,"Restaurant":"Palettes at the Denver Art Museum"},{"REVIEWTEXT":"We thoroughly enjoyed our lunch on the porch on a bright, sunny day.  The service was perfect, the food most delicious and the desserts - fabulous!  Very relaxed atmosphere, lots of history in the building.","predicted":1,"actual":0,"pos_prob":0.9932225714,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-26 12:15:00.0","ID":77992123.0,"Restaurant":"Philly G's"},{"REVIEWTEXT":"All the good reviews are right on!  Wonderful evening.  Great Food, Great Music and Great Service too !   The wine list is compact but excellent.","predicted":1,"actual":0,"pos_prob":0.9985112755,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-09 19:15:00.0","ID":75533462.0,"Restaurant":"Sambuca Restaurant - Nashville"},{"REVIEWTEXT":"We were pleasantly surprised with the excellent food and service at Bistro Blanc.  The pasta bolognese was so tasty and delicious that we asked for the recipe and they gave it to us!! Our TLV burgers were superb!  Just loved the place!!","predicted":1,"actual":0,"pos_prob":0.9866546277,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-11 19:15:00.0","ID":77046729.0,"Restaurant":"Bistro Blanc"},{"REVIEWTEXT":"The food was fabulous. Seafood is always fresh and prepared with unique combination of ingredients.  And of course you have to mention the banana's foster, the best reason to try this place.  Outstanding service as well.","predicted":1,"actual":0,"pos_prob":0.998230217,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-30 18:00:00.0","ID":71237033.0,"Restaurant":"Eddie V's - Fort Worth"},{"REVIEWTEXT":"A great list of regional  and Italian wines accompanied a small but lovely menu. I had the most lovely buttery tasting is swordfish I can remember and my dining companion had a lovely asparagus pasta.. Our first salad course  featured unusual lettuces  and other lovely fresh ingredients.  We loved the dark ambience and the deep dark red leather booths.  The decor is unpretentious and the bar dominates the restaurant, so we weren't  expecting as superb a meal as we had in the end.  Highly recommended.","predicted":1,"actual":0,"pos_prob":0.9504711642,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-05 19:15:00.0","ID":78533673.0,"Restaurant":"Tosca Cafe"},{"REVIEWTEXT":"Great spot for our Valentine's Dinner. Special menu for that day which included my husband's lobster bisque and my spinach salad with bacon dressing, gorgonzola cheese and sliced pears.  It was so delicious I could have made a meal on that alone.  I had the stuffed chicken with ham and cheese which came with spinach while my husband tried the sea bass with assorted roasted veggies.  Everything was well cooked and my chicken was moist and tender.  We ate it all! Ended with coffee and hazelnut cake for dessert.  The restaurant has multiple small rooms and our area was very quiet with soft music in the background.  Orchids on every candlelit table.  We love this restaurant for special occasions and will definitely return again.","predicted":1,"actual":0,"pos_prob":0.9677610357,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-14 18:45:00.0","ID":71875993.0,"Restaurant":"Moonstruck Restaurant"},{"REVIEWTEXT":"I had a great experience and my gluten free child loved all the options.","predicted":1,"actual":0,"pos_prob":0.983819021,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-16 17:15:00.0","ID":67515107.0,"Restaurant":"The Melting Pot - Reston"},{"REVIEWTEXT":"This restaurant was excellent.  Being health conscious, all of the selections are fresh, in season, and delicious to suit my intake.  I would recommend this to all!","predicted":1,"actual":0,"pos_prob":0.993516761,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-15 16:45:00.0","ID":75838112.0,"Restaurant":"Seasons 52 - King of Prussia"},{"REVIEWTEXT":"We have visited the island for a week for the last 15 years.  Alexander's has been on our list every year.  Their early dining special is the  best bargain on the island. The salads are always fresh and the soups tasty.  We especially like their  fresh seafood and the coconut shrimp is the best on the island.","predicted":1,"actual":0,"pos_prob":0.9745958811,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-27 17:30:00.0","ID":76440273.0,"Restaurant":"Alexander's - Hilton Head Island"},{"REVIEWTEXT":"We enjoyed the Easter Brunch as a table of 6. Service was wonderful, as usual. We will definitely be returning to enjoy the beautiful outdoor view.","predicted":1,"actual":0,"pos_prob":0.9940596655,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-05 11:15:00.0","ID":76828233.0,"Restaurant":"John Ash & Co."},{"REVIEWTEXT":"We had an appetizer, soup, main course and dessert. Every thing was delicious.  I ate more that usual because it was so good.  Service was excellent, room temperature adequate.  I bit noisy for my taste, but others in the group didn't think it was a bit noisy.    All in all it was excellent.  I would visit again.  Will look for it in Miami-Dade Cty as well.","predicted":1,"actual":0,"pos_prob":0.9748977886,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-02 19:15:00.0","ID":78247547.0,"Restaurant":"BRIO Tuscan Grille - Pembroke Pines - The Shops at Pembroke Gardens"},{"REVIEWTEXT":"Food was outstanding. Ambience and service great. I've eaten at many Italian restaurants. Saranello's takes food to a new level. Outstanding food and service. I highly recommend it. Make your reservations early. Dinner fills up very quickly on weekends.","predicted":1,"actual":0,"pos_prob":0.9918282748,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-02 17:00:00.0","ID":78235401.0,"Restaurant":"Saranello's"},{"REVIEWTEXT":"Great food and love the feel of the 'not your typical chain' restaurant!  Great service too!","predicted":1,"actual":0,"pos_prob":0.9726418259,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-12 19:00:00.0","ID":68585409.0,"Restaurant":"Pasta Brioni"},{"REVIEWTEXT":"Food was great! Charmaine, our watiress, was wonderful!   This was our (my wife and I) second visit and plan to visit again when at Beau Rivage! Restaurant is a must when in Biloxi.","predicted":1,"actual":0,"pos_prob":0.9623159826,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-31 18:30:00.0","ID":66764599.0,"Restaurant":"Stalla - Beau Rivage"},{"REVIEWTEXT":"My husband ordered the filet mingon and it was excellent as was my dish, the pan seared chicken.  Meals were presented beautifully. Appetizers were delish as well, we shared the fresh shrimp cocktail and roasted beets with goat cheese, pears and cranberries.  I love that we have an upscale option that we don't have to travel for.  The ambiance is perfect too, very nicely done!  Service was excellent as well, thank you Suzy!","predicted":1,"actual":0,"pos_prob":0.9720389394,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-14 17:45:00.0","ID":71856152.0,"Restaurant":"Clintons Bar and Grille"},{"REVIEWTEXT":"The ambiance is impressive when we  walked into  the dining room, the wood floors and ceiling are great! We felt very comfortable, and there is a lot to look at.  The staff was attentive and quick. We had Hanger steak for dinner that was not only delicious but also had beautiful presentation.  The waiter was very knowledgeable about wine pairings so everything was great!","predicted":1,"actual":0,"pos_prob":0.9635164273,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-24 20:30:00.0","ID":74009121.0,"Restaurant":"The Lion"},{"REVIEWTEXT":"Recently had dinner with friends on a Friday night, the service was wonderful, food was presented nicely and very tasty!  The ambiance was lovely.  Had a wonderful time and hope to come back soon!","predicted":1,"actual":0,"pos_prob":0.9552211112,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-20 18:00:00.0","ID":72879042.0,"Restaurant":"Waterleaf Restaurant - Glen Ellyn"},{"REVIEWTEXT":"Been here several times. Great food! AYCE crab legs are a great deal.","predicted":1,"actual":0,"pos_prob":0.9674832268,"food_rating":2,"overall_rating":3,"dined_date":"2015-04-21 19:15:00.0","ID":77709399.0,"Restaurant":"Rhythm Kitchen Seafood & Steaks"},{"REVIEWTEXT":"Ciao's was excellent, as usual. Both of us had the ravioli special and it was delicious. Nick recommended a new Montalcino Brunello that was wonderful. The service was very good and, although we have been there when there were loud large groups, the noise level was relatively quiet.","predicted":1,"actual":0,"pos_prob":0.9946655465,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-30 18:00:00.0","ID":78281999.0,"Restaurant":"Ciao! 2 An Italian Cafe"},{"REVIEWTEXT":"Service was super attentive and friendly. Food was very good or superb (pork tenderlooin). Cocktails invented by the owner were delicious. Classy atmosphere at reasonable prices.","predicted":1,"actual":0,"pos_prob":0.9929287088,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-18 17:45:00.0","ID":77625336.0,"Restaurant":"Noble Fare"},{"REVIEWTEXT":"We have been to Old Hickory a number of times over the years, the food is ALWAYS world class, and their service and over all experience are impeccable.  The steaks are the best in Orlando without a doubt, and their long-time server Brian makes visiting a WORLD CLASS experience.","predicted":1,"actual":0,"pos_prob":0.9575537891,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-15 18:30:00.0","ID":72451351.0,"Restaurant":"Old Hickory Steakhouse-Gaylord Palms Resort"},{"REVIEWTEXT":"I keep coming back again and again. Always excellent service and food. Great daily specials. Highly recommend this gem.","predicted":1,"actual":0,"pos_prob":0.9994251968,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-07 20:00:00.0","ID":75506986.0,"Restaurant":"MOJO"},{"REVIEWTEXT":"All the food we had there was delicious. I would definitely go back if in South Beach again.","predicted":1,"actual":0,"pos_prob":0.9889751011,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-03 19:00:00.0","ID":70618845.0,"Restaurant":"Naked Taco"},{"REVIEWTEXT":"This has become our favorite restaurant on LBI.  Everything we have tried we have enjoyed and the short ribs are truly sensational.  Great craft beer selection and the Manhattan is terrific.  Food selection is small but has something for everyone and the specials are special.  There is also a nice selection for children.  We are delighted to find a restaurant in this area that we are looking forward to returning too.  We have been on LBI for almost 30 years.","predicted":1,"actual":0,"pos_prob":0.9706770707,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-23 19:00:00.0","ID":79463790.0,"Restaurant":"The Arlington"},{"REVIEWTEXT":"Always a great meal reasonably  priced. The staff is attentive to your needs. I would recommend this restaurant  without hesitation.","predicted":1,"actual":0,"pos_prob":0.983344732,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-21 18:00:00.0","ID":76127547.0,"Restaurant":"Tempo"},{"REVIEWTEXT":"The place was great, we got seated as soon as we got there---very rare these days. Our waiter was absolutely the best, she did a great job and very attentive . The ambiance of this restaurant is my kind of atmosphere, I'm here visiting  from Florida and the fish dinner we had was excellent, we enjoyed our Florida Grouper---lol.","predicted":1,"actual":0,"pos_prob":0.9850498872,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-09 18:00:00.0","ID":78735522.0,"Restaurant":"Market Street Oyster Bar - Downtown"},{"REVIEWTEXT":"This was my son's and my first experience at your restaurant and we really enjoyed the entire time.  Our server, food and atmosphere was very good and enjoyable.  My son is a sophomore at OSU and I am sure will be back.","predicted":1,"actual":0,"pos_prob":0.9639792452,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-05 13:00:00.0","ID":76816141.0,"Restaurant":"SPAGIO"},{"REVIEWTEXT":"The hostess honored our request for a window table. There was a good selection of early bird dinners. The food was nicely presented and delicious. Love the ambience.","predicted":1,"actual":0,"pos_prob":0.9701630133,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-02 16:30:00.0","ID":71305006.0,"Restaurant":"Pazzo! Italian Cafe"},{"REVIEWTEXT":"We enjoyed our dinner before going to the concert at The Lyric.  The food is delicious and inventive and service tops. A bit noisy but lively and location perfect. We will be back.","predicted":1,"actual":0,"pos_prob":0.9947589375,"food_rating":2,"overall_rating":1,"dined_date":"2015-02-13 17:45:00.0","ID":71738293.0,"Restaurant":"The Gafford"},{"REVIEWTEXT":"Great variety on the menu, love the desserts, never disappointed.","predicted":1,"actual":0,"pos_prob":0.9643971058,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-25 17:30:00.0","ID":77885775.0,"Restaurant":"Tavern58 at Gibbs"},{"REVIEWTEXT":"Great place for large groups! Our server was outstanding.","predicted":1,"actual":0,"pos_prob":0.989454531,"food_rating":2,"overall_rating":3,"dined_date":"2015-02-23 18:15:00.0","ID":75090869.0,"Restaurant":"Buca di Beppo - Pasadena"},{"REVIEWTEXT":"Been there twice now for a business dinner and enjoyed both times...  Great flavors and interesting options. We actually took the servers recommendations and enjoyed our final choices.","predicted":1,"actual":0,"pos_prob":0.9672605519,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-12 18:30:00.0","ID":78874380.0,"Restaurant":"Lolita - A Michael Symon Restaurant"},{"REVIEWTEXT":"The onion soup,  steak, trout and fries were very good. Great service and took care of our large group of kids. Again, fries were great!!  Nice dinner spot in Aspen and servers were excellent! We had a large group, 7 adults,  8 kids and we had a delicious, fun dinner!","predicted":1,"actual":0,"pos_prob":0.9768982778,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-19 18:30:00.0","ID":76003368.0,"Restaurant":"Brexi Brasserie"},{"REVIEWTEXT":"you have to try the guacamole - it is the best I have ever had!","predicted":1,"actual":0,"pos_prob":0.9886343111,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-20 19:00:00.0","ID":77659786.0,"Restaurant":"The Flying V at Loews Ventana Canyon Resort"},{"REVIEWTEXT":"The Melting Pot has private booths so you don't have to share a nice dinner out. The staff was great and answered all our questions and made suggestions when asked. The beef I had was super tender and delicious, as were the other meats on the plates. Go hungry and go easy on the cheese fondue at first or you won't have room for the chocolate, which was great.","predicted":1,"actual":0,"pos_prob":0.9669573572,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-05 19:00:00.0","ID":68300410.0,"Restaurant":"The Melting Pot - Scottsdale"},{"REVIEWTEXT":"Food and service were very good.  Cooper river salmon was delicious.  Very happy that they personalized the menu.  Everyone enjoyed their meals.  Good wine suggestions. Good for special occasion and groups.  could have included a complimentary dessert for birthday.  Would definitely come back.  Server was very attentive.  Food was inventive.","predicted":1,"actual":0,"pos_prob":0.9951776217,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-12 19:30:00.0","ID":80431233.0,"Restaurant":"Room 39 - Leawood"},{"REVIEWTEXT":"Great experience in all areas. Great service. Our waitress Brandi was very helpful, courteous and had excellent timing. Great food. Great atmosphere,","predicted":1,"actual":0,"pos_prob":0.997168567,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-07 18:00:00.0","ID":75520346.0,"Restaurant":"Seasons 52 - Birmingham"},{"REVIEWTEXT":"Fabulous food, excellent service ! Great ambiance,","predicted":1,"actual":0,"pos_prob":0.9851921003,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-13 17:00:00.0","ID":77255798.0,"Restaurant":"DB Brasserie - The Venetian"},{"REVIEWTEXT":"Great service...check. Beautiful scene...check. Wonderful ambiance...check. Delicious dinner...absent.","predicted":1,"actual":0,"pos_prob":0.9881918005,"food_rating":2,"overall_rating":3,"dined_date":"2015-04-10 18:00:00.0","ID":77007421.0,"Restaurant":"Lavender Bistro"},{"REVIEWTEXT":"Food, service, atmosphere.....awesome!!!  Can't wait to try it for lunch and dinner.","predicted":1,"actual":0,"pos_prob":0.9897326652,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-22 12:00:00.0","ID":73154098.0,"Restaurant":"The Copper Onion"},{"REVIEWTEXT":"My girlfriends and I enjoyed our Dinner and the food was Exceptional!!!","predicted":1,"actual":0,"pos_prob":0.9747764142,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-31 17:30:00.0","ID":71238415.0,"Restaurant":"Pack's Tavern"},{"REVIEWTEXT":"Went to Torre for lunch with friends I haven't seen in a long time. The service was excellent as well as the atmosphere. Lively and entertaining. Drinks were great!","predicted":1,"actual":0,"pos_prob":0.9662922373,"food_rating":2,"overall_rating":3,"dined_date":"2015-05-16 13:00:00.0","ID":79244970.0,"Restaurant":"Torre Restaurant"},{"REVIEWTEXT":"Although the steaks looked and smelled delicious [we peeked at an adjoining table], the variety of salads and small plates appealed to us for our first time at this restaurant - we were not disappointed. The mushroom risotto was delicious; crab cakes the best I can remember eating; and roasted beet salad was yummy. My husband had the smoked salmon bruschetta and declared it wonderful. Their wine and liquor lists gave us much from which to choose. Overall - a perfect evening.","predicted":1,"actual":0,"pos_prob":0.9773460017,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-21 17:30:00.0","ID":76106815.0,"Restaurant":"WiseGuys Steak & Lounge"},{"REVIEWTEXT":"Stunning view; attentive service; and, superb food.  Can recommend the tenderloin; it is outstanding. We took a chance on the plum dessert with lavender and were not disappointed.","predicted":1,"actual":0,"pos_prob":0.9526677122,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-17 18:00:00.0","ID":77547144.0,"Restaurant":"STARS - A Steak Restaurant"},{"REVIEWTEXT":"We traveled to a meeting in Springdale and decided to eat at Theo's. We had a fantastic experience and would highly recommend this restaurant.  Service and food were excellent!","predicted":1,"actual":0,"pos_prob":0.9808326646,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-21 18:30:00.0","ID":76171273.0,"Restaurant":"Theo's Rogers"},{"REVIEWTEXT":"The front desk was great Our waiter was wonderful Food was excellent Our teenage girls loved the lamb and filet Perfect evening after a busy day visiting Atlanta. We will be back!","predicted":1,"actual":0,"pos_prob":0.999107624,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-25 20:45:00.0","ID":78006745.0,"Restaurant":"Cuts"},{"REVIEWTEXT":"Any time I am in the area I have dinner here.  The appetizers are excellent and perfectly prepared.  The service is always exceptional.  Make a reservation for a booth that looks across the river toward Omaha.","predicted":1,"actual":0,"pos_prob":0.9924321836,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-17 17:00:00.0","ID":69317755.0,"Restaurant":"360 Steakhouse - Harrah's Council Bluffs"},{"REVIEWTEXT":"Selva never disappoints.   The seafood, in particular the Inca Cod, is consistently outstanding and beautifully presented.   Parking can be a little tricky, but that seems to be the case with much of downtown Sarasota.","predicted":1,"actual":0,"pos_prob":0.9684881767,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-30 20:15:00.0","ID":76527042.0,"Restaurant":"Selva Grill"},{"REVIEWTEXT":"Always  one of my favorite places to go for a great meal!da","predicted":1,"actual":0,"pos_prob":0.9833982973,"food_rating":1,"overall_rating":2,"dined_date":"2015-05-11 18:45:00.0","ID":78826647.0,"Restaurant":"Pazzo! Italian Cafe"},{"REVIEWTEXT":"We really enjoyed our experience at Tien. The ambience was great, the service was excellent, and the food was delicious.","predicted":1,"actual":0,"pos_prob":0.9985336409,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-26 19:00:00.0","ID":69684424.0,"Restaurant":"Tien - Teppanyaki \/ Shabu Shabu"},{"REVIEWTEXT":"What a great place to have dinner.  Very romantic and the food is wonderful.  The service is great.  Highly recommend it for your dinning pleasure.","predicted":1,"actual":0,"pos_prob":0.9942537347,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-10 17:30:00.0","ID":67226677.0,"Restaurant":"Vino's Ristorante - Cannery Casino & Hotel"},{"REVIEWTEXT":"The food is very fresh and locally sourced.  The service is quick and friendly.  A bit loud but overall well worth the reservation.","predicted":1,"actual":0,"pos_prob":0.9807214952,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-29 17:15:00.0","ID":77049600.0,"Restaurant":"Founding Farmers - DC"},{"REVIEWTEXT":"We had a great time  celebrating a 87th birthday.  Noise level was low,  food superior,  service outstanding!  I'","predicted":1,"actual":0,"pos_prob":0.9593807251,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-29 17:00:00.0","ID":78115445.0,"Restaurant":"Vivace Restaurant"},{"REVIEWTEXT":"This was a perfect spot to celebrate our 40th anniversary. Great food and ambiance. The best part however, was our server. Zach was excellent and we understand that he may be moving to Kansas City to work at 801's Fish House. 801 is fortunate to have a dedicated young man.","predicted":1,"actual":0,"pos_prob":0.9818639836,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-23 17:00:00.0","ID":79457396.0,"Restaurant":"801 Chophouse ? Des Moines"},{"REVIEWTEXT":"This is the third time we have dined at The Forge. This Miami tradition continues to present excellent service, wonderful food and an \"expert\" wine list.  While not inexpensive, this is a great place for a special event or celebration.  Bravo.","predicted":1,"actual":0,"pos_prob":0.9687639316,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-25 20:30:00.0","ID":69687187.0,"Restaurant":"The Forge"},{"REVIEWTEXT":"The service and food was superb!  We had a minor issue with our food and they went out of their way to correct it and ensure we were satisfied.  They made us feel very special.  I would recommend to everyone and hope to return soon.","predicted":1,"actual":0,"pos_prob":0.9725666226,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-31 18:30:00.0","ID":63761248.0,"Restaurant":"AJ's Oldtown Steakhouse & Tavern"},{"REVIEWTEXT":"We love this restaurant! We have always received excellent service and have never been disappointed! The martini list is fabulous! The food is delicious! The servers and staff are absolutely delightful! We always look forward to our next outing to the Glen Ellen Inn.","predicted":1,"actual":0,"pos_prob":0.998094451,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-09 17:30:00.0","ID":78749251.0,"Restaurant":"Glen Ellen Inn Oyster Grill & Martini Bar"},{"REVIEWTEXT":"Nice dining experience.  Our server was terrific and food was wonderful.","predicted":1,"actual":0,"pos_prob":0.9889743625,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-03 19:30:00.0","ID":76712489.0,"Restaurant":"La Bergerie"},{"REVIEWTEXT":"My husband and I love this restaurant.  We have never been disappointed and there is something on the menu for everyone.  We love sitting at the bar.  People who work the restaurant and diners are very  friendly when you are at the bar.  The people who work the restaurant are appreciative for the business so they try to make everything the best and it is.  Only negative is that their yummy caesar salad keeps getting smaller.  The lamb chops and the tuna steak are sooo delicious!!","predicted":1,"actual":0,"pos_prob":0.9501912803,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-24 18:45:00.0","ID":77918136.0,"Restaurant":"Persimmon"},{"REVIEWTEXT":"This is fast becoming one of my favorites for steak not only in NOLA but everywhere   Delicious!!!!!  Great wine selection.  Only regret is the noise level, yes it creates energy but you can not hear across the table.  Even a little sound buffer would help.   But really a great feast","predicted":1,"actual":0,"pos_prob":0.9618985302,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-23 19:30:00.0","ID":64427315.0,"Restaurant":"Doris Metropolitan"},{"REVIEWTEXT":"Amazing place for a special occasion.  Perfect place to propose or a celebration.  We visited this place for Thanksgiving Dinner and it was awesome.","predicted":1,"actual":0,"pos_prob":0.9755337192,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-27 19:30:00.0","ID":68040913.0,"Restaurant":"Anaheim White House"},{"REVIEWTEXT":"Best Greek restaurant I have ever dined in. Menu offers a great variety of Greek dishes all prepared perfectly. I had lunch during the first week this restaurant opened and have brought friends here for a decade. Best lamb chops I have tasted including mom's (and when I brought mom to Kokkari's even she admitted her chops we're number 2).","predicted":1,"actual":0,"pos_prob":0.9691293095,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-16 18:00:00.0","ID":72203669.0,"Restaurant":"Kokkari Estiatorio"},{"REVIEWTEXT":"Carly waited on us tonight and did an excellent job. Food as always, was delicious.","predicted":1,"actual":0,"pos_prob":0.9973934833,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-08 17:30:00.0","ID":80194398.0,"Restaurant":"Yokozuna Yale"},{"REVIEWTEXT":"As on previous visits, wait staff was great - knowledgeable, friendly without intrusion, helpful, fun, and generally highly skilled. Cocktails were expertly done and both appetizers and thali plates were fantastically diverse, original, and delicious. We were seated at EXACTLY the place we requested on Open Table reservation and it was perfect for our preferences and needs. Cheers to Poppy and all their talented staff for a superb evening.","predicted":1,"actual":0,"pos_prob":0.9901478785,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-27 17:30:00.0","ID":74169491.0,"Restaurant":"Poppy"},{"REVIEWTEXT":"George was an excellant waiter- he knew the menu well, which is important  Everything we had was delicious!","predicted":1,"actual":0,"pos_prob":0.9844884605,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-12 18:30:00.0","ID":71685010.0,"Restaurant":"McCormick & Schmick's Seafood - Raleigh - Crabtree Mall"},{"REVIEWTEXT":"I love the atmosphere, easy parking, great menu that changes at the right frequency.  Our meal and service were a bit \"off\" tonight, but this is still high on my list of favorites.","predicted":1,"actual":0,"pos_prob":0.9567389368,"food_rating":2,"overall_rating":3,"dined_date":"2014-10-30 20:30:00.0","ID":66755686.0,"Restaurant":"Portofino"},{"REVIEWTEXT":"Loved this restaurant. Took my daughter for her birthday and they were great. Highly recommend this restaurant for all special occasions.","predicted":1,"actual":0,"pos_prob":0.9804615165,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-27 13:00:00.0","ID":75155019.0,"Restaurant":"Pican - Oakland"},{"REVIEWTEXT":"it's always nice to go to Bello's especially when Fernando is working. Makes us feel special. Knows the menu very well and his suggestions are always spot on. Very attentive as well. Looking forward to my next visit. Food is always very good and tasty.","predicted":1,"actual":0,"pos_prob":0.9961862078,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-14 17:30:00.0","ID":71880718.0,"Restaurant":"Bello Restaurant"},{"REVIEWTEXT":"It was a great evening to sit outside, but we enjoyed the ambiance inside as well - not too noisy to have a good conversation.  Our waiter Adrian was spot-on with the level of attention he gave us -- neither intrusive, nor elusive.  Just perfect.  Each of us had a different entr?e (Kobe strip steak, fish special, and salmon), and all were superb.  The grilled oysters and the Cesar salad were also excellent.. And the 11:11 Cherry Limeade was one of the most refreshing, delicious cocktails I have every had!  It was a very nice evening with impeccable service, outstanding food, and good friends.","predicted":1,"actual":0,"pos_prob":0.9981686388,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-02 17:30:00.0","ID":78284762.0,"Restaurant":"Eleven:Eleven Restaurant and Bar"},{"REVIEWTEXT":"Excellent dinner recently.  The Pinot Noir that was recommended was excellent, as was the food.  We enjoyed the ravioli the best out of the four or fince tastes that we had.  Our server, Grace, was great, explaining all of the menu highlights and offering recommendations as we put our meal together.  The meal was the highlight of our recent trip.","predicted":1,"actual":0,"pos_prob":0.9503219281,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-09 18:30:00.0","ID":75708309.0,"Restaurant":"La Cave - Wynn Las Vegas"},{"REVIEWTEXT":"Crazy About You is a place I love to go to.  If you get a chance to sit outside, do it!  It has a very nice scenic view and wonderful breeze from the ocean next to you.  The food, as always, has been outstanding.  And I have never had anything bad to say about the service.  The waiters have always been very attentive.  Our server this time around was Marcela and she was great!  All in all, I'm crazy about Crazy About You!","predicted":1,"actual":0,"pos_prob":0.9746151511,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-18 19:15:00.0","ID":77512632.0,"Restaurant":"Crazy About You"},{"REVIEWTEXT":"The food was fantastic. Our waiter was great, overall a great dining experience.","predicted":1,"actual":0,"pos_prob":0.997249321,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-23 19:30:00.0","ID":65439486.0,"Restaurant":"L'Opera"},{"REVIEWTEXT":"Every time we go, we pinch ourselves for being so lucky to have this great restaurant in our neighborhood. The seasonal menu, which changes 4 times a year, is always interesting, with just the right amount of choices. Really fresh ingredients, interesting combinations but never overdone - every ingredient adds something to the dish rather than being added to \"impress\" diners with the sheer number of items in any one dish. Every dish has a unique taste. Their housemate breads are just yummy. Probably shouldn't reveal our thoughts on this, but the appetizer portions are so generous that two of them make for a great meal at a fabulous price. The waitstaff are always pleasant and are well-trained. And it seems that every time we go, chef\/owner Al Paris or his other head chef come out to talk with guests and solicit feedback. Whenever we have friends come in from out of town, this is the first place we think to bring them, knowing we'll all have a great meal and an enjoyable evening. It's","predicted":1,"actual":0,"pos_prob":0.9739135772,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-16 19:00:00.0","ID":77619102.0,"Restaurant":"Heirloom Restaurant"},{"REVIEWTEXT":"Special VIP treatment for a birthday lunch. Scallops from the \"plates\" served with a soup or salad exceptional. Large variety of \"plates\" and salads .The mustard dressing  made plain greens delicious -something for everyone. All salads excellet- shrimp, salmon, lobster... A must for an elegant, superb dining experience.","predicted":1,"actual":0,"pos_prob":0.9757587995,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-13 13:00:00.0","ID":75729501.0,"Restaurant":"The Capital Grille - Garden City"},{"REVIEWTEXT":"The shrimp and garlic is the best!  Be sure to ask for plenty of bread to soak up the garlic, olive oil, and tomato sauce at the bottom.  We love the variety of choices, from the homemade sausage to the sweet and savory bacon wrapped dates.  Every time we  go, we try something new with our usual favorites; we are never disappointed.","predicted":1,"actual":0,"pos_prob":0.966421434,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-21 22:00:00.0","ID":73941785.0,"Restaurant":"Jaleo DC"},{"REVIEWTEXT":"Our first dining experience in May 2014 was awesome, definitely 5 stars all around but last week, we were dissatisfied with the food.  Great service tho","predicted":1,"actual":0,"pos_prob":0.9599318268,"food_rating":2,"overall_rating":3,"dined_date":"2015-02-21 14:00:00.0","ID":73149679.0,"Restaurant":"Gene and Georgetti"},{"REVIEWTEXT":"The Capital Grille never disappoints - the food is always delicious and the service is outstanding.","predicted":1,"actual":0,"pos_prob":0.9985425206,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-26 11:45:00.0","ID":67928908.0,"Restaurant":"The Capital Grille - Troy"},{"REVIEWTEXT":"very enjoyable evening excellent food and service there were several groups that night so it was noisy usually noise is moderate reccomend","predicted":1,"actual":0,"pos_prob":0.9684134597,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-04 21:00:00.0","ID":76768904.0,"Restaurant":"Bridget's Steakhouse"},{"REVIEWTEXT":"Beautiful, wonderful food, excellent service and will visit again!","predicted":1,"actual":0,"pos_prob":0.9846172551,"food_rating":2,"overall_rating":1,"dined_date":"2015-03-27 17:30:00.0","ID":76571357.0,"Restaurant":"Shadowbrook Restaurant Capitola"},{"REVIEWTEXT":"Lunch at Babbo is a hidden gem - definitely worth taking off from work for the day to enjoy the scrumptious truffle tasting menu and usual exemplary service.  Pace was relaxed and the wine pairing w\/overview from sommelier Cristina was wonderful.","predicted":1,"actual":0,"pos_prob":0.9676951668,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-24 13:30:00.0","ID":73896172.0,"Restaurant":"Babbo Ristorante"},{"REVIEWTEXT":"Outstanding steak. Service, ambiance, drinks all first class.  Highly recommend.","predicted":1,"actual":0,"pos_prob":0.9896326578,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-02 17:45:00.0","ID":64685388.0,"Restaurant":"Delmonico's"},{"REVIEWTEXT":"This is the first time I had lunch at the Black Olive.  I decided to try the spatakopia.  It was so delicious that I am still thinking about it.  I have been here for dinner twice and the food has been wonderful every time.  Plan to return for lunch ASAP.","predicted":1,"actual":0,"pos_prob":0.961301298,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-11 12:15:00.0","ID":67240625.0,"Restaurant":"Black Olive"},{"REVIEWTEXT":"This was my second time dining at Le St. Tropez, and I found it every bit as enjoyable as the first time - which was excellent.  It is a very well-run bistro with delicious cuisine, well-prepared and well-served.  Bravo!!","predicted":1,"actual":0,"pos_prob":0.9980354783,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-23 18:00:00.0","ID":69580318.0,"Restaurant":"Le St. Tropez"},{"REVIEWTEXT":"Where else can you find delicious omnivore food with veggies starring  on the top of menu. Great for entertaining because there is a taste treat for everyone.","predicted":1,"actual":0,"pos_prob":0.9651297446,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-24 12:00:00.0","ID":77841268.0,"Restaurant":"Sazerac"},{"REVIEWTEXT":"We've eaten steak at some of the best steak houses in the world.  Hands down, this is by far the best.  Tender, juicy, perfect temp, could literally almost cut it with the fork.  Service was superior.  A great find.","predicted":1,"actual":0,"pos_prob":0.9529431747,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-16 18:00:00.0","ID":77387016.0,"Restaurant":"EDGE Restaurant & Bar"},{"REVIEWTEXT":"Cozy, relaxing, and  fun environment.  Great selection of small plates and entrees; service was excellent and not rushed;  and don't forget to save room for  dessert.  Both the cherry puff tart and the chocolate concoction, both served with vanilla ice cream were deliciously decadent.  We will definitely be returning to try more of the delectable offerings.","predicted":1,"actual":0,"pos_prob":0.9884849943,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-04 18:00:00.0","ID":76772156.0,"Restaurant":"All Purpose"},{"REVIEWTEXT":"We were celebrating a special birthday for one of the women in our party of 3.  Your staff was so attentive and made her feel so good---thank you!!  BTW the food was Great!!","predicted":1,"actual":0,"pos_prob":0.9835072248,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-13 17:45:00.0","ID":70474668.0,"Restaurant":"Aspens Signature Steak"},{"REVIEWTEXT":"We had fabulous service ,food and the best table in the place. Watching the marina!","predicted":1,"actual":0,"pos_prob":0.9535369314,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-05 10:45:00.0","ID":76823129.0,"Restaurant":"Cafe Del Rey"},{"REVIEWTEXT":"Food was great and our server really added to our enjoyment ! We had a very nice time!","predicted":1,"actual":0,"pos_prob":0.9601165643,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-14 19:00:00.0","ID":75908230.0,"Restaurant":"Gusto Cuban Cafe"},{"REVIEWTEXT":"Waitress and staff were very attentive.   Perfect place for a girls night out.   Food and drinks were delicious!","predicted":1,"actual":0,"pos_prob":0.9870071107,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-14 19:15:00.0","ID":67358656.0,"Restaurant":"Orta Restaurant"},{"REVIEWTEXT":"Lovely restaurant.  Excellent service.  Fabulous duck.  Lobster was good -- not as great as the duck, but good.  Definitely recommend eating here.","predicted":1,"actual":0,"pos_prob":0.9551518809,"food_rating":1,"overall_rating":2,"dined_date":"2015-02-20 20:00:00.0","ID":73136719.0,"Restaurant":"The Peacock Inn"},{"REVIEWTEXT":"This was a great place to eat, the food was so delicious and the ambiance was very nice. I took my husband here for his birthday and he loved it.","predicted":1,"actual":0,"pos_prob":0.9878159743,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-04 19:30:00.0","ID":68256136.0,"Restaurant":"Beso"},{"REVIEWTEXT":"The experience starts as soon as you walk in with the warm but yet upscale decor.  Staff has a upscale demeanor but yet very inviting and helpful.  The wait staff was highly professional and yet very good sense of humor and knowledge of food,  service was fantastic.   Then finally why your there,  the food!  The steaks, Lobster and shrimp were all prepared with excellent presentation and tasted all so wonderful.  A place all should experience.","predicted":1,"actual":0,"pos_prob":0.9683526029,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-17 17:00:00.0","ID":79237101.0,"Restaurant":"Joey Gerard's - A Bartolotta Supper Club - Greendale"},{"REVIEWTEXT":"This restaurant is consistently our favorite...great menu choices, nice ambiance, great value on prix fixe weeknight menu. Great place to go for romantic evening or enjoy with friends!","predicted":1,"actual":0,"pos_prob":0.9776290697,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-06 18:00:00.0","ID":77299958.0,"Restaurant":"Il Cielo - Sanibel"},{"REVIEWTEXT":"Took my wife for Mother's Day brunch-very busy lace.  We sat down exactly at our reservation time.  Food and service were excellent.","predicted":1,"actual":0,"pos_prob":0.9877193286,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-10 12:30:00.0","ID":78858958.0,"Restaurant":"Brix Tavern"},{"REVIEWTEXT":"I couldn't say enough. From the second we walked in it was superb. The hosts were lovely and accommodating even when we asked to move inside (it was a little chilly). Our server was amazing. She was friendly, prompt, and made excellent food and wine recommendations. The food. Seriously. It was delicious. I would like to eat here every single day.","predicted":1,"actual":0,"pos_prob":0.9982589803,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-18 19:30:00.0","ID":70690383.0,"Restaurant":"El Chorro"},{"REVIEWTEXT":"Loved out server!  Quick service, great food and fun atmosphere - couldntnof asked for a better time. Thank you!  Well done.","predicted":1,"actual":0,"pos_prob":0.9803558462,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-17 19:30:00.0","ID":77420151.0,"Restaurant":"Maggiano's - Indianapolis"},{"REVIEWTEXT":"Hands down, this is my favorite Nyack restaurant! Not only is the food fabulous, but the entire staff are always so accommodating and knowledgeable and friendly without EVER being overbearing. Every time I go there, I find a little bit of heaven on earth! Kudos to all!!!","predicted":1,"actual":0,"pos_prob":0.9913441131,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-30 18:00:00.0","ID":78175135.0,"Restaurant":"8 North Broadway"},{"REVIEWTEXT":"This is a great restaurant with friendly service, and a fantastic atmosphere.  As a part of  the Lawrys group, the food is exxcellent.  We shared the guacamole appetizer and it was outstanding!  The bar drinks and food are also delicious.","predicted":1,"actual":0,"pos_prob":0.9966003826,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-01 17:00:00.0","ID":78225724.0,"Restaurant":"Tam O'Shanter"},{"REVIEWTEXT":"Brio--great food and many choices on the menu.  Service was excellent, attentive but not intrusive. Noise level was high which made conversation difficult. Nice ambiance.","predicted":1,"actual":0,"pos_prob":0.9784058351,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-28 19:00:00.0","ID":78105459.0,"Restaurant":"BRIO Tuscan Grille - Columbus - Easton"},{"REVIEWTEXT":"So glad to have Jaime's in our town. Solid food - fresh and well prepared.  Don't miss it.","predicted":1,"actual":0,"pos_prob":0.9795843815,"food_rating":2,"overall_rating":1,"dined_date":"2015-05-10 14:00:00.0","ID":78771039.0,"Restaurant":"Jaime's Creole Brasserie"},{"REVIEWTEXT":"As always the food was top notch. First time to have the lobster bisque and it was outstanding.   Nice touch to comp a light chocolate cake to our Birthday girl.   The restaurant staff and server were outstanding.","predicted":1,"actual":0,"pos_prob":0.9951608523,"food_rating":2,"overall_rating":1,"dined_date":"2014-11-21 19:30:00.0","ID":67720701.0,"Restaurant":"Steve Fields Steak and Lobster Lounge"},{"REVIEWTEXT":"Great Italian food.  They offer a wine by the glass of the day which was very good.  Enjoyed the small bit from the chef.  Pizza and calamari were excellent.  Definitely recommend.","predicted":1,"actual":0,"pos_prob":0.9863882429,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-09 19:15:00.0","ID":77034438.0,"Restaurant":"Bistro Milano"},{"REVIEWTEXT":"Had a great meal. Very attentive staff. Fantastic Ambience. The MENU itself was a gem; was Backlight and unique.  Fabulous. A must for everyones visit to Key West","predicted":1,"actual":0,"pos_prob":0.9876803731,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-23 20:00:00.0","ID":76245573.0,"Restaurant":"Hot Tin Roof"},{"REVIEWTEXT":"No issues. Very cheerful and attentive staff. Food was excellent. Made to feel at home as a regular even though first time. We will be back.","predicted":1,"actual":0,"pos_prob":0.9637170345,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-28 18:00:00.0","ID":76431350.0,"Restaurant":"La Mirabelle"},{"REVIEWTEXT":"Great ambiance - wonderful food - great for a business lunch","predicted":1,"actual":0,"pos_prob":0.9717646052,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-29 11:45:00.0","ID":66647810.0,"Restaurant":"Zed's Restaurant"},{"REVIEWTEXT":"The wine bar and iPad listings are fun and interesting. The atmosphere is romantic but loud enough you don't feel like everyone can hear your conversations. The food is always delicious and well prepared. I ordered flowers for my wife and they were waiting for her. the staff is professional, courteous and efficient. We enjoyed drinking at the bar for 2 hours then moving to our table for a late night dinner.","predicted":1,"actual":0,"pos_prob":0.9805453909,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-25 20:30:00.0","ID":66537590.0,"Restaurant":"Fleming's Steakhouse - Livonia"},{"REVIEWTEXT":"The return of Spring means only one thing - outdoor dining at Cafe 157.  My husband and I look forward to a leisurely dinner on their patio in downtown Matthews on Friday nights. The food is excellent and the atmosphere conducive for relaxation and conversation. Especially enjoyed the spinach salad and limoncello dessert on our most recent visit.","predicted":1,"actual":0,"pos_prob":0.9554112514,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-10 19:15:00.0","ID":77221700.0,"Restaurant":"Cafe 157"},{"REVIEWTEXT":"We had the best server and was very friendly and took special attention to our group","predicted":1,"actual":0,"pos_prob":0.981967072,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-09 18:15:00.0","ID":70310086.0,"Restaurant":"Black Angus Steakhouse - Lakewood"},{"REVIEWTEXT":"Great selection of food.  Great selection of wines.  Service friendly and professional.","predicted":1,"actual":0,"pos_prob":0.972542754,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-05 13:15:00.0","ID":76807825.0,"Restaurant":"Stonewood Grill & Tavern - Orlando"},{"REVIEWTEXT":"Wonderful food and service.  Loved all of the fish appetizers especially the tuna.  Roast beef was delicious.  Good time for everyone.  Service was great and server very accommodating. Wonderful place for brunch.","predicted":1,"actual":0,"pos_prob":0.9985288419,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-14 11:00:00.0","ID":80880278.0,"Restaurant":"Bristol Seafood Grill - Leawood"},{"REVIEWTEXT":"Red Feather never disappoints.  Great food!  Great wine! and great service!  An enjoyable experience every time!","predicted":1,"actual":0,"pos_prob":0.9976156139,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-10 19:00:00.0","ID":75596467.0,"Restaurant":"The Red Feather"},{"REVIEWTEXT":"as always, the creole\/cajun cuisine was superb  -- oysters Bienville to start were New Orleans authentic, followed by John Dory with a creole sauce topped with jumbo lump crab meet were fabulous.  Service friendly and attentive which made the neighborhood atmosphere all the more enjoyable.  wine list is surprisingly diverse and affordable. Makes for outstanding casual dining anytime.","predicted":1,"actual":0,"pos_prob":0.9947013559,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-14 19:00:00.0","ID":77305944.0,"Restaurant":"RT's Restaurant"},{"REVIEWTEXT":"We love Mezza Luna and will always spend our special family celebrations there!","predicted":1,"actual":0,"pos_prob":0.955803135,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-27 19:15:00.0","ID":76410259.0,"Restaurant":"Mezzaluna - Half Moon Bay"},{"REVIEWTEXT":"WE WERE TREATED IN A VERY SPECIAL WAY.  THE FOOD WAS VERY GOOD .  WE ENJOYED THE DESSERY, TOO!  THANK YOU VERY MUCH FOR A GREAT  EVENING.","predicted":1,"actual":0,"pos_prob":0.9614890047,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-05 17:30:00.0","ID":78550899.0,"Restaurant":"Truluck's Seafood, Steak and Crab - Naples"},{"REVIEWTEXT":"Outstanding quality.  Food is superior quality and the sides and appetizers are fantastic.,  I highly recommend the butter cake for the dessert.  I think they make it the best of anyone.  the other reason we love this restaurant is the live music.  They always have a wonderful combo singing great music.  Best place to hear them is the bar or the courtyard dining.  If noise is an issue for you, try coming early to watch the sun go down over the ocean.  You can have all the wonderful food and the noise level is moderate.  They start the music in time for the dinner and dessert.","predicted":1,"actual":0,"pos_prob":0.9866104602,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-07 18:45:00.0","ID":67153252.0,"Restaurant":"Mastro's Ocean Club - Newport Beach"},{"REVIEWTEXT":"I enjoy coming here.  The outdoor patio on the lake transports you away from the city and the desert in to a pastoral setting.  The food is always good, the service is too and the wine list is fantastic.  I love the brunch, having a business lunch here or a romantic dinner with live music.  One of the favorite restaurants in Las Vegas.","predicted":1,"actual":0,"pos_prob":0.9716754913,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-27 11:45:00.0","ID":76440358.0,"Restaurant":"Marche Bacchus"},{"REVIEWTEXT":"We visit our son and we're looking for something different. Our waitress Sara was so helpful and pleasant. There is such a varied menu and something for everyone. Will definitely return.","predicted":1,"actual":0,"pos_prob":0.9788329594,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-05 17:00:00.0","ID":71419475.0,"Restaurant":"The Quarter Bistro"},{"REVIEWTEXT":"Server was very knowledgeable about the menu and specials and visited our table several times to ensure we were pleased with our meal. We each had the 3 pasta specials which we enjoyed immensely. Wine was excellent. I would definitely suggest dining at Becco to my friends!","predicted":1,"actual":0,"pos_prob":0.988588059,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-01 17:30:00.0","ID":78221003.0,"Restaurant":"Becco"},{"REVIEWTEXT":"We enjoyed an excellent fish dinner where service matched the perfectly prepared food. Great for special times. Buckhead Group Restaurants do not disappoint!","predicted":1,"actual":0,"pos_prob":0.9950869648,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-20 19:00:00.0","ID":77662942.0,"Restaurant":"Lobster Bar Sea Grille"},{"REVIEWTEXT":"We had an incredible experience at Cork & Cow. The food was delicious from start to finish - steak and vegetables cooked perfectly, terrific gnocchi with shrimp and scallops, and the desserts were amazing, even carrot cake, which I would never typically order given their other options; however, it was highly recommended by Shane, our terrific waiter, and he was right - the sour cream ice cream elevated it to must-order status. The restaurant itself is lovely and elegant, but not stuffy - very comfortable.  We'll definitely go back.","predicted":1,"actual":0,"pos_prob":0.9859126732,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-24 17:15:00.0","ID":71001461.0,"Restaurant":"Cork & Cow"},{"REVIEWTEXT":"Everything was awesome a little pricey though. I would go back again for a special occassion.","predicted":1,"actual":0,"pos_prob":0.987614532,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-05 16:30:00.0","ID":76822959.0,"Restaurant":"Orange County Mining Co."},{"REVIEWTEXT":"Excellent services, excellent Rib and Strip steaks","predicted":1,"actual":0,"pos_prob":0.9905174163,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-16 18:30:00.0","ID":67612424.0,"Restaurant":"Lago"},{"REVIEWTEXT":"This was our first visit.  It was great.  We will be back!","predicted":1,"actual":0,"pos_prob":0.970707736,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-03 19:00:00.0","ID":70131931.0,"Restaurant":"Puckett's 5th & Church"},{"REVIEWTEXT":"All dinner items and desserts were excellent.  Especially the Filet Mignon and the Creme Brule.  Sound quality in the main room was excellent.  Great place for a weekend dinner with friends.","predicted":1,"actual":0,"pos_prob":0.964555567,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-28 20:00:00.0","ID":74200416.0,"Restaurant":"Bake's Place"},{"REVIEWTEXT":"Excellent food and service.  Wine menu allows choices forany budget. Waiter and staff  were very helpful and attentive,","predicted":1,"actual":0,"pos_prob":0.9763071713,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-22 21:00:00.0","ID":76174365.0,"Restaurant":"Giada - The Cromwell"},{"REVIEWTEXT":"Easter was our first time visiting Mill on the River.  We could not have been more pleased.  Food was fabulous, service was perfect and atmosphere was great.  Even the price was reasonable.  We could not have been more pleased.  We'll definitely be back.","predicted":1,"actual":0,"pos_prob":0.9868114009,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-05 12:00:00.0","ID":76880532.0,"Restaurant":"The Mill on the River"},{"REVIEWTEXT":"Our food was fabulous.  Everyone in our group order something different.  They all loved their dinners and said it was the best food they'd eaten on their whole trip!  We will definitely be going back soon.  I had the chicken pot pie.  Wonderful comfort food!!!","predicted":1,"actual":0,"pos_prob":0.9934322452,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-30 17:45:00.0","ID":71319561.0,"Restaurant":"Stonewood Grill & Tavern - Naples"},{"REVIEWTEXT":"First time to Postero and everything was amazing.  The remodel from the old Flight Restaurant was classy and warm.  The food was excellent, and the staff friendly.  Give it a try!","predicted":1,"actual":0,"pos_prob":0.9898878399,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-08 18:00:00.0","ID":76981784.0,"Restaurant":"Postero"},{"REVIEWTEXT":"I visited Grand Rapids to celebrate a milestone birthday, and BBV made the day for me.  The food and the service were outstanding, and they took excellent care of me, even tho' I was a solitary customer.","predicted":1,"actual":0,"pos_prob":0.9734222159,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-03 18:30:00.0","ID":76885042.0,"Restaurant":"Bistro Bella Vita"},{"REVIEWTEXT":"The four of us have a  dinner club where we go to different restaurants weekly. We had  a wonderful dinner of Alligator, Craw fish, and assorted dishes. Its was wonderful and the service was great. The Poppy Pinot  wine was outstanding and the Bananas Foster was beautiful. I had my left overs to go and have been enjoying them for lunch. I forgot  the Jambalaya It was wonderful and we will  be back!","predicted":1,"actual":0,"pos_prob":0.9736444682,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-21 18:00:00.0","ID":70783081.0,"Restaurant":"Rhythm Kitchen Seafood & Steaks"},{"REVIEWTEXT":"It was our anniversary and Kate made sure it was a memorable evening. She went the whole nine yards from explaining the menu, talking to the bar about our choice of wine and recommending great dishes. She even arranged for a nice small anniversary pudding.  We love Trucks and would surely recommend it to friends and family. Again - Kate was wonderful.","predicted":1,"actual":0,"pos_prob":0.9558782538,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-19 19:45:00.0","ID":70692482.0,"Restaurant":"Truluck's Seafood, Steak and Crab House - La Jolla"},{"REVIEWTEXT":"We have dined here often and always had wonderful service and food.","predicted":1,"actual":0,"pos_prob":0.9567010608,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-13 17:30:00.0","ID":72203963.0,"Restaurant":"Bella Aquila"},{"REVIEWTEXT":"Food was prepared perfectly and was delicious. Definitely make reservations for a Saturday night as we probably would not have been seated as it was a busy evening in January, and who would expect- but after our first dining experience, we now understand-excellent restaurant.","predicted":1,"actual":0,"pos_prob":0.9837006832,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-10 18:00:00.0","ID":70327998.0,"Restaurant":"J. Gilbert?s ? Wood Fired Steaks & Seafood ? Glastonbury"},{"REVIEWTEXT":"Food and service were outstanding we love this place","predicted":1,"actual":0,"pos_prob":0.9949559719,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-09 19:00:00.0","ID":80278321.0,"Restaurant":"Barclay's American Grille"},{"REVIEWTEXT":"Excellent service ,one on one attention with your server. Very secluded dining booths and beyond delicious food.","predicted":1,"actual":0,"pos_prob":0.9849983059,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-19 16:15:00.0","ID":66295616.0,"Restaurant":"The Melting Pot - Richmond"},{"REVIEWTEXT":"Loved the eclectic decor. Service is fabulous. Chrissy, our server, was fun and made us feel welcome.  The owner stopped by also. The food has great flavor, home made taste. The bread pudding will be the best you ever have!!!","predicted":1,"actual":0,"pos_prob":0.9670826052,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-16 17:30:00.0","ID":70911391.0,"Restaurant":"Bella Luna Restaurant"},{"REVIEWTEXT":"Awesome wines and great food. We loved the Italian atmosphere. Very rustic and beautiful.","predicted":1,"actual":0,"pos_prob":0.9966595853,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-09 18:00:00.0","ID":70319639.0,"Restaurant":"The Bistro at Gervasi Vineyard"},{"REVIEWTEXT":"great dinner celebrating with friends for special Birthday. Restaurant was very comfortable for a group of 6 including the acoustics. The ambience is casual with a simple farm theme. Nice small bar area. The menu offer a wide variety including several good vegetarian choices. The salads were great and we had a starter of Mussels with a yummy curry sauce , very different from they typical preparation. The special of Blackened Walleye was delicious. Our server was attentive and very helpful. The vegatarians in the group loved their dinners.  Comment, best tofu dinner ever!   Will definitely return.","predicted":1,"actual":0,"pos_prob":0.9907816135,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-28 19:15:00.0","ID":76422422.0,"Restaurant":"Harvest Kitchen & Lounge"},{"REVIEWTEXT":"We had a family group of twelve.  It was fantastic and our waiter, Jacob, did a great job in not only servicing us but helping us in singing Happy Birthday for two family members!  Thanks Jacob for going the extra mile.  We are grateful that we went their and would highly recommend it to anyone that is in the Salt Lake City area.","predicted":1,"actual":0,"pos_prob":0.9780789964,"food_rating":2,"overall_rating":1,"dined_date":"2015-04-25 17:30:00.0","ID":78004170.0,"Restaurant":"The Garden Cafe - Grand America Hotel"},{"REVIEWTEXT":"Fabulous place great food, great service and prices and menu were excellent","predicted":1,"actual":0,"pos_prob":0.9949470883,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-24 19:30:00.0","ID":66486811.0,"Restaurant":"Parc"},{"REVIEWTEXT":"Excellent food and a great family atmosphere. My friends and I eat there often. The service is always great.  There was a newborn (two week old) and little girl 3-4 in a Disney Princess dress in the next booth. The staff was wonderful to them and their family. I don't think I have ever been in a restaurant who was so attentive and it was wonderful to see! Kudos to all!","predicted":1,"actual":0,"pos_prob":0.9926794057,"food_rating":1,"overall_rating":1,"dined_date":"2014-06-29 11:30:00.0","ID":62225508.0,"Restaurant":"V's Italiano Ristorante"},{"REVIEWTEXT":"Went for Dine In week. So happy we did. Atmosphere Calming. Service superb. Food outstanding! Looking forward to going back.","predicted":1,"actual":0,"pos_prob":0.9730973172,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-02 18:00:00.0","ID":74944789.0,"Restaurant":"L'Andana"},{"REVIEWTEXT":"Our dining experience was great. Good food, great service, great ambience. We will dine there again. Thanks","predicted":1,"actual":0,"pos_prob":0.9853557141,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-31 18:00:00.0","ID":71246763.0,"Restaurant":"Buca di Beppo - Macon"},{"REVIEWTEXT":"L. May eatery has a lovely and bright wait staff, always willing to help. The food is great also. We enjoyed the L. May supreme pizza. I can whole-heartedly recommend this gem of a restaurant in Dubuque, Iowa as a place to have fun dining at.","predicted":1,"actual":0,"pos_prob":0.9643825311,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-20 18:00:00.0","ID":65410598.0,"Restaurant":"L. May Eatery"},{"REVIEWTEXT":"Love this restaurant for the ambiance, great menu, delicious and well-presented meals, very friendly and professional staff.  For me, no visit to Monterey is complete without an evening at the Chart House.","predicted":1,"actual":0,"pos_prob":0.9832313334,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-11 19:30:00.0","ID":66098428.0,"Restaurant":"Chart House Restaurant - Monterey"},{"REVIEWTEXT":"The food was so very good we went back the next night.  I can't recommend Passionfish highly enough.  Mussels were the best I've ever had.  Salads were creative and delicious.  The sturgeon was fantastic on a bed of white beans and more, and the two desserts we tried were heavenly.","predicted":1,"actual":0,"pos_prob":0.991307926,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-12 19:15:00.0","ID":70487488.0,"Restaurant":"Passionfish"},{"REVIEWTEXT":"My wife and I have been going to Black Angus since 1982. We celebrated our  wedding engagement in 1981, and Black Angus has always been a very special experience for us. For Mothers Day we took our  daughters and son-in-law to enjoy dinner. We love the \"2 for specials\", with or without a coupon  A lifetime customer.","predicted":1,"actual":0,"pos_prob":0.9575202953,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-10 15:15:00.0","ID":78963416.0,"Restaurant":"Black Angus Steakhouse - Brentwood"},{"REVIEWTEXT":"reserved private room for a work outing.  Gave me a nice sized room called the win room.  Excellent for team lunch.  We were able to speak to each other without yelling at each other.   Great food.","predicted":1,"actual":0,"pos_prob":0.9590069008,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-08 11:30:00.0","ID":65962842.0,"Restaurant":"Wildfire - Glenview"},{"REVIEWTEXT":"We have been dining at Marker 32 for decades. It is always great!  Both the service and food are top of the line. Our favorite spot for special occaisions or to get a great dinner.","predicted":1,"actual":0,"pos_prob":0.9816477148,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-04 19:30:00.0","ID":66982591.0,"Restaurant":"Marker 32"},{"REVIEWTEXT":"The setting is exquisite.  Hostess and servers were very friendly and helpful in making our selections. The adult beverages were yummy. The meals were nicely presented.  They were delicious.  So glad we had the opportunity to visit Mama's.","predicted":1,"actual":0,"pos_prob":0.9779127214,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-08 13:15:00.0","ID":67322754.0,"Restaurant":"Mama's Fish House"},{"REVIEWTEXT":"Cafe Sole is a wonderful find just outside the hustle bustle of downtown. The menu is inventive, the fish dishes excellent and the wine list a nice complement to the food. They have an excellent  early bird dinner, but not a blue haired senior is sight.  The staff was very knowledgeable about the offereings and attentive without being overbearing. We enjoyed it so much we went back twice in the week we were in town and would go out of our way to go there again.","predicted":1,"actual":0,"pos_prob":0.9691553878,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-23 18:15:00.0","ID":79710031.0,"Restaurant":"Cafe Sole - Key West"},{"REVIEWTEXT":"So accommodating for gluten free diners! Our daughter is GF and my husband and I are not, but all the food was great!! Service and waiter were excellent as well!!","predicted":1,"actual":0,"pos_prob":0.9759119287,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-03 19:00:00.0","ID":65729257.0,"Restaurant":"Kenny's Italian Kitchen"},{"REVIEWTEXT":"We've been going to bond st for over 15 years but hadn't been back in quite some time. We went the other night & it was just as amazing as it ever was. Hands down best sushi in NYC. Service impeccable & great ambiance for a date night. Can't wait to go back again!","predicted":1,"actual":0,"pos_prob":0.9673977276,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-09 19:30:00.0","ID":76974881.0,"Restaurant":"BONDST"},{"REVIEWTEXT":"My husband and I live in Santa Fe and this was our first visit.   We were so impressed with the top quality service.   The seafood was some of the best we have had in quiet sometime. A bit pricey but worth the $$$ if you want a very nice dinner with excellent service.","predicted":1,"actual":0,"pos_prob":0.9659779134,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-22 18:00:00.0","ID":67758155.0,"Restaurant":"Galisteo Bistro"},{"REVIEWTEXT":"We arrived about 10 minutes early , reservation for 7:30. We were pretty much sat immediately and water served at the table. Our order was taken by 7:30. Restaurant packed. Nice ambiance. Went there due to son's birthday. We've enjoyed the Thai food there prior. I had yellow curry and chicken satay. Always excellent. Son's birthday and he requested we go there, which is an hour's drive from home. He had prongs and \"rack of lamb\" albeit only complaint was that there were only two pieces of lamb plus the prongs and a specially made rice dish to accompany. Otherwise he said was excellent. For some might have been plenty, but he is a big guy with an equally large appetite. Other party had a traditional Thai dish that he said was excellent. (Don't recall the name but he is typically tough to please. ) As always, coconut cake is to die for. Best I've ever had anywhere hands down. I've had lunch here a handful of times as well and is excellent. Owner\/chef does on occasion if not too busy sto","predicted":1,"actual":0,"pos_prob":0.9755188553,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-07 19:30:00.0","ID":75370011.0,"Restaurant":"Nahm Thai Cuisine"},{"REVIEWTEXT":"We had a group and were seated in a corner, so conversation between all of us was great. Would recommend.  Remember to park underneath in the free and convenient parking garage.","predicted":1,"actual":0,"pos_prob":0.9639461955,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-26 18:30:00.0","ID":71074465.0,"Restaurant":"Stone Creek - Montgomery"},{"REVIEWTEXT":"We have eaten there several times and food is always very good and the service is always  very good.  We  seem to get Kim as our server and she is very pleasant.","predicted":1,"actual":0,"pos_prob":0.984109792,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-12 16:00:00.0","ID":75677388.0,"Restaurant":"Emeril?s Italian Table at the Sands Casino Resort Bethlehem"},{"REVIEWTEXT":"The Monchong fish was perfectly presented and cooked. Anthony, our very knowledgeable and personable server was excellent and the famous hula pie never disappoints. Leilani's is always dependable and excellent for luunch and dinner. They also have the best fish tacos in the islands.","predicted":1,"actual":0,"pos_prob":0.994261878,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-14 18:45:00.0","ID":77313228.0,"Restaurant":"Leilani's on the Beach - Kaanapali"},{"REVIEWTEXT":"Jeff, owner \/chef is very present making sure your experience is perfect. One of, if not the, best wine selection in southern California","predicted":1,"actual":0,"pos_prob":0.9711524605,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-18 19:00:00.0","ID":77514601.0,"Restaurant":"Pamplemousse Grille"},{"REVIEWTEXT":"Everything was great! Tyler was a great server and the food was delicious. One of my favorite restaurants.","predicted":1,"actual":0,"pos_prob":0.99924677,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-15 19:00:00.0","ID":72482649.0,"Restaurant":"House of Japan - Dublin"},{"REVIEWTEXT":"Absolutely outstanding service and food!!!!!!!! Our server Walter a perfect 10!","predicted":1,"actual":0,"pos_prob":0.9967492802,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-18 17:30:00.0","ID":75957395.0,"Restaurant":"Fascino"},{"REVIEWTEXT":"It was our first visit to Vines.  (We had tried before without reservations and were unable to get a table.) We will return.  The service and food were outstanding and we really enjoyed the live jazz group that was playing. We've been to many of the Orlando \"Restaurant Row\" dining establishments and this is definitely one of the best.","predicted":1,"actual":0,"pos_prob":0.9813327146,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-14 19:00:00.0","ID":80810850.0,"Restaurant":"Vines Grille and Wine Bar"},{"REVIEWTEXT":"Kimi's Chophouse has everything you need for a romantic dinner or catch up with a friend. Kimi and her staff are working hard to insure you have a good time.  Chef Matt is amazing.  Must go! But make reservations because she is busy...","predicted":1,"actual":0,"pos_prob":0.9791505644,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-05 18:30:00.0","ID":68348860.0,"Restaurant":"Kimi's Chop & Oyster House"},{"REVIEWTEXT":"Great and unique offerings. excellent service, good wine. Overall an extremely pleasant experience.","predicted":1,"actual":0,"pos_prob":0.981125568,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-07 18:30:00.0","ID":63788153.0,"Restaurant":"The Iberian Pig"},{"REVIEWTEXT":"We appreciated servers being very attentive and friendly.","predicted":1,"actual":0,"pos_prob":0.9576791393,"food_rating":1,"overall_rating":2,"dined_date":"2014-08-27 17:30:00.0","ID":64534670.0,"Restaurant":"Wann Japanese Izakaya"},{"REVIEWTEXT":"Great food and ambiance.  Service was excellent, we enjoyed the experience and would love to return!","predicted":1,"actual":0,"pos_prob":0.9991349306,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-29 18:30:00.0","ID":76489788.0,"Restaurant":"A Caprice"},{"REVIEWTEXT":"Trace is the best dining experience in Austin.  Never will understand why it is not always full.  Very creative menu, attentive service, terrific ambience, and the best, most creative desserts anywhere.  My wife and I eat there every time we come to town.","predicted":1,"actual":0,"pos_prob":0.9938035848,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-03 19:00:00.0","ID":75139257.0,"Restaurant":"Trace - W - Austin"},{"REVIEWTEXT":"Scandinavia house is a wonderful venue to celebrate all the best of Norway, Iceland, Sweden, Denmark and Finland. The food at Smorgas Chef is delicious (be sure to have the juices!) although the menu is a bit limited. Enjoyed the art gallery and movie upstairs and the gift shops are great. There is a reasonably priced parking lot just a a block away by the Morgan Library.","predicted":1,"actual":0,"pos_prob":0.9765046722,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-27 12:30:00.0","ID":69698836.0,"Restaurant":"Smorgas Chef @ Scandinavia House"},{"REVIEWTEXT":"We were pleasantly surprised at the quality of food, presentation, and service. Escargot was delicious, salad  was served in chilled bowls, lettuce was crisp, dressing - home-made. Steaks were perfect. I was especially impressed with the noise level - a quiet atmosphere. The owner greeting us at the table was a special touch. Can't wait to go back for another enjoyable evening.","predicted":1,"actual":0,"pos_prob":0.9538298258,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-07 18:00:00.0","ID":68321568.0,"Restaurant":"Chicago Prime Steakhouse"},{"REVIEWTEXT":"A very good restaurant with always good food.  Great atmosphere.","predicted":1,"actual":0,"pos_prob":0.9713687798,"food_rating":2,"overall_rating":3,"dined_date":"2015-02-14 13:30:00.0","ID":72374855.0,"Restaurant":"Atria's - Murrysville"},{"REVIEWTEXT":"Dinner was wonderful as always. Our server, Stephanie, seemed to be a bit harried by all of the hustle & bustle of the crowd. Overall the evening was terrific. Ruth's Chris is always one of our go to restaurants.","predicted":1,"actual":0,"pos_prob":0.976313633,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-24 19:00:00.0","ID":69596565.0,"Restaurant":"Ruth's Chris Steak House - Austin"},{"REVIEWTEXT":"We picked this restaurant for our anniversary.  We visit Lancaster once a year and will definitely come back next year.  The atmosphere , food and wait staff  was top notch!","predicted":1,"actual":0,"pos_prob":0.9617835106,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-16 18:00:00.0","ID":79267845.0,"Restaurant":"Historic Revere Tavern"},{"REVIEWTEXT":"While in your area we had dinner at Gale's.  The food was terrific and the service was attentive and friendly! Yes, we'll come again!  Come visit us in Santa Fe for similar great food and attentive service!  Bumble Bee Bob & BJ Weil","predicted":1,"actual":0,"pos_prob":0.9877887261,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-05 18:00:00.0","ID":65017608.0,"Restaurant":"Gale's"},{"REVIEWTEXT":"I love Aya sofia!  I recommend highly!  Great food, excellent service, love it, love it, love it!!!","predicted":1,"actual":0,"pos_prob":0.9976005453,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-17 19:30:00.0","ID":66247302.0,"Restaurant":"Aya Sofia"},{"REVIEWTEXT":"Dinner was great, plenty of food, great server and loved the restaurant as a whole. Very rustic. Will be sure to go back in the future.","predicted":1,"actual":0,"pos_prob":0.9778433912,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-27 12:00:00.0","ID":67954488.0,"Restaurant":"New Mill Restaurant"},{"REVIEWTEXT":"Excellent.  The food is inventive and tasty.  The service is charming and attentive.  Loved the experience overall and would go back.","predicted":1,"actual":0,"pos_prob":0.9915911619,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-19 18:00:00.0","ID":72609303.0,"Restaurant":"Stonehome Wine Bar & Restaurant"},{"REVIEWTEXT":"Staff guides you through the menu. Very important because menu is mostly tapas and the menu is diverse. Went there with a group and we were all able to share dishes. The food is fun and interesting. Don't be afraid to try something out of the box. Everything was delicious! L","predicted":1,"actual":0,"pos_prob":0.9507453677,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-23 19:00:00.0","ID":73794136.0,"Restaurant":"Beauty and Essex"},{"REVIEWTEXT":"Sat at table 4, cozy and quiet.  Great wine and specialty drink list.  Fresh bread with whipped butter complimentary and delicious.  Sashimi appetizer outstanding as usual!  Wife ordered from menu, chicken pasta, I from the daily special, braised beef short ribs over grits, both excellent.  Friendly staff from entry to exit.  Our favorite dinner spot, worth the 45 minute drive.","predicted":1,"actual":0,"pos_prob":0.9945136698,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-13 19:00:00.0","ID":75754738.0,"Restaurant":"Winston's Grille"},{"REVIEWTEXT":"Food was excellent and staff equally as well.  I couldn't have asked for better place to dine in Seattle.  I certainly will come back on my next visit.","predicted":1,"actual":0,"pos_prob":0.9763465755,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-20 18:30:00.0","ID":76045229.0,"Restaurant":"The Metropolitan Grill"},{"REVIEWTEXT":"This is one of the best special occasion restaurant in Sugar Land.","predicted":1,"actual":0,"pos_prob":0.973514723,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-17 19:15:00.0","ID":64111567.0,"Restaurant":"Perry's Steakhouse & Grille - Sugar Land"},{"REVIEWTEXT":"The Gambling Cowboy is definitely an upper end special occasion dining experience. It seems to lend itself more to special intimate occasions than lunch or a \"quick bite to eat\"  I believe we will try the patio next time. Very nice place and our meals were excellent.","predicted":1,"actual":0,"pos_prob":0.9550571526,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-18 17:30:00.0","ID":77509795.0,"Restaurant":"The Gambling Cowboy Chophouse and Saloon"},{"REVIEWTEXT":"From friendly, knowledgeable servers to super fresh seafood you will have an enjoyable evening.  While the noise level is high the food and service help you overlook the acoustics.","predicted":1,"actual":0,"pos_prob":0.9859221593,"food_rating":2,"overall_rating":1,"dined_date":"2015-02-27 19:00:00.0","ID":74175277.0,"Restaurant":"Carmine's Crab Shack"},{"REVIEWTEXT":"We had a wonderful meal and experience for our anniversary.  Service was very attentive and the food was great.  I recommend Millwright's for special occasions or just a great dining experience.","predicted":1,"actual":0,"pos_prob":0.9944532649,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-17 18:30:00.0","ID":62931642.0,"Restaurant":"Millwright's"},{"REVIEWTEXT":"Great service!!","predicted":1,"actual":0,"pos_prob":0.9707969471,"food_rating":2,"overall_rating":2,"dined_date":"2015-05-10 11:30:00.0","ID":78710510.0,"Restaurant":"Art and Soul"},{"REVIEWTEXT":"We picked this restaurant for its name as a joke for my daughters birthday dinner as she is always asking where we are going.  The food was great. The drinks excellent but the noise was a little much.  Old steakhouse ambiance the service was great . Never waited or wanted for anything.  We highly recommend this restaurant if you are in the area. One note it is a little hard to find.","predicted":1,"actual":0,"pos_prob":0.9660885417,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-21 18:30:00.0","ID":72878743.0,"Restaurant":"A Restaurant"},{"REVIEWTEXT":"Awesome Italian place. Made our reservations on line at hotel. I suggest reservation for dinner or you will wait. Order each item separate and share. My wife and I will order and share each dish from salad, pizza, pasta and an entree. Service is always great. Most dishes are family style to share so if you go with 4 or more people you can sample more. Love the atmosphere. A lot on the walls to look at.","predicted":1,"actual":0,"pos_prob":0.9778064802,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-02 19:15:00.0","ID":76751797.0,"Restaurant":"Buca di Beppo - Albany"},{"REVIEWTEXT":"The lamb chops are to die for.","predicted":1,"actual":0,"pos_prob":0.9547210998,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-14 17:30:00.0","ID":71758429.0,"Restaurant":"Anatolia Turkish Restaurant"},{"REVIEWTEXT":"Tasting menu with wine pairing an extraordinary experience.  Highly recommend","predicted":1,"actual":0,"pos_prob":0.9707030717,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-07 12:00:00.0","ID":76911235.0,"Restaurant":"Redd Wood"},{"REVIEWTEXT":"This was at least our sixth visit to Marsilios. It is a terrific restauruant with outstanding food, great slection, interesting special and five star service. I had the veal chop and my wife had the lamp chops both nghtly specials. thye did not disappoint.  Recommend this restaurant to those who enjy tradiation Itialian fooon wiht a very good twist.","predicted":1,"actual":0,"pos_prob":0.9746968929,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-25 18:30:00.0","ID":63274868.0,"Restaurant":"Marsilios Kitchen"},{"REVIEWTEXT":"The food was wonderful and the service top notch! Paul was our waiter and made the evening terrific!  The Manager, Sebastian, always treats us like royalty! Our favorite East Bay restaurant hands down.","predicted":1,"actual":0,"pos_prob":0.9829591565,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-04 18:30:00.0","ID":76781879.0,"Restaurant":"Scott's Restaurant - Walnut Creek"},{"REVIEWTEXT":"We discovered The Wild Rose in 2012 when we moved to Utah.  It has been our go to spot for special occasions and for bringing out of town guests.  We always have a great meal and the service is excellent.  Our visit this past Friday was no exception. The food was delicious, the service was great, we couldn't ask for more.","predicted":1,"actual":0,"pos_prob":0.9917746183,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-27 19:00:00.0","ID":76368649.0,"Restaurant":"The Wild Rose"},{"REVIEWTEXT":"Clyde's of Georgetown is an excellent spot to take your student while visiting. The atmosphere is relaxing as well as family friendly. Food is delicious with an extensive menu to choose from.  Clyde's is our favorite place in Georgetown!","predicted":1,"actual":0,"pos_prob":0.9939696339,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-23 17:30:00.0","ID":64372783.0,"Restaurant":"Clyde's of Georgetown"},{"REVIEWTEXT":"I have had the pleasure of dining at Emeril's Italian Table several times a year since it opened at the Sands in Bethlehem. Every meal is absolutely delicious!  My favorite is the calamari and Emeril's lasagne!  Drinks are especially good! Service staff are always friendly, knowledgeable and professional.   I will return again and again with family and friends.  Love it!","predicted":1,"actual":0,"pos_prob":0.996633895,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-03 18:00:00.0","ID":63638481.0,"Restaurant":"Emeril?s Italian Table at the Sands Casino Resort Bethlehem"},{"REVIEWTEXT":"We ate there because of an earlier review -- and we are glad we did.   Amazing food simply presented. Superb, just superb, A \"you-must-try-this-place\" restaurant in Stowe. Our server (Ricky) was a delight -- he added a lot of fun to our dinner. The atmosphere at Ten Acres is wonderfully rustic and authentic (the main part is 200 years old). The owners have done a great job with this place and we'll be back.","predicted":1,"actual":0,"pos_prob":0.9849227785,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-29 20:15:00.0","ID":71151707.0,"Restaurant":"Bistro At Ten Acres"},{"REVIEWTEXT":"Very well trained wait staff.  Very good experience.  The food was good and the service was excellent.","predicted":1,"actual":0,"pos_prob":0.9713058594,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-31 20:30:00.0","ID":69909516.0,"Restaurant":"Pittsburgh Blue - Maple Grove"},{"REVIEWTEXT":"Get the dates, escargot, and rabbit!! The sangria is delicious.","predicted":1,"actual":0,"pos_prob":0.9768589507,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-06 19:30:00.0","ID":67031688.0,"Restaurant":"Vizcaya"},{"REVIEWTEXT":"I have been to Adam's several times and have never been disappointed. Service is great and food is fabulous.  Love their bread pudding for dessert.  Great music too, sometime on the loud but that's to be expected for a small restaurant. If you haven't been it is a must try.","predicted":1,"actual":0,"pos_prob":0.9716096912,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-07 18:30:00.0","ID":71506587.0,"Restaurant":"Adam's Restaurant and Piano Bar"},{"REVIEWTEXT":".great service, right level of attention, made experience outstanding. Great food as always, brunch is wonderful.","predicted":1,"actual":0,"pos_prob":0.999725209,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-05 13:15:00.0","ID":65822536.0,"Restaurant":"The Grand Marlin"},{"REVIEWTEXT":"Excellent food and service. Loved brick walls. Would definitely go back!","predicted":1,"actual":0,"pos_prob":0.9985967662,"food_rating":2,"overall_rating":3,"dined_date":"2014-09-10 17:15:00.0","ID":65032963.0,"Restaurant":"Match Works Tavern"},{"REVIEWTEXT":"We really enjoyed our meal.  They were quick and the food U.S. excellent.  Especially loved the cheesecake with creme broulet.","predicted":1,"actual":0,"pos_prob":0.9916014926,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-21 18:00:00.0","ID":73147029.0,"Restaurant":"Nada"},{"REVIEWTEXT":"Love this place.  My hubby and I consider this our favorite date night destination when we are in Breck.  The food is top notch and has a very relaxing atmosphere.","predicted":1,"actual":0,"pos_prob":0.9682059054,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-01 19:30:00.0","ID":70099895.0,"Restaurant":"Hearthstone Restaurant"},{"REVIEWTEXT":"Our 19th anniversary at Lombardo's was extra special because of the amazing food and the outstanding service! From the moment we arrived to the time we left the people at Lombardo's made us feel special. Our waitress offered us several good suggestions and took great care of us. And the banana cream pie with toffee filling at the end of the evening was truly to die for! We will be back! That's for sure!","predicted":1,"actual":0,"pos_prob":0.986648061,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-10 18:00:00.0","ID":67208480.0,"Restaurant":"Ristorante Lombardo"},{"REVIEWTEXT":"Right in my backyard and my first time here! Fabulous from start to finish with wonderful service. Our waiter was funny and attentive.  So much of the menu was offered on Restaurant Week and everything was perfect. We shared the Calamari and the Elk carpaccio with truffle; so amazing! The Orchietta and the Lamb with Garlic rampini were fantastic entries; perfectly prepared. We were able to chose any dessert from the general menu and I rarely have dessert but was thrilled with the molten chocolate cake with blueberries!  I will return again and again to this wonderful romantic spot, steps from my home but made me feel like I was sitting in Rome.","predicted":1,"actual":0,"pos_prob":0.9970711337,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-31 17:30:00.0","ID":71238089.0,"Restaurant":"Riccardo Trattoria"},{"REVIEWTEXT":"Excellent quality fresh food with perfect seasonings and spices","predicted":1,"actual":0,"pos_prob":0.9903373212,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-12 13:00:00.0","ID":67305316.0,"Restaurant":"Seasons 52 - Costa Mesa"},{"REVIEWTEXT":"Always enjoy the service and food.  Excellent filet and lobster.  The best French Onion Soup!","predicted":1,"actual":0,"pos_prob":0.9875204121,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-29 19:45:00.0","ID":76571586.0,"Restaurant":"Timberline Grill - Ameristar Casino Black Hawk"},{"REVIEWTEXT":"I went to the Epic Restaurant for a birthday dinner with my husband only to be surprised by friends.  The restaurant already had complimentary champagne on the table.  The waitress was amazing.  She was attentive, informative, and friendly.  The manager showed up with a great sense of humor.  W never felt rushed. They even gave me a complimentary dessert.  Steaks and fish were all perfectly prepared.  It may be pricey, but worth every penny! Plus, you have a wonderful view of the lit up Bay Bridge!","predicted":1,"actual":0,"pos_prob":0.976884873,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-07 18:45:00.0","ID":71621001.0,"Restaurant":"EPIC Steak fka EPIC Roasthouse"},{"REVIEWTEXT":"Excellent service and excellent food.  Our server, David, was very knowledgeable of the menu.  We had a great dining experience as this was our first visit.  The gelato was a great way to finish off our evening.","predicted":1,"actual":0,"pos_prob":0.9914614469,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-16 19:15:00.0","ID":72180221.0,"Restaurant":"Pulehu, an Italian Grill"},{"REVIEWTEXT":"This is a great place to have a nice lunch and dinner outside @ Longwood Gardens. We had a great day at the Gardens and this was the perfect end to the day. Great food, service and all around great time.","predicted":1,"actual":0,"pos_prob":0.9968355599,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-12 17:00:00.0","ID":62803423.0,"Restaurant":"1906 at Longwood Gardens"},{"REVIEWTEXT":"The service was excellent.  We particularly enjoyed the food choices and the chef's delivery.  Everything was very tasty.","predicted":1,"actual":0,"pos_prob":0.9896167898,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-10 13:30:00.0","ID":78805349.0,"Restaurant":"Kona Grill - Tampa"},{"REVIEWTEXT":"Our party consisted of 4 adults and 3 kids.  From the moment we arrived, every person that worked here was friendly and helpful.  The food was excellent!","predicted":1,"actual":0,"pos_prob":0.9742981571,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-11 17:30:00.0","ID":77266986.0,"Restaurant":"Plantation Gardens"},{"REVIEWTEXT":"JP has a winner downtown at the Bijou Cafe. Great food great atmosphere staff is awesome what more can you ask for! Highly recommend it","predicted":1,"actual":0,"pos_prob":0.9963483924,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-06 11:30:00.0","ID":71468909.0,"Restaurant":"Bijou Cafe"},{"REVIEWTEXT":"Easy to find, self-parking garage across the street, attentive greet staff, extremely coordinated service staff (!!!), rapid service time, unique presentation of delectable foods and leisurely pace of dining and conversation.  For a packed restaurant, noise level was very acceptable.   Highly recommend.","predicted":1,"actual":0,"pos_prob":0.9735886431,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-28 17:30:00.0","ID":76434753.0,"Restaurant":"Restaurant Eve"},{"REVIEWTEXT":"Everything we had was delicious. The smoked fries and broccoli was so good. The staff was so friendly.","predicted":1,"actual":0,"pos_prob":0.9867212936,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-06 17:30:00.0","ID":75347779.0,"Restaurant":"Plum Bar + Restaurant"},{"REVIEWTEXT":"Our waiter was great! Very nice, knowledgeable and patient.","predicted":1,"actual":0,"pos_prob":0.9776468967,"food_rating":2,"overall_rating":3,"dined_date":"2015-01-27 18:00:00.0","ID":71078513.0,"Restaurant":"CHARISSE Restaurant"},{"REVIEWTEXT":"Friends and I loved it in the Summer, so went back.  It is just as good in the Fall.  The food is absolutely fantastic and the service great.  We plan to return in the Winter.","predicted":1,"actual":0,"pos_prob":0.9550948097,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-05 17:30:00.0","ID":67422605.0,"Restaurant":"The Trattoria"},{"REVIEWTEXT":"The service and food were outstanding. When in Santa Monica again, we would definitely dine at the Bistro.","predicted":1,"actual":0,"pos_prob":0.9725126404,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-07 19:00:00.0","ID":63883179.0,"Restaurant":"Bistro of Santa Monica"},{"REVIEWTEXT":"We arrived a little early  but we're taken to our table right away.  Nice reception\/friendly efficient waiter\/ food great.  All in all a terrific evening.  Thank you","predicted":1,"actual":0,"pos_prob":0.9866869517,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-28 18:15:00.0","ID":74307770.0,"Restaurant":"Stonewood Grill & Tavern - Naples"},{"REVIEWTEXT":"The New York Strip was delicious and the field of lights display next door was so awesome and really created a beautiful Valentine's night.","predicted":1,"actual":0,"pos_prob":0.9564976084,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-14 19:30:00.0","ID":71787779.0,"Restaurant":"The Grove"},{"REVIEWTEXT":"Stafford's Pier - Pointer Room is just an excellent Restaurant to eat, have fun with friends and enjoy the great surroundings of Harbor Springs Michigan.  The Service, Food, hospitality and piano music during dinner was tremendous making the Pier - Pointer Room the perfect place to enjoy a wonderful meal with the complete ambiance package for a special dinner or just an ordinary evening out with with the family especially if you are foodies.  The bar area is a hoppin hot spot on the weekends and a great place to meet friends or make new friends in a separate area away from the Pier - Pointer Room Restaurant.","predicted":1,"actual":0,"pos_prob":0.9594615168,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-27 18:30:00.0","ID":69975789.0,"Restaurant":"Stafford's Pier\/Pointer Room"},{"REVIEWTEXT":"I  had lunch at Hamilton's Kitchen twice in four days.  This restaurant is intimate yet has  plenty of space for large parties.  The outdoor seating is especially pleasant because the landscaping is beautiful in every direction.  The menu offered a variety of foods, some of my favorites and some I had never tried.  Both times I was there, the food was excellent.  I might add, our waiter, Eduardo, was exceptional.  I would recommend this restaurant to anyone who wants a sophisticated yet comfortable setting.","predicted":1,"actual":0,"pos_prob":0.9537072464,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-04 12:30:00.0","ID":78349696.0,"Restaurant":"Hamilton's Kitchen at the Alfond Inn"},{"REVIEWTEXT":"the food was fantastic  and service rely good. win list spectacular ,  food presentation amazing  , taste exquisite .","predicted":1,"actual":0,"pos_prob":0.9916896389,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-18 21:30:00.0","ID":63449345.0,"Restaurant":"miX at Delano Las Vegas"},{"REVIEWTEXT":"A classic gem, Cappy's never fails to meet expectations and then go beyond. Benedicts are creative and there's always amazing specials!","predicted":1,"actual":0,"pos_prob":0.9923332334,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-30 13:00:00.0","ID":68063384.0,"Restaurant":"Cappy's Restaurant"},{"REVIEWTEXT":"The restaurant was great for couples.  The service from start to finish was great.  Our waitress took our coat to the closet and return them to us when we finished.  She was attentive.  The food presentation was wonderful and everything was cooked to order.  I would recommend Stone Creek Dining Company to anyone looking for a relaxing date night.  I will return.","predicted":1,"actual":0,"pos_prob":0.9876784858,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-06 18:15:00.0","ID":68317075.0,"Restaurant":"Stone Creek - Montgomery"},{"REVIEWTEXT":"I am so  awed by the presentation which is surpassed by the flavors.... how do you do it?  Lovely.  It's one of our special spots to go when it is a special time because we are always made to feel special.  thank you.","predicted":1,"actual":0,"pos_prob":0.9555680158,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-22 11:30:00.0","ID":70820320.0,"Restaurant":"Palettes at the Denver Art Museum"},{"REVIEWTEXT":"We visited the restaurant during the Queen's Feast with friends. It was a great experience - first time at restaurant. I would highly recommend.","predicted":1,"actual":0,"pos_prob":0.9667101252,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-21 17:30:00.0","ID":70773686.0,"Restaurant":"Fiamma Restaurant"},{"REVIEWTEXT":"Seven of us got together for a day of fun and adventure. Enjoyed dining outside. Food was great as we're the margaritas!  Our waitress was exceptional.","predicted":1,"actual":0,"pos_prob":0.9740221077,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-21 12:30:00.0","ID":64241779.0,"Restaurant":"Puesto at the Headquarters"},{"REVIEWTEXT":"The food was amazing and the  atmosphere and service were excellent.This is my favorite place to dine!","predicted":1,"actual":0,"pos_prob":0.9980753504,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-17 11:30:00.0","ID":72450011.0,"Restaurant":"Cafe Manna"},{"REVIEWTEXT":"Food and service were excellent Alex behind bar made it even better","predicted":1,"actual":0,"pos_prob":0.9621276157,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-07 19:15:00.0","ID":78595401.0,"Restaurant":"Bondir Concord"},{"REVIEWTEXT":"My first time in Charleston.   Enjoyed many fabulous meals but The Ordinary was my favorite.  Terrific food and great service.   Very accommodating.  Loved the setting too!","predicted":1,"actual":0,"pos_prob":0.9855237484,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-30 18:15:00.0","ID":66783388.0,"Restaurant":"The Ordinary"},{"REVIEWTEXT":"The staff was very attentive and friendly.  The food was inconsistent in quality.  The yellowfin tuna was well prepared and excellent favors.  The black grouper, also cooked to perfection, combination of flavors just didn't work.  That said, their deserts are amazing!","predicted":1,"actual":0,"pos_prob":0.9751515888,"food_rating":2,"overall_rating":3,"dined_date":"2014-11-23 18:30:00.0","ID":67824362.0,"Restaurant":"Ocean Prime - Tampa"},{"REVIEWTEXT":"The crab cheesecake was truly amazing.  Have never had anything anywhere as wonderful.  Our waiter gave us the recipe and we are planning on trying it soon.  I'm sure it won't be as fantastic as the one at Palace Caf?.  Awfully rich, my husband and I shared but highly recommend it.","predicted":1,"actual":0,"pos_prob":0.986300155,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-23 13:00:00.0","ID":70891849.0,"Restaurant":"Palace Caf?"},{"REVIEWTEXT":"We loves Seasons 52, have been on several occasions.  The food is always delicious.  It was my daughters 21st birthday and was a great evening!!","predicted":1,"actual":0,"pos_prob":0.9888845349,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-21 18:00:00.0","ID":72860566.0,"Restaurant":"Seasons 52 - Buckhead"},{"REVIEWTEXT":"Drinks and food were both amazing.  Margaritas were natural, fresh and delicious, as was the table-side gauc.  The restaurant is know for its pork combinations which were as good as advertised.  Excellent service and fun atmosphere.  Can't ask for anything more for a good time at dinner.","predicted":1,"actual":0,"pos_prob":0.9750552988,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-08 17:30:00.0","ID":75497230.0,"Restaurant":"The Mission"},{"REVIEWTEXT":"The service, food, and atmosphere are wonderful. The pimento cheese is a perfect blend of smoothness and spice. The Margherita pizza was bright, fresh, and perfectly seasoned. Other diners at our table had the leafy salads and chicken salad. All were pleased with their selections.","predicted":1,"actual":0,"pos_prob":0.9802671702,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-07 11:30:00.0","ID":76908601.0,"Restaurant":"Central"},{"REVIEWTEXT":"We had a perfect 32nd anniversary dinner.  Filet mignon was outstanding and also the lobster.   Sanni, our server was always smiling and provided exceptional service.  We will be back soon.","predicted":1,"actual":0,"pos_prob":0.9975432372,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-07 18:30:00.0","ID":78764765.0,"Restaurant":"Ruth's Chris Steak House - Wailea"},{"REVIEWTEXT":"My steak with a mushroom crust, as well as my octopus appetizer, was absolutely delicious. The service was very attentive. Our dinner was memorable!","predicted":1,"actual":0,"pos_prob":0.9703075149,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-07 19:00:00.0","ID":67372377.0,"Restaurant":"Oak Tavern"},{"REVIEWTEXT":"Special occasion, celebrating quietly a milestone birthday, two couples, reservation 6:30.   Asked for quiet location suitable for conversation and our seating was perfect.  We all enjoyed our dinner, steaks and prime rib, topped off sharing the amazing bread pudding (huge, rich).  Sat for a couple of hours eating, talking, having a lovely time.  Service was excellent.","predicted":1,"actual":0,"pos_prob":0.9931695908,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-19 18:30:00.0","ID":76069689.0,"Restaurant":"Silver Fox - Fort Worth"},{"REVIEWTEXT":"We had a delicious dinner here.  Each of the 4 of us ordered a different entree and they were all delicious.  Excellent service.","predicted":1,"actual":0,"pos_prob":0.9966130345,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-05 19:00:00.0","ID":62514479.0,"Restaurant":"Lakeside Restaurant & Bar - La Torretta Lake Resort & Spa"},{"REVIEWTEXT":"We love everything about  Grace 1720. Food is wonderful, service is amazing it's great for a social occasions or business meetings.  It is quiet enough you can actually have a conversation with the people at your table!","predicted":1,"actual":0,"pos_prob":0.9922165703,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-18 12:00:00.0","ID":75957694.0,"Restaurant":"grace 17.20"},{"REVIEWTEXT":"Enjoyed the friendly waiters, great service. Lovely entrees with tasty combinations. Adored the fresh fish! Plus key lime pie we squeezed into our tummies. Wines good list and fairly priced.","predicted":1,"actual":0,"pos_prob":0.9541086941,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-12 19:30:00.0","ID":69576447.0,"Restaurant":"Oceanaire Seafood Room - Orlando"},{"REVIEWTEXT":"Food and staff are always excellent.  Kenny knows their wines and my tastes, he pairs both every time with excellent choices !","predicted":1,"actual":0,"pos_prob":0.997798098,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-14 20:30:00.0","ID":71858875.0,"Restaurant":"Pitrelli's Restaurant"},{"REVIEWTEXT":"We have dined here several times.  It's halfway as a meeting spot for my brother and his wife to join us for dinner.  We love the ambiance, the food is always wonderful and we enjoy a great time together.","predicted":1,"actual":0,"pos_prob":0.9839274024,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-11 18:30:00.0","ID":65074151.0,"Restaurant":"Stone Creek - Noblesville"},{"REVIEWTEXT":"Excellent gourmet Spanish food great service. Intimate. My only complaint about this place is it features NY prices.","predicted":1,"actual":0,"pos_prob":0.9782643823,"food_rating":1,"overall_rating":2,"dined_date":"2015-02-14 17:30:00.0","ID":71850510.0,"Restaurant":"BCN Taste & Tradition"},{"REVIEWTEXT":"There were five of us in our party.  We had a 6 p.m. reservation and were seated promptly upon our arrival.  We had five different entrees and each of us thoroughly enjoyed what we ordered.  And we can't say enough about the servers  All of the employees we came in contact with were friendly, efficient and wanted to assure we had a pleasurable dining experience.  This is the second time we've eaten at Carmel Kitchen Wine Bar, and we will most definitely be back again!","predicted":1,"actual":0,"pos_prob":0.9564146645,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-31 18:00:00.0","ID":69932855.0,"Restaurant":"Carmel Kitchen Wine Bar ? Warrington"},{"REVIEWTEXT":"Our server Andrea was very good, she listen to us made some good suggestion.She was there at the  right time when we need something. Your menu section was very good and our meals we had was   excellent. We will  definitely return..","predicted":1,"actual":0,"pos_prob":0.9867335053,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-02 19:30:00.0","ID":78281740.0,"Restaurant":"La Casa Pasta"},{"REVIEWTEXT":"ALWAYS delicious! We enjoyed the great service and ambiance.","predicted":1,"actual":0,"pos_prob":0.9992963682,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-30 17:00:00.0","ID":69922487.0,"Restaurant":"Ralph Brennan's Jazz Kitchen"},{"REVIEWTEXT":"Ellyngton's is a beautiful restaurant in historic hotel downtown with great service and a perfect location for a business lunch.  We dined here specifically because we wanted a quiet place to discuss a business interest and the quiet atmosphere makes that possible.  Wait staff is unobtrusive and professional.  Service is outstanding.  Food is beautifully prepared.","predicted":1,"actual":0,"pos_prob":0.976704489,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-09 12:15:00.0","ID":65028538.0,"Restaurant":"Ellyngton's at the Brown Palace"},{"REVIEWTEXT":"First time there and loved everything the food and service was great i cant wait to return","predicted":1,"actual":0,"pos_prob":0.9957738984,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-11 20:30:00.0","ID":67315753.0,"Restaurant":"Texas de Brazil - Buffalo"},{"REVIEWTEXT":"They had an outdoor dining area that was amazing, the staff friendly and helpful! I definitely would recommend Carlucci's to everyone!","predicted":1,"actual":0,"pos_prob":0.9982820572,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-05 18:00:00.0","ID":80159826.0,"Restaurant":"Carlucci Restaurant Downers Grove"},{"REVIEWTEXT":"This restaurant is  consistently one of Maui's best. Not only is the food well prepared, the service is top notch which is not always the case in other high end restaurants.  Our server was exceptionally knowledgeable about the sourcing of the food and gave excellent suggestions for pairing wines with the food. A wonderful place to celebrate or to have a sunset dinner.","predicted":1,"actual":0,"pos_prob":0.9710660297,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-11 19:00:00.0","ID":73806299.0,"Restaurant":"Wolfgang Puck's Spago in the Four Seasons Resort Maui"},{"REVIEWTEXT":"Love Castle Hill.  Everything is so elegant and welcoming.  The service was outstanding, food was perfect, and the view was awesome.  We only go there when the summer season is over and things are calmer.","predicted":1,"actual":0,"pos_prob":0.9867539802,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-07 12:30:00.0","ID":67227114.0,"Restaurant":"Castle Hill Inn"},{"REVIEWTEXT":"Enjoyable experience even for a Valentine evening.   Service and food absolutely wonderful.   Little noisy when crowded.","predicted":1,"actual":0,"pos_prob":0.9823352844,"food_rating":1,"overall_rating":2,"dined_date":"2015-02-14 18:45:00.0","ID":71779933.0,"Restaurant":"Harvest Seasonal Grill & Wine Bar - North Wales"},{"REVIEWTEXT":"Grilled pineapple was outstanding.","predicted":1,"actual":0,"pos_prob":0.9883208135,"food_rating":2,"overall_rating":3,"dined_date":"2015-03-14 17:30:00.0","ID":75863391.0,"Restaurant":"Fire of Brazil - Downtown"},{"REVIEWTEXT":"Excellent experience. Celebration for my Mother's 70th birthday. Our first time and three friends join us and we all had a lovely time. The food was great and we all took home dinner to our family members. My Mom was given a birthday present by the manager (Mr. T), and a card was signed by the staff. Also, our waitress was wonderful and she treated my mom to the lemon cookies and strawberries with candles and everyone around us sang happy birthday to her. It was a lovely way to celebrate my mom's birthday. We will be back and I am going to come back with my husband and try the couple's special. P.S. The staff should get a special notification, please let them know that the Castro-Weller party love their experience. Thanks","predicted":1,"actual":0,"pos_prob":0.9882273026,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-13 13:30:00.0","ID":71738445.0,"Restaurant":"Maggiano's - Annapolis"},{"REVIEWTEXT":"We went to Le Rendez-vous for a birthday dinner for two.  Everything from our entry to our exit was wonderful.  The service (we had Frank) was timely without being obtrusive, great recommendations on food & wine. .All in all a fantastic experience and will definitely go back.   ....Be sure and have the Grand Marinier souffl?!!!","predicted":1,"actual":0,"pos_prob":0.9963794136,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-03 19:00:00.0","ID":70112434.0,"Restaurant":"Le Rendez-vous Bistro & Restaurant Francais"},{"REVIEWTEXT":"Sonny's is always good for great drinks in a comfortable ambiance. We took friends here for a New Year's dinner and the staff was friendly and very accommodating.","predicted":1,"actual":0,"pos_prob":0.9541216835,"food_rating":2,"overall_rating":3,"dined_date":"2014-12-31 20:00:00.0","ID":69996530.0,"Restaurant":"Sonny's"},{"REVIEWTEXT":"Food and service were excellent. The noise level was abominable","predicted":1,"actual":0,"pos_prob":0.9896760685,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-04 19:30:00.0","ID":64812880.0,"Restaurant":"The Capital Grille - I Drive"},{"REVIEWTEXT":"Wonderful food, excellent service, moderate price range.","predicted":1,"actual":0,"pos_prob":0.970772828,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-14 16:00:00.0","ID":69537262.0,"Restaurant":"Paolo's Italian Restaurant"},{"REVIEWTEXT":"Leanne Logan was a delight; she made our night perfect. The food was superb, and the ambience and service spectacular.","predicted":1,"actual":0,"pos_prob":0.9892946205,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-11 19:30:00.0","ID":71747414.0,"Restaurant":"Joe's Seafood, Prime Steak & Stone Crab - Las Vegas"},{"REVIEWTEXT":"This was our second visit. Schenectadys restaurant week specials brought us back. It was as delicious as we remembered!","predicted":1,"actual":0,"pos_prob":0.9601181368,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-28 17:00:00.0","ID":74184493.0,"Restaurant":"Angelo's Tavolo at Glen Sanders Mansion"},{"REVIEWTEXT":"I celebrated my birthday dinner here with my family and it was probably one of the best meals that I have ever eaten (and I am super picky!) The rustic atmosphere combined with the smaller dining room really made it a peace and quiet experience. Our server was great and we never felt rushed. The food was phenomenal!!! I highly recommend the salmon and bread pudding :)","predicted":1,"actual":0,"pos_prob":0.9914104311,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-06 19:30:00.0","ID":67046008.0,"Restaurant":"Rustic Tavern"},{"REVIEWTEXT":"Sean is such a professional server and his knowledge of wine is amazing.  We always ask for him even though there are many outstanding employees of this top notch restaurant.","predicted":1,"actual":0,"pos_prob":0.9943784588,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-02 19:15:00.0","ID":78306393.0,"Restaurant":"Talavera"},{"REVIEWTEXT":"Great!  Everything was great.  The best service in USA.","predicted":1,"actual":0,"pos_prob":0.9984462336,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-07 13:00:00.0","ID":63777007.0,"Restaurant":"Eleven Madison Park"},{"REVIEWTEXT":"Wonderful food, great staff.  The location is absolutely beautiful and quaint.  The trout was just delicious and the desserts are quite sinful.  I have been here at least three times and I can not wait to come back.","predicted":1,"actual":0,"pos_prob":0.954049332,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-09 19:00:00.0","ID":66100768.0,"Restaurant":"The Harvest Grill at Shelton Vineyards"},{"REVIEWTEXT":"Wonderful selection of small plates. Very creative combination of tastes. Great for sharing. Would definitely  return.","predicted":1,"actual":0,"pos_prob":0.9941587632,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-26 13:30:00.0","ID":69691515.0,"Restaurant":"ABC Cocina"},{"REVIEWTEXT":"Fabulous restaurant!! Definitely worth every penny. Great service, authentic food & really cool atmosphere. Again, OUTSTANDING food. Can't wait to return.","predicted":1,"actual":0,"pos_prob":0.9977875945,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-28 18:15:00.0","ID":63371337.0,"Restaurant":"NOLA Restaurant"},{"REVIEWTEXT":"Definitely the best meal I've had in Sarasota. Lovely atmosphere, great service, and excellent food!","predicted":1,"actual":0,"pos_prob":0.9984638843,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-15 18:45:00.0","ID":71903318.0,"Restaurant":"Selva Grill"},{"REVIEWTEXT":"This was an absolute find.  Some of the best Italian food we have ever experienced.  The mozzarella appetizer was outstanding along with the calamari.  Had the rigatoni carbonara which was out of this world.  Can see why this is one of the most popular restaurants in St. Helena. Our whole group loved it.","predicted":1,"actual":0,"pos_prob":0.9754430482,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-08 13:15:00.0","ID":67167908.0,"Restaurant":"Tra Vigne"},{"REVIEWTEXT":"Absolutely great food, service, and everyone's is friendly smiling and make you feel important . I had the Filet And lobster and both tasted great. My wife had the new chicken dish and thought it was excellent, my daughter had the prime rib special and was very happy with getting salad, prime rib, one side item and dessert for about $40 which is much lower than their regular menu. I highly recommend Flemings for special occasions and Sunday night special.","predicted":1,"actual":0,"pos_prob":0.9877135559,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-01 18:00:00.0","ID":74342489.0,"Restaurant":"Fleming's Steakhouse - Raleigh"},{"REVIEWTEXT":"If I am taking the time to meet with special people and have a fabulous meal, there are very few restaurants where you can actually enjoy your meal and your conversation. I have been to this wonderful restaurant twice with 4 additional people.  We all had a great time and each dish was superb. But, most importantly, we were very comfortable, could hear everyone at the table and enjoyed the ambiance. Thank you Catalyst.","predicted":1,"actual":0,"pos_prob":0.9853324973,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-03 18:00:00.0","ID":63663947.0,"Restaurant":"Catalyst Restaurant"},{"REVIEWTEXT":"Our meal was one of a kind, the filet was cooked to perfection and had a wonderful taste that melted in your mouth.  The appetizer we had was the bacon with maple syrup cotton candy was quite unique and worth the price.  The two sides we ordered were delicious and plenty of the two of us to share.  We were too stuffed to order dessert, so not sure how those were, but the meal left us full and quite satisfied.  I would highly recommend Kayne Prime to anyone who goes to Nashville.  The staff and our waiter were top notch and made our dinner experience a great one.","predicted":1,"actual":0,"pos_prob":0.9531310875,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-31 18:00:00.0","ID":64601509.0,"Restaurant":"Kayne Prime"},{"REVIEWTEXT":"Always good. Amazing chopped salad. Great lobster flown in fresh daily. Nice crab special on right now. Broad menu with lots of choices.","predicted":1,"actual":0,"pos_prob":0.9784673662,"food_rating":2,"overall_rating":3,"dined_date":"2014-10-30 18:30:00.0","ID":66684185.0,"Restaurant":"Di Pescara"},{"REVIEWTEXT":"Excellent from beginning to end.  Made our reservation for 7:15 on a Saturday night through OpenTable.  The restaurant was packed upon arrival.  We were directed to the bar while we waited for a table which only lasted 10 minutes.  The drinks were good and we saw several couples dressed for the Edwardian Ball.  What a delight!  We were seated the best table possible for my party; in the front of the restaurant looking out on Van Ness. Our waiter was amazing and directed us to a wonderful special on the menu: filet & lobster. It was delicious & a good value. I would definitely want to go again.  As soon as possible. Today.  Now.    Me: \"Honey?  Honey?  You hungry? \"","predicted":1,"actual":0,"pos_prob":0.9638750615,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-17 19:15:00.0","ID":71175721.0,"Restaurant":"Ruth's Chris Steak House - San Francisco"},{"REVIEWTEXT":"Great evening---one of our favorite restaurant in America. Dependable knowing upon entering door- you wil have a great evening","predicted":1,"actual":0,"pos_prob":0.9778102316,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-14 18:30:00.0","ID":71821838.0,"Restaurant":"Filomena Ristorante"},{"REVIEWTEXT":"Our server was amazing! He was attentive and so nice. He made awesome suggestions and was very interactive with our table  the entire staff was also very friendly  thanks for a great experience!","predicted":1,"actual":0,"pos_prob":0.996746365,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-28 18:00:00.0","ID":76450489.0,"Restaurant":"The Melting Pot - La Jolla"},{"REVIEWTEXT":"Great food.  Great service. Great ambiance.  Never disappoints.  And now they serve Rocket Baby bread with dinner.  The best bread in town!","predicted":1,"actual":0,"pos_prob":0.9888426549,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-21 18:15:00.0","ID":67785078.0,"Restaurant":"Bartolotta's Lake Park Bistro"},{"REVIEWTEXT":"We were celebrating our 30th Wedding Anniversary and a friend recommended Strega Bistro. We are so happy she did. Nice atmosphere, professional and friendly service.  The food was off the charts. From appetizers to the dessert all the food was delicious. We would highly recommend Strega Bistro.","predicted":1,"actual":0,"pos_prob":0.9907806641,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-25 17:15:00.0","ID":70984189.0,"Restaurant":"Strega Bistro"},{"REVIEWTEXT":"We had prime rib...it  was wonderful...melt in your mouth and very tasty!  Spinach salad excellent.  Very festive atmosphere on Cmas day....waiter, Jeremy,  also excellent....attentive.  View from Chart house is the best!  Sundown with some clouds and pink throughout....and then the lites in the city come up.  It is a gorgeous place with view and excellent food and service!","predicted":1,"actual":0,"pos_prob":0.9931353294,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-25 16:15:00.0","ID":69639008.0,"Restaurant":"Chart House Restaurant - Portland"},{"REVIEWTEXT":"Before theater, it is worth having dinner at your restaurant!  I took my granddaughter, and the staff made her feel like a million dollars!  Kids menu is terrific, and the service outstanding! Thanks!","predicted":1,"actual":0,"pos_prob":0.9690183503,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-30 18:15:00.0","ID":65632977.0,"Restaurant":"Palm Restaurant - San Antonio"},{"REVIEWTEXT":"I had such a pleasant evening. Our waiter was very friendly and the view was amazing. Definitely worth the price!","predicted":1,"actual":0,"pos_prob":0.9583674966,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-10 18:00:00.0","ID":67263596.0,"Restaurant":"Five Sixty by Wolfgang Puck"},{"REVIEWTEXT":"Chicken marsala meatballs were absolutely delicious; wanted to try orzo meatballs too but not available that day; gorgonzola \/kale pizza was divine! And loved that Italian\/Caesar salad dressing. Seated at a nice table by window and experienced great service. Nice atmosphere but noisy. Would highly recommend this restaurant and will go again.","predicted":1,"actual":0,"pos_prob":0.9525905602,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-31 13:30:00.0","ID":71291767.0,"Restaurant":"Giada - The Cromwell"},{"REVIEWTEXT":"We visited this restaurant for a birthday dinner.    The food was great and the service was great as well.  We ordered a nice selection of wines and brought in a birthday cake.   The server so generously cut the cake for us and they were all very polite to us.","predicted":1,"actual":0,"pos_prob":0.9606264074,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-28 18:00:00.0","ID":76432059.0,"Restaurant":"Culinary Arts Restaurant"},{"REVIEWTEXT":"Our server David was excellent! Knowledgeable and attentive. I've been there for dinner when the food was better but it left a lot to be desired this time. Dessert was delicious though. Great wine list.","predicted":1,"actual":0,"pos_prob":0.9529312392,"food_rating":2,"overall_rating":3,"dined_date":"2015-02-13 20:15:00.0","ID":71806763.0,"Restaurant":"De Novo"},{"REVIEWTEXT":"excellent service and food.  this says it all.  all in my party really enjoyed the food and service and would return again.","predicted":1,"actual":0,"pos_prob":0.972723397,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-01 19:15:00.0","ID":67239060.0,"Restaurant":"Morton's The Steakhouse - Dallas"},{"REVIEWTEXT":"I love this restaurant.  The ambiance is fun, the music is nostalgic and the service is always first rate.  The food is excellent - I have had several dishes and they are all terrific.","predicted":1,"actual":0,"pos_prob":0.9831791557,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-25 18:30:00.0","ID":65475925.0,"Restaurant":"Buca di Beppo - Westlake"},{"REVIEWTEXT":"Second time for supper. Wife and I had wonderful, romantic dinner celebrating her birthday. Service, food and environment were splendid. Will be back.","predicted":1,"actual":0,"pos_prob":0.9655367321,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-09 19:00:00.0","ID":63859954.0,"Restaurant":"The Leopard Lounge and Restaurant - The Chesterfield Hotel"},{"REVIEWTEXT":"It was my husbands 50th birthday. I made the right choice when I picked Oak. The food was delicious and atmosphere was great. We will be back:)","predicted":1,"actual":0,"pos_prob":0.993776103,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-21 18:30:00.0","ID":72860553.0,"Restaurant":"Oak Steakhouse"},{"REVIEWTEXT":"Magnolia's is the restaurant that I take my friends and family when they visit Charleston.  The food is excellent!  The menu provides something for everyone, including children.  The service is always good and very professional.","predicted":1,"actual":0,"pos_prob":0.9855886008,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-17 13:00:00.0","ID":77418677.0,"Restaurant":"Magnolias"},{"REVIEWTEXT":"We love the Library IV..fantastic salad bar, great place to meet friends from town there..love the bartenders...servers are great, hostess are friendly and cheerful.....drinks are good and food is wonderful.  We met there three years ago at a class reunion, so The Library has a special place in our hearts.  Thank you for such a great evening.  Tom & Carol Richards","predicted":1,"actual":0,"pos_prob":0.9944034179,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-31 19:00:00.0","ID":69988374.0,"Restaurant":"Library IV"},{"REVIEWTEXT":"I have been coming to the melting pot for many years. The food is DELICIOUS and so filling.  One of my favorite places to dine.","predicted":1,"actual":0,"pos_prob":0.9761354703,"food_rating":1,"overall_rating":3,"dined_date":"2014-12-23 17:30:00.0","ID":69580748.0,"Restaurant":"The Melting Pot - Columbus"},{"REVIEWTEXT":"Very pleasant dining experience.  Food was excellent - wait staff efficient and attentive.  Attractive, light and contemporary dining space.  The hard surfaces make it a little noisy but are able to carry on conversation without difficulty, especially in a booth","predicted":1,"actual":0,"pos_prob":0.986075818,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-22 11:45:00.0","ID":66406654.0,"Restaurant":"Bazille ? Nordstrom St. John Town Center"},{"REVIEWTEXT":"As you would expect from the Bartolotta group, Joey Gerard's is dining very well done.  The format at \"Joey's\" provides an updated version of the traditional Wisconsin \"Supper Club\" with delicious food, excellent service and a relaxing yet semi-formal atmosphere.","predicted":1,"actual":0,"pos_prob":0.9632193409,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-10 18:30:00.0","ID":62680389.0,"Restaurant":"Joey Gerard's - A Bartolotta Supper Club - Greendale"},{"REVIEWTEXT":"Not sure where this catchy name comes from but it is one you want to remember!  Great contemporary decor, open plan good for mingling at the bar and arranging the large dining area for 2 or 22+ people. Menu features interesting combinations of local California ingredients to suit all palates. Iceberg wedge salad, salmon entree and the marscapone (sp?) cheese cake were delicious with unique special flavors. One of our party is a vegan and she loved the beet salad and the carrots starter. Cocktails are outstanding; bar staff takes pride in their knowledge, presentation and congeniality. My husband ordered a Rob Roy, I ordered a \"wet\" martini and both were perfect. Savvy staff, a hip happy hour makes Zimzala one to return to.","predicted":1,"actual":0,"pos_prob":0.9791947555,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-30 18:00:00.0","ID":66690433.0,"Restaurant":"Zimzala - Shorebreak Hotel"},{"REVIEWTEXT":"Normally get very good food and service. Brunch is always good. Wife loves their creme br?l?e.","predicted":1,"actual":0,"pos_prob":0.9753561999,"food_rating":1,"overall_rating":3,"dined_date":"2014-08-24 20:00:00.0","ID":64367794.0,"Restaurant":"Polaris Grill"},{"REVIEWTEXT":"Had a great experience.  So nice to have such a different option in Greenwood. Our food was wonderful and the service was great.  I will be bringing my husband and friends back soon!","predicted":1,"actual":0,"pos_prob":0.9926241323,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-05 19:00:00.0","ID":66998584.0,"Restaurant":"Revery"},{"REVIEWTEXT":"Took old friends to Provenance on Saturday night.   We hadn't seen these friends since Thanksgiving and the server allowed us to take our time and \"catch up\".  The menu was perfect for our carnivore friends who also enjoyed a Lemon Drop martini before ordering wine.  They loved Provenance and will be taking their adult children when they visit from the east coast next month.","predicted":1,"actual":0,"pos_prob":0.9563149871,"food_rating":2,"overall_rating":2,"dined_date":"2015-04-25 18:15:00.0","ID":78006844.0,"Restaurant":"Provenance"},{"REVIEWTEXT":"Terrific service - very professional waiter - Outstanding.","predicted":1,"actual":0,"pos_prob":0.9825495243,"food_rating":2,"overall_rating":3,"dined_date":"2015-04-25 17:30:00.0","ID":78070355.0,"Restaurant":"Scott's Restaurant - Walnut Creek"},{"REVIEWTEXT":"The food was delicious and there were refreshingly unique selections on the menu. The wine list crept up in price pretty quickly, but it didn't stop us from finding a great bottle that paired well with our courses. Great martinis, too. We will be back.","predicted":1,"actual":0,"pos_prob":0.9889968343,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-13 19:30:00.0","ID":72878209.0,"Restaurant":"Osteria"},{"REVIEWTEXT":"I truly wonder how this restaurant could have been off our foodie radar for so long! From the first greeting by Mara, the hostess and wife of the chef, to our farewell, everything was perfect. I love how Mara recommended different dishes and attempted to accommodate our family's needs. The pasta with \"caviar\" truffles was inspired, the perfect way to meld molecular gastronomy and traditional dishes. We look forward to a return visit and soon!","predicted":1,"actual":0,"pos_prob":0.9598249377,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-23 17:30:00.0","ID":64349268.0,"Restaurant":"Sfixio"},{"REVIEWTEXT":"Awesome - my wife and I took our Mom's there for Mother's day - a day early - they loved the place.","predicted":1,"actual":0,"pos_prob":0.9918271804,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-09 14:45:00.0","ID":78722908.0,"Restaurant":"Maggiano's - Annapolis"},{"REVIEWTEXT":"really enjoy being pampered by attentive service details Ivy provide, such as complimentary champagne during Saturday lunch rush hour and free box of their excellent cookie in the morning.. great for people watching, very LA. if only Ivy can hire real chef to make real good food that will be perfect.","predicted":1,"actual":0,"pos_prob":0.9777408154,"food_rating":2,"overall_rating":3,"dined_date":"2015-04-12 11:45:00.0","ID":77359438.0,"Restaurant":"The Ivy"},{"REVIEWTEXT":"The food was outstanding, served in a very classy manner and at a very comfortable pace. Our server was great with an exceptional wine recommendation. A perfect birthday dinner.","predicted":1,"actual":0,"pos_prob":0.9980175927,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-03 17:30:00.0","ID":71412357.0,"Restaurant":"BRIO Tuscan Grille - Woodlands - The Woodlands"},{"REVIEWTEXT":"Wonderful ambiance in the outside dining area as well as inside. Perfect lighting with heat torches to address the evening chill. The menu is somewhat limited but very interesting. Special and interesting ingredients. A great addition to the downtown scene. Also a vibrant night spot later in the evening and on weekends.","predicted":1,"actual":0,"pos_prob":0.9732339116,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-06 19:00:00.0","ID":70228298.0,"Restaurant":"Social Eatery & Bar"},{"REVIEWTEXT":"We went for a retirement dinner where everyone would feel comfortable. Comfortable with the atmosphere, food and the show from the cooks. We all had something different for our meal and everyone ate up!  It was a fun and relaxing time Thank You.","predicted":1,"actual":0,"pos_prob":0.9623413696,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-06 18:30:00.0","ID":80152566.0,"Restaurant":"Benihana - Coral Springs"},{"REVIEWTEXT":"We had a wonderful evening. Reservation was easy online.  Service was perfect.  Attentive, but not annoying or pestering.  Food was delicious.  We were celebrating our 35 wedding anniversary - and you made our day extra specials!  Thank you!  We'll be back!!","predicted":1,"actual":0,"pos_prob":0.9985984062,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-18 19:30:00.0","ID":66352519.0,"Restaurant":"Baxter's Lakeside Grille"},{"REVIEWTEXT":"We were celebrating a birthday; everything was really good.  Our experience was enhanced by our waiter, Seth.  It was our first time dining at Soto, he explained everything and made great suggestions.  He is a plus for the restaurant.  We will all definitely go there again.","predicted":1,"actual":0,"pos_prob":0.984499898,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-24 17:30:00.0","ID":66548163.0,"Restaurant":"Sotto"},{"REVIEWTEXT":"Our evening was such a great get away from the everyday. Our server, Shawn, was great. His recommendations were fantastic. He had a great knowledge of the food, and being a 'foodie' I love it when servers have a good grasp of what is on the menu and what the prominent flavor sand profiles are. It makes choosing an entree easier. Our whole group enjoyed their evening. Even one of our party had food allergies, and they were not even an issue. Which was great!  Thanks so much!!!","predicted":1,"actual":0,"pos_prob":0.9596330141,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-15 17:30:00.0","ID":67416326.0,"Restaurant":"Vineyard Rose at South Coast Winery"},{"REVIEWTEXT":"We showed up with reservations after a Blue Man Group Show.  It was a very little spot but accommodated us well with 2 adults and 3 kids.  The food was excellent!  Definitely worth it even with the little extra noise.  My kids loved everything they ordered plus ours.  I would recommend reservations if you want to go.","predicted":1,"actual":0,"pos_prob":0.9823735955,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-01 19:30:00.0","ID":70438553.0,"Restaurant":"Mia Francesca"},{"REVIEWTEXT":"Celebrated our 50th wedding anniversary at Pascal's on Friday. The usual great food and service!  Need that Barbequed Shrimp on every visit from Michigan!!","predicted":1,"actual":0,"pos_prob":0.9679610155,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-15 19:30:00.0","ID":64031161.0,"Restaurant":"Pascal's Manale"},{"REVIEWTEXT":"We really enjoyed our dinner and the special attention we received because it was our anniversary. We had a special note from them with an offer of a champagne toast! Great food and service, as always.","predicted":1,"actual":0,"pos_prob":0.9878624564,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-31 18:15:00.0","ID":71251077.0,"Restaurant":"Bristol Seafood Grill - Creve Coeur"},{"REVIEWTEXT":"It was a wonderful way for us to celebrate our 45th anniversary!  When our server heard it was our anniversary she presented us with a special Anniversary dessert.  What a wonderful touch!!!","predicted":1,"actual":0,"pos_prob":0.9668147414,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-21 10:00:00.0","ID":69620255.0,"Restaurant":"Lake Terrace - The Broadmoor"},{"REVIEWTEXT":"My favorite place 2 go 2, for years.  Always a great meal, great service.","predicted":1,"actual":0,"pos_prob":0.9923409301,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-08 17:30:00.0","ID":67181201.0,"Restaurant":"Chardonnay's"},{"REVIEWTEXT":"The food  and service were excellent; I would definitely recommend it.","predicted":1,"actual":0,"pos_prob":0.9977252637,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-25 18:15:00.0","ID":77896043.0,"Restaurant":"BRIO Tuscan Grille - Marlton - The Promenade at Sagemore"},{"REVIEWTEXT":"It was a pleasure to dine at a restaurant with such delicious food and excellent service.  I hope to return very soon.","predicted":1,"actual":0,"pos_prob":0.9830499964,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-12 13:15:00.0","ID":63956854.0,"Restaurant":"Gotham Bar and Grill"},{"REVIEWTEXT":"My wife and I along with special friends had a wonderful meal at Prime 47.  The food was excellent and the service was wonderful.  Will come back!","predicted":1,"actual":0,"pos_prob":0.9946344831,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-01 18:00:00.0","ID":66750581.0,"Restaurant":"Prime 47 - Indianapolis"},{"REVIEWTEXT":"Our service waiter Kote was excellent and very efficient, polite and brought all food in a timely manner. He made our \"birthday experience\" very pleasant!","predicted":1,"actual":0,"pos_prob":0.9789666435,"food_rating":2,"overall_rating":3,"dined_date":"2014-11-15 18:30:00.0","ID":67425970.0,"Restaurant":"Wildfox"},{"REVIEWTEXT":"Excellent experience from appetizer through dessert.  Great Indian food and service","predicted":1,"actual":0,"pos_prob":0.9927657411,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-17 20:00:00.0","ID":77560742.0,"Restaurant":"Tamarind - Tribeca"},{"REVIEWTEXT":"The service was perfect: timing, attention, explanation about the plates. Great!!!  The food was very good too: prosciutto entree and pasta plates.","predicted":1,"actual":0,"pos_prob":0.9611313042,"food_rating":2,"overall_rating":3,"dined_date":"2014-08-22 18:30:00.0","ID":64299767.0,"Restaurant":"Riccardo Trattoria"},{"REVIEWTEXT":"Chef Albert Hall's cuisine is always a winner!  This occasion (celebrating a birthday)  was no exception.  The restaurant is attractively appointed and provides  a spectacular view of Tucson and surrounding environs.  Our waiter was very helpful in making several menu and wine list recommendations.  We thoroughly enjoyed dining at Acacia, and we shall certainly return soon.","predicted":1,"actual":0,"pos_prob":0.9530014786,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-05 17:00:00.0","ID":75603136.0,"Restaurant":"Acacia real food & cocktails"},{"REVIEWTEXT":"This was one of the few reservations made before leaving Scotland and was for my birthday.  Were quickly shown to our table and c offered drinks. The meal we had was fantastic. Mu wife had abalone chowder followed by veal whilst I had sardines followed by steak and lobster. Best steak ever and beautiful lobster. First class meal with excellent service. Highly recommend this restaurant","predicted":1,"actual":0,"pos_prob":0.9593217187,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-06 19:00:00.0","ID":67031464.0,"Restaurant":"Sardine Factory"},{"REVIEWTEXT":"A true japanese restaurant in Waikiki, the food presentation is outstanding and quality superb, great selection","predicted":1,"actual":0,"pos_prob":0.986952358,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-30 19:30:00.0","ID":71205225.0,"Restaurant":"Odoriko Restaurant"},{"REVIEWTEXT":"We love dining at Ken&Sues simply because the food is wonderful, affordable,and the service is great.  We pick it for special occasions or just a friendly place to have dinner with friends.  The Grouper is a favorite, but also the Spicey Shrimp bowl is great too.  And the appetizers are some of our favorites.  Again the shrimp rolls or tempura shrimp get our vote.  The patio is very pleasant in the summer too.  Its our favorite restaurant.","predicted":1,"actual":0,"pos_prob":0.9624659638,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-05 17:00:00.0","ID":65864832.0,"Restaurant":"Ken & Sue's"},{"REVIEWTEXT":"My wife and I enjoyed a fantastic dinner to celebrate our 35th wedding anniversary. The music was excellent, the staff attentive, and the food was delicious!","predicted":1,"actual":0,"pos_prob":0.9995245259,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-10 18:45:00.0","ID":70350824.0,"Restaurant":"Regency Dining Room - The Hotel Roanoke & Conference Center"},{"REVIEWTEXT":"We hav dined at Sapori several times. Never disappointed. Anyone looking for great food made from natural ingredients should try it. We travel an hour to get there and always worth it. The staff is also very good. Chef Sal is an amazing chef , he always has a new dish that is worth trying.","predicted":1,"actual":0,"pos_prob":0.9878433903,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-21 16:30:00.0","ID":65385853.0,"Restaurant":"Sapori Italian Restaurant"},{"REVIEWTEXT":"Great place to have a wonderful meal & get away from the casino. Quiet, excellent service and presentation. This was our third time eating at Lone Wolf for a very special occasion.","predicted":1,"actual":0,"pos_prob":0.9825329014,"food_rating":2,"overall_rating":3,"dined_date":"2015-05-07 16:00:00.0","ID":78625676.0,"Restaurant":"Lone Wolf Restaurant and Lounge"},{"REVIEWTEXT":"Serafina is a great spot for lunch. The pizza is delicious and the inside of the restaurant is very nice. I would highly recommend this restaurant to others.","predicted":1,"actual":0,"pos_prob":0.986411211,"food_rating":2,"overall_rating":3,"dined_date":"2014-08-14 12:45:00.0","ID":64007156.0,"Restaurant":"Serafina"},{"REVIEWTEXT":"We went here on the occasion of our 35th anniversary and had a wonderful time.  The staff quickly found out about our anniversary and within 5 minutes we had a card delivered congratulating us, signed by all the staff.  The service and food matched this attention to detail and level of excellence.  Great spot.","predicted":1,"actual":0,"pos_prob":0.9690751056,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-11 20:45:00.0","ID":63946918.0,"Restaurant":"Not Your Average Joe's Woodbridge"},{"REVIEWTEXT":"i took my fiance out for her birthday and she fell in love from the moment she walked in!!!! The atmosphere was friendly and the food was excellent. The servers were on point and the overall experience was superb.","predicted":1,"actual":0,"pos_prob":0.9862912776,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-02 17:15:00.0","ID":70119439.0,"Restaurant":"Texas de Brazil - Norfolk"},{"REVIEWTEXT":"Food is always good and service and ambiance are always perfect.","predicted":1,"actual":0,"pos_prob":0.9964272145,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-21 18:30:00.0","ID":67771707.0,"Restaurant":"The Grape"},{"REVIEWTEXT":"We enjoyed a superb seafood dinner, everything fresh and well prepared just as it was described in the menu.  We'll be back!","predicted":1,"actual":0,"pos_prob":0.9948869686,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-23 17:00:00.0","ID":79454614.0,"Restaurant":"Finz Salem"},{"REVIEWTEXT":"Early Valentine's day celebration. Wonderful service knowledgable waiter.","predicted":1,"actual":0,"pos_prob":0.9601325965,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-11 18:00:00.0","ID":71659065.0,"Restaurant":"Stanford's - Walnut Creek"},{"REVIEWTEXT":"Seven of us went on a Saturday night to have dinner and listen to the duo that was playing. Everything about the evening was fantastic!  We had made reservations two days before, and called to confirm.  The great experience started with the phone call. Mario was friendly and accommodating on the phone, and was just the same when we arrived! Our server, Heath, couldn't have been better!  He was prompt, friendly, helpful, funny, and patient. All of our food was amazing! We ordered many different things, and enjoyed tasting all of it! Probably the top favorite was the crabmeat cheesecake. The drinks we ordered included wine, beer and mixed drinks. They were all superb! The atmosphere was a little loud, but we loved it!  The music contributed to the noise level, but so did the many conversations going on.  It was awesome to experience an \"upscale\" level of food and service in a more casual setting. I would highly recommend! (Maybe not for a quiet romantic evening, but definitely for a fun","predicted":1,"actual":0,"pos_prob":0.9844751313,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-24 17:30:00.0","ID":71030359.0,"Restaurant":"Primeaux Cheese & Vino"},{"REVIEWTEXT":"I have eaten at Andrea's many time and they never disappoint.  Be it pasta, veal, seafood, or whatever - the food is always excellent.  The service is commendable as well.  I will certainly be going back.","predicted":1,"actual":0,"pos_prob":0.9608218995,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-30 19:30:00.0","ID":66684443.0,"Restaurant":"Andrea's"},{"REVIEWTEXT":"We loved everything about this restaurant.  The outdoor table was really nice on a beautiful evening.  The service was informative and attentive and the food was delicious.  Will definitely return!","predicted":1,"actual":0,"pos_prob":0.9975940135,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-13 18:00:00.0","ID":80812208.0,"Restaurant":"Urban Grub"},{"REVIEWTEXT":"Great bar scene. Superb food and wine.  Attentive service. Will be back!","predicted":1,"actual":0,"pos_prob":0.994208517,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-25 19:30:00.0","ID":63275754.0,"Restaurant":"Selanne Steak Tavern"},{"REVIEWTEXT":"Food was excellent and service was great! Our waitress made sure we were happy with our meal and went out of her way to accommodate us. great place and will be back","predicted":1,"actual":0,"pos_prob":0.9930038585,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-31 18:30:00.0","ID":70596231.0,"Restaurant":"The Knight House"},{"REVIEWTEXT":"Happy hour is a great experience....lots of good people watching, small plates..then on to a great dinner on the wonderful patio.","predicted":1,"actual":0,"pos_prob":0.9669553794,"food_rating":2,"overall_rating":3,"dined_date":"2014-12-24 17:00:00.0","ID":69596014.0,"Restaurant":"Tommy Bahama's Restaurant & Bar - Palm Desert"},{"REVIEWTEXT":"For a good lunch conversation, great ambiance and terrific food and service, Brasserie 8 1\/2 is wonderful!","predicted":1,"actual":0,"pos_prob":0.9856027287,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-31 12:00:00.0","ID":66793605.0,"Restaurant":"Brasserie 8 1\/2"},{"REVIEWTEXT":"Our first experience at Poppy was excellent. The service was fantastic. Our waitress explained how the menu worked and checked with us several times to make sure we understood. We thoroughly enjoyed the many tastes and varieties of food in a very relaxed atmosphere. They even brought a birthday candle on my husband's dessert only by my mentioning we were celebrating his birthday when I made the reservation. The only negative was how expensive the house wine was per glass. Two glasses of house wine were more than both of our meals. Otherwise a very enjoyable experience.","predicted":1,"actual":0,"pos_prob":0.9688194585,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-25 19:00:00.0","ID":67905821.0,"Restaurant":"Poppy"},{"REVIEWTEXT":"Cafe Trio is always a great choice - for a special occasion, or just for an evening out. The entrees are wonderful, but so are the salads and starters. That blue cheese and tenderloin appetizer is my favorite.","predicted":1,"actual":0,"pos_prob":0.9744957664,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-12 19:00:00.0","ID":65095303.0,"Restaurant":"Caf? Trio"},{"REVIEWTEXT":"My husband and I went here for a romantic dinner for our 20th anniversary.  Not only did we receive well wishes from the hostess, two managers, and our waitress, but one of the managers even brought two glasses of champagne for us on the house! Absolutely TOP NOTCH service and the food was delicious.  I highly recommend the filet mignon with peppercorn sauce.  For sides, you can't beat the potato gratin and baked potato, the latter of which they dress table side, so you can request as much sour cream, butter, and bacon to suit your own individual tastes.","predicted":1,"actual":0,"pos_prob":0.9793049218,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-30 18:00:00.0","ID":63479208.0,"Restaurant":"Sullivan's Steakhouse - King of Prussia"},{"REVIEWTEXT":"The food and service at Rocky's is always great.","predicted":1,"actual":0,"pos_prob":0.9793221108,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-31 20:00:00.0","ID":70172569.0,"Restaurant":"Rocky's of Northville"},{"REVIEWTEXT":"317 has an excellent chef who does very interesting things with his offerings.  Their wine list is excellent, and a good value as well.  Service is attentive, helpful and knowledgeable. Every visit has been a delight.  Highly recommended.","predicted":1,"actual":0,"pos_prob":0.9991578209,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-06 18:00:00.0","ID":80158566.0,"Restaurant":"317 at Montgomery Street"},{"REVIEWTEXT":"Everything was just a special dining experience.  From the friendly professional greeting to the very attentive wait staff, you were made to believe you deserved this.  Food was excellent!","predicted":1,"actual":0,"pos_prob":0.9808952207,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-20 19:00:00.0","ID":64305709.0,"Restaurant":"Verace: True Italian"},{"REVIEWTEXT":"Great, friendly staff that provided absolutely superior service.","predicted":1,"actual":0,"pos_prob":0.9692212126,"food_rating":1,"overall_rating":3,"dined_date":"2015-01-03 19:30:00.0","ID":70115802.0,"Restaurant":"Midtown Grille"},{"REVIEWTEXT":"We are so lucky to have this restaurant in Columbus.  When you want to have a truly outstanding meal, attention to detail, great taste, every item superb, this is where you want to go. Of course service is excellent, but the food quality is beyond description.  Thanks so much.","predicted":1,"actual":0,"pos_prob":0.9693073998,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-13 17:45:00.0","ID":71761059.0,"Restaurant":"Final Cut Steakhouse - Hollywood Casino Columbus"},{"REVIEWTEXT":"Tried BiBi'z for the first time. Took advantage of the Twilight Dinner and was very pleased with food and service. Will definitely return!","predicted":1,"actual":0,"pos_prob":0.9748875555,"food_rating":2,"overall_rating":2,"dined_date":"2015-01-22 17:00:00.0","ID":70939738.0,"Restaurant":"Bibi'z Restaurant & Lounge"},{"REVIEWTEXT":"The dining experience I recently had was wonderful. Each course was delicious. The mussels had a great spicy kick, offset by the salad. The pho was yummy, seafood perfectly cooked and a broth with a savory mix of spices. The cookie treats were a perfect end to the meal, a mix of different sweet treats, perfect to share. The server was top notch; she was at the ready at perfect times, never overbearing. Also we never were made to feel like a pain in the buns with any extra request (ex: bread, more napkins, etc.). My dining companions each loved their meals, as well. Overall a wonderful evening!","predicted":1,"actual":0,"pos_prob":0.9986039781,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-09 19:00:00.0","ID":67188917.0,"Restaurant":"Blue Ginger"},{"REVIEWTEXT":"First time here after driving by many times. Great food and service. Martini with stuffed olives, Quality appetizers, entr?e and love the banana fosterer desert. Wife and I enjoyed it very much and is now on our \"do again\" list when we are in the area.","predicted":1,"actual":0,"pos_prob":0.9776811313,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-10 19:00:00.0","ID":66013145.0,"Restaurant":"Bascom's Chop House"},{"REVIEWTEXT":"A great restaurant, with very unique food and beer selections. Great house brews and delicious charcuterie boards. A great place to party. We will be back soon.","predicted":1,"actual":0,"pos_prob":0.9987039805,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-17 21:30:00.0","ID":77793750.0,"Restaurant":"Edmund's Oast"},{"REVIEWTEXT":"The entire meal - from soup to nuts- was quite delicious; we had never been to the restaurant, we will be back.","predicted":1,"actual":0,"pos_prob":0.9615878131,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-18 18:00:00.0","ID":66257003.0,"Restaurant":"Skipjack's Boston"},{"REVIEWTEXT":"Our waitress Emily J. was awesome.  The Thanksgiving meal was great.  And I love the wine bottle bags!","predicted":1,"actual":0,"pos_prob":0.9583100929,"food_rating":2,"overall_rating":1,"dined_date":"2014-11-27 16:30:00.0","ID":67982647.0,"Restaurant":"Buca di Beppo - Roseville"},{"REVIEWTEXT":"Nice place, everyone in our group was very comfortable. Overall great environment and kid friendly","predicted":1,"actual":0,"pos_prob":0.9773986336,"food_rating":2,"overall_rating":3,"dined_date":"2014-08-02 19:00:00.0","ID":63611971.0,"Restaurant":"Buca di Beppo - Downtown Indianapolis"},{"REVIEWTEXT":"Atria's is one my favorite restaurants to go to.  Always, wonderful service and great food and moderately priced.  It is our \"go to\" place!","predicted":1,"actual":0,"pos_prob":0.99215242,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-08 18:00:00.0","ID":68389129.0,"Restaurant":"Atria's - Peters Township"},{"REVIEWTEXT":"Great Experience.  Garrett was great. Celebrating a birthday and they certainly took care of that.","predicted":1,"actual":0,"pos_prob":0.9750558241,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-02 18:00:00.0","ID":78236341.0,"Restaurant":"Harry Caray's Italian Steakhouse - Lombard"},{"REVIEWTEXT":"Always fun here. Great times and nice to know everyone.","predicted":1,"actual":0,"pos_prob":0.9881001353,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-04 20:00:00.0","ID":66982971.0,"Restaurant":"Marx Bros Cafe"},{"REVIEWTEXT":"We had a most enjoyable meal complete with champaigne. The food was good and well presented and the service excellent. We were late for our appointment but were treated kindly and seated right away. I was in a wheelchair and everyone was most helpfull.","predicted":1,"actual":0,"pos_prob":0.9612373356,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-07 18:30:00.0","ID":66151655.0,"Restaurant":"Peaks Restaurant"},{"REVIEWTEXT":"We had a delightful Staff Christmas dinner at the Front Porch!  The food, service and ambience were all wonderful - and we look forward to coming back again!","predicted":1,"actual":0,"pos_prob":0.9554740654,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-07 18:45:00.0","ID":68337817.0,"Restaurant":"The Front Porch"},{"REVIEWTEXT":"Excellent food, service, and  build-your-own bloody mary bar with live jazz in the background.  Can't wait to return when I get back to New Orleans.","predicted":1,"actual":0,"pos_prob":0.9811586011,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-22 10:00:00.0","ID":76447153.0,"Restaurant":"Atchafalaya Restaurant"},{"REVIEWTEXT":"We enjoy an evening  for special occasions and anytime we have friends looking for a new dining experience we bring them with us. Great food, great service, great atmosphere.","predicted":1,"actual":0,"pos_prob":0.984325228,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-02 18:30:00.0","ID":63595356.0,"Restaurant":"El Manantial"},{"REVIEWTEXT":"Our steak and lamb chops were delicious!  What an enjoyable dinner.  Plan on coming back.","predicted":1,"actual":0,"pos_prob":0.9535425998,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-23 20:00:00.0","ID":70949672.0,"Restaurant":"Marco Prime Steak & Seafood"},{"REVIEWTEXT":"From the moment we arrived, the dining experience was amazing.  The service was phenomenal with lots of extra touches (like a complimentary appetizer from the chef) and warm homemade biscuits.  The three of us ordered three entrees -- steak, scallops, and vegetarian -- and all three were really excellent.  We mentioned that it was the birthday of one of our party and the chef sent a complimentary dessert with lit candles.  The staff was friendly, knowledgeable, helpful, attentive, dishes were removed quickly but they never hovered.  I love that it is a locally owned and run restaurant and it shows in the personal touches that have been incorporated into the dining experience.  Macon Bistro is wonderful and well worth a visit.","predicted":1,"actual":0,"pos_prob":0.9766006144,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-22 18:30:00.0","ID":64309370.0,"Restaurant":"Macon Bistro & Larder"},{"REVIEWTEXT":"The service and suggestions were incredible.  The chateau Brian's was excellent!!  We had a great anniversary dinner.","predicted":1,"actual":0,"pos_prob":0.9922896981,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-21 17:30:00.0","ID":69557861.0,"Restaurant":"Anthony's Prime Steak & Seafood"},{"REVIEWTEXT":"As always, first class,  wonderful ambiance, food & service and you must start off with the shrimp cocktail!!","predicted":1,"actual":0,"pos_prob":0.9898904947,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-22 18:30:00.0","ID":66106599.0,"Restaurant":"St. Elmo Steak House"},{"REVIEWTEXT":"Great service and very attentive to a special event, birthday.  A number of the staff congratuled me on the birthday.   I enjoyed the special dessert also.","predicted":1,"actual":0,"pos_prob":0.9829196239,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-22 19:00:00.0","ID":67799747.0,"Restaurant":"Stonewood Grill & Tavern - Naples"},{"REVIEWTEXT":"A perfect place for great food and communication where one can hear the conversation.","predicted":1,"actual":0,"pos_prob":0.9939566158,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-02 11:45:00.0","ID":65694332.0,"Restaurant":"Il Palio"},{"REVIEWTEXT":"WE CELEBRATED MY HUSBAND'S 75th B-DAY LUNCH AND IT WAS FABULOUS.  FOOD GREAT; SERVICE WONDERFUL; WE LOVED IT!","predicted":1,"actual":0,"pos_prob":0.9960194514,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-25 12:30:00.0","ID":65558825.0,"Restaurant":"Enzo and Lucia"},{"REVIEWTEXT":"Tao is our special occasion destination.  The food, ambiance, and service is always a wonderful experience.  We love it there!  We appreciate an ever evolving culinary event!","predicted":1,"actual":0,"pos_prob":0.978269899,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-30 18:15:00.0","ID":69887642.0,"Restaurant":"Tao Downtown"},{"REVIEWTEXT":"The City brought to the Suburbs, excellent food and atmosphere.","predicted":1,"actual":0,"pos_prob":0.9753309682,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-22 18:00:00.0","ID":67773577.0,"Restaurant":"El Tapeo"},{"REVIEWTEXT":"Food was deliciously prepared and beautifully presented. Staff was extremely attentive and extraordinarily friendly. Typical southern charm and hospitality. Would highly recommend a visit here.","predicted":1,"actual":0,"pos_prob":0.9844457976,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-09 18:45:00.0","ID":76975293.0,"Restaurant":"The Olde Pink House Restaurant"},{"REVIEWTEXT":"One of our favorite restaurants!  Always great  and consistently good food.","predicted":1,"actual":0,"pos_prob":0.995308557,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-22 19:00:00.0","ID":64302566.0,"Restaurant":"edison: food+drink lab"},{"REVIEWTEXT":"The food was great and the service excellent.  We were there because we had just gotten engaged it is the perfect place for special dinners.  The wine selection is great.","predicted":1,"actual":0,"pos_prob":0.9920246871,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-21 18:30:00.0","ID":70792814.0,"Restaurant":"Eddie V's - San Diego"},{"REVIEWTEXT":"Romantic, comfortable, great food, outstanding service....","predicted":1,"actual":0,"pos_prob":0.9988659281,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-17 18:00:00.0","ID":70811550.0,"Restaurant":"Salt - Ritz-Carlton Amelia Island - Fernandina Beach"},{"REVIEWTEXT":"Ambience was outstanding.and the wine offered was excellent.","predicted":1,"actual":0,"pos_prob":0.9933198242,"food_rating":2,"overall_rating":2,"dined_date":"2015-02-15 17:00:00.0","ID":72154651.0,"Restaurant":"Brenner's Steakhouse on the Bayou"},{"REVIEWTEXT":"Wonderful food, service and the overall experience best I've had in a long time.","predicted":1,"actual":0,"pos_prob":0.9875255697,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-06 17:30:00.0","ID":64884826.0,"Restaurant":"Eddie V's - Scottsdale Quarter"},{"REVIEWTEXT":"We held a business dinner here during a conference. Everyone enjoyed it. The food was excellent as was the service.  If I am ever back in Milwaukee I will definitely return.","predicted":1,"actual":0,"pos_prob":0.9955902536,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-28 18:45:00.0","ID":78115231.0,"Restaurant":"Water Buffalo"},{"REVIEWTEXT":"We celebrated our anniversary and experienced great food and amazing service.","predicted":1,"actual":0,"pos_prob":0.9990231832,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-16 19:45:00.0","ID":70590218.0,"Restaurant":"The Grill on the Alley - Westlake Village"},{"REVIEWTEXT":"We came to South On Main for our 27th anniversary and had a great time.  A quaint table was set up for us and they made my wife feel very special with some nice touches. Service and food was great, Chef Matt has really let his creativity flow. We loved the generous use of locally grown produce. We don't eat a lot of desserts but the Brown Sugar Cakes with a compote of (local) blueberries was amazing. A nice dinner, we'll be back.","predicted":1,"actual":0,"pos_prob":0.9859016171,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-11 19:30:00.0","ID":62749122.0,"Restaurant":"South on Main"},{"REVIEWTEXT":"We chose Parker's on Ponce to celebrate my husband's birthday with friends!  What a FABULOUS choice of restaurants!  The food was absolutely wonderful. (we each had a different dish, and shared a little of each) The ambience was fabulous. The fireplace just made for a fabulous atmosphere.  Service was TOP quality!","predicted":1,"actual":0,"pos_prob":0.9778793331,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-09 19:00:00.0","ID":68655546.0,"Restaurant":"Parker's on Ponce"},{"REVIEWTEXT":"Food was great.....and the staff was very helpful and friendly.","predicted":1,"actual":0,"pos_prob":0.9817104866,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-28 16:45:00.0","ID":63479806.0,"Restaurant":"MAX's Wine Dive Fort Worth - W. 7th St."},{"REVIEWTEXT":"The food was fabulous.  Very authentic Italian with delicious surprises on the menu!","predicted":1,"actual":0,"pos_prob":0.9878700692,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-30 19:30:00.0","ID":63504623.0,"Restaurant":"Canaletto"},{"REVIEWTEXT":"We had the Easter brunch and were very pleased with the variety of food.  The selection was endless...from eggs benedict to a meat carving station of beef and ham to pasta to a desert station that was amazing.  We were very happy with everything each of us tried and this can be difficult to accomplish when it comes to buffet.  Adding to this, our service was wonderful!","predicted":1,"actual":0,"pos_prob":0.9651476477,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-05 11:45:00.0","ID":76824033.0,"Restaurant":"Johnny's Italian Steakhouse - Middleton"},{"REVIEWTEXT":"Kristen and crew made for an amazing 50th birthday dinner.","predicted":1,"actual":0,"pos_prob":0.9542902513,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-22 19:15:00.0","ID":63229405.0,"Restaurant":"Brooks' Bar & Deck at Edgewood Tahoe"},{"REVIEWTEXT":"I vIsited capital grill on the last Saturday night of Restaurant Week.  I came with 6 of my friends very impressed with the menu and wine offerings did not disappoint excellent food excellent service excellent atmosphere!!!  We were seated quickly after arriving.  I would highly recommend!!!!","predicted":1,"actual":0,"pos_prob":0.9871682755,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-31 19:15:00.0","ID":71227753.0,"Restaurant":"The Capital Grille - Hartford"},{"REVIEWTEXT":"Our service was outstanding!! Our server (her name was Rebekah?!) was amazing...she was so friendly and we were there for a special occasion, and went above and beyond for us. I would definitely recommend this restaurant and go back again!","predicted":1,"actual":0,"pos_prob":0.9962361661,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-05 19:15:00.0","ID":62522242.0,"Restaurant":"Rx Restaurant"},{"REVIEWTEXT":"good time on new years eve. Food great and the service was outstanding. Plaza is always a treat.","predicted":1,"actual":0,"pos_prob":0.9818702264,"food_rating":2,"overall_rating":2,"dined_date":"2014-12-31 17:00:00.0","ID":69934510.0,"Restaurant":"Plaza III, The Steakhouse - Kansas City"},{"REVIEWTEXT":"This is my favorite restaurant in the area.  It always serves excellent local food - prepared to perfection.","predicted":1,"actual":0,"pos_prob":0.9987178452,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-14 18:15:00.0","ID":64161845.0,"Restaurant":"The Tailor and the Cook"},{"REVIEWTEXT":"Everything was fantastic and the service impeccable. Everyone in our party of seven was satisfied and well taken care of.","predicted":1,"actual":0,"pos_prob":0.9966947251,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-03 19:00:00.0","ID":70135762.0,"Restaurant":"Ocean Prime - Denver"},{"REVIEWTEXT":"First time and it was a great overall dining experience.","predicted":1,"actual":0,"pos_prob":0.98017377,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-03 17:00:00.0","ID":76786313.0,"Restaurant":"Waterside Restaurant and Catering"},{"REVIEWTEXT":"I took my husband to Samba's, not sure of what to expect,  and was pleasantly surprised.  The restaurant is beautiful,  situated right on the water. The hostess was very nice,  and our server was excellent.  The food was great, as were the entertainers. The overall ambiance was wonderful. My husband had a great time as well.  We will definitely be returning in the future.","predicted":1,"actual":0,"pos_prob":0.9778975931,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-20 19:30:00.0","ID":69464476.0,"Restaurant":"Samba Brazilian Steakhouse - Redondo Beach"},{"REVIEWTEXT":"The food, service, and price were 3 in 1. This place was amazing. The Green fried tomato appetizer was out of this world. The pineapple \/ Mango martini was refreshing. The service was impeccable. My family and I will be to Galena and we will definitely be back to eat. THIS PLACE IS A MUST when attending Galena.","predicted":1,"actual":0,"pos_prob":0.9844577262,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-06 20:00:00.0","ID":64915132.0,"Restaurant":"Fried Green Tomatoes"},{"REVIEWTEXT":"The food is always good in a friendly, relaxed atmosphere.  Highly recommended for casual dining at a reasonable price.Our Server","predicted":1,"actual":0,"pos_prob":0.9906420561,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-22 12:15:00.0","ID":76140948.0,"Restaurant":"Cattle Company Steakhouse - Pearl City"},{"REVIEWTEXT":"Dinner was perfect. Excellent food ,wonderful service.  Will recommend to friends","predicted":1,"actual":0,"pos_prob":0.998471994,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-24 19:30:00.0","ID":79662004.0,"Restaurant":"The Bull Ring"},{"REVIEWTEXT":"We had never been before? it was elegant, authentic, and absolutely delicious; definitely worthy of a special occasion, but accessible enough for any given date night.  We drove from Studio City, and it was worth the trip!","predicted":1,"actual":0,"pos_prob":0.9930723007,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-08 18:45:00.0","ID":67180296.0,"Restaurant":"Bistro de la Gare"},{"REVIEWTEXT":"Delicious food and wonderful environment.  Service was great.","predicted":1,"actual":0,"pos_prob":0.9997717085,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-05 11:30:00.0","ID":80163424.0,"Restaurant":"Terrain Garden Cafe"},{"REVIEWTEXT":"The service was great. The bartender was wonderful  We had a great time","predicted":1,"actual":0,"pos_prob":0.9867005175,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-30 19:15:00.0","ID":79879118.0,"Restaurant":"Saloon Restaurant"},{"REVIEWTEXT":"I hosted two girlfriends for lunch. It was a beautiful day, so we sat outside, which works really well even at a shopping center. Our waiter, Blake was very attentive and helpful with suggestions. We had a cheese and charcuterie platter suggested by the cheese monger and I was very happy with both cheeses and the prosciutto. Our lunch entries were very tasty too. Highly recommend Primeaux!!","predicted":1,"actual":0,"pos_prob":0.9606025515,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-15 12:00:00.0","ID":79145103.0,"Restaurant":"Primeaux Cheese & Vino"},{"REVIEWTEXT":"Paradise Cove is in an excellent location and has a beautiful view. While a little pricey for some people, it has excellent food and is well worth the visit. We go here when in the area and have never been disappointed.","predicted":1,"actual":0,"pos_prob":0.9802624793,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-11 17:00:00.0","ID":68580040.0,"Restaurant":"Paradise Cove Beach Cafe"},{"REVIEWTEXT":"Service and food were outstanding!","predicted":1,"actual":0,"pos_prob":0.9759349075,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-11 18:15:00.0","ID":77031822.0,"Restaurant":"La Taberna del Alabardero"},{"REVIEWTEXT":"Always awesome! The menu choices are excellent, the preparation and presentation are mouthwatering! We have never had a bad experience at Heirloom.","predicted":1,"actual":0,"pos_prob":0.9775915168,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-15 19:15:00.0","ID":67438285.0,"Restaurant":"Heirloom - Midway"},{"REVIEWTEXT":"The food was delicious, lovely presentations, full of surprises.  The service was excellent.","predicted":1,"actual":0,"pos_prob":0.9966349558,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-09 18:00:00.0","ID":76975185.0,"Restaurant":"Marigold Kitchen"},{"REVIEWTEXT":"This was our third time at Posteros.  We have only been impressed and fully thrilled with our dining experiences.  From the greeting at the door, bar, sitting, waitress, food preparation, presentation and taste, ambiance - All are super.  Professional and friendly every step of the way.    We always get there early to have a seat at the bar to have a drink, talk to the bartender (Learn something every time) and watch Jason and his staff do their magic (Great view of the kitchen).  Once seated (always on time and always upstairs)  Waitress is appropriately engaging, friendly and knowledgeable of the menu.  And we always enjoy talking to Jason's family - Stephanie and their kids Paityn and Cole - who are very much a part of the positive experience.   We've had both beef and seafood -all are delicious.  This is our go to upscale location in downtown Hendersonville!","predicted":1,"actual":0,"pos_prob":0.969908728,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-22 19:00:00.0","ID":79645188.0,"Restaurant":"Postero"},{"REVIEWTEXT":"This is definitely one of the best restaurants in Davis.  Being from the bay area, we are used to lots of wonderful restaurants, but The Mustard Seed is one of our top favorites.  Not only do they serve wonderful food, you also get a warm and inviting ambiance, and waiters that make your dining experience a pleasure!  As you wait for your scrumptious meal, you bite into bread served with a goat cheese butter.  One of our favorite meals is the ribeye steak, that is definitely one of the best cooked steaks I've ever had, served with perfectly caramelized onions with mushrooms, a top garlic mashed potatoes and brussel sprouts that are so delicious they almost beat the steak in taste! Don't miss out, make a reservation soon...","predicted":1,"actual":0,"pos_prob":0.9900779212,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-17 18:00:00.0","ID":69364558.0,"Restaurant":"The Mustard Seed"},{"REVIEWTEXT":"We had excellent fish and scallops and the tartar was delicious.  It is not cheap but worth it to us.","predicted":1,"actual":0,"pos_prob":0.977809653,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-24 17:45:00.0","ID":66488472.0,"Restaurant":"Pescara"},{"REVIEWTEXT":"The food was wonderful especially the trout.  The servers were attentive and personable.  We had a grand time.","predicted":1,"actual":0,"pos_prob":0.9623955823,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-02 17:45:00.0","ID":66786829.0,"Restaurant":"The Ivy Inn Restaurant"},{"REVIEWTEXT":"The food was great, good size portions, and the service was outstanding.","predicted":1,"actual":0,"pos_prob":0.9849136798,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-13 18:30:00.0","ID":68619160.0,"Restaurant":"Washington Crossing Inn"},{"REVIEWTEXT":"Bartender Mike is great- his drinks make a stop worthwhile. Mike makes an incredible Old a Fashioned, maybe the best you can find.","predicted":1,"actual":0,"pos_prob":0.9763125785,"food_rating":2,"overall_rating":2,"dined_date":"2015-04-24 18:30:00.0","ID":77820275.0,"Restaurant":"Occidental Grill and Seafood"},{"REVIEWTEXT":"Food and staff were excellent!  Defintiely will be back.","predicted":1,"actual":0,"pos_prob":0.989525561,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-18 17:30:00.0","ID":67676882.0,"Restaurant":"Giada - The Cromwell"},{"REVIEWTEXT":"Food is amazing, been gloing there for the last 8 years.  It always amazes me each and every time.  Every one should try stone crab at least once in there lifetime!  The bone in steaks are top notch!  Enjoy. Our server Joe was wonderful!","predicted":1,"actual":0,"pos_prob":0.9917177921,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-15 20:30:00.0","ID":77625389.0,"Restaurant":"Joe's Seafood, Prime Steak & Stone Crab - Las Vegas"},{"REVIEWTEXT":"Excellent as always.  Sat out in deck area and enjoyed it because it was quieter.  We already have reservations for Lobsterfest.","predicted":1,"actual":0,"pos_prob":0.9841665507,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-26 17:30:00.0","ID":69700975.0,"Restaurant":"Walnut Creek Yacht Club"},{"REVIEWTEXT":"Delicious with the works!  Began with Complimentary authentic crusty Bread with trio pate-- awesome.  Sea Bass with spinach superb.  Daughter ordered Caesar salad with grilled chicken and calamari appetizer. Salad fresh..shaved parmesan, crisp romaine, full of buttery thick and crunchy croutons. Calamari served with fried hot peppers and spicy marinara sauce.  Timely food service, attentive and professional staff.  Very pleasurable dining experience and meals.  We will return..so many tasty menus items to experience!","predicted":1,"actual":0,"pos_prob":0.9723947775,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-09 19:00:00.0","ID":76972999.0,"Restaurant":"Cafe Med Restaurant"},{"REVIEWTEXT":"I am very thankful for the amazing staff. From the amazing host to the phenomenal server (Veronica) the service is absolutely amazing! For the food however...its a steakhouse. You kind of have to love steak but they also offer great seafood dishes. Overall, the service is always great.","predicted":1,"actual":0,"pos_prob":0.991238823,"food_rating":2,"overall_rating":3,"dined_date":"2014-10-20 20:15:00.0","ID":66401223.0,"Restaurant":"The Steakhouse at Circus Circus - Reno"},{"REVIEWTEXT":"Great selections. Excellent food and presentation.","predicted":1,"actual":0,"pos_prob":0.9988318241,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-22 12:30:00.0","ID":66405033.0,"Restaurant":"Mon Ami Gabi - Oakbrook"},{"REVIEWTEXT":"Everything was very nice.  Enjoyed chatting with owner\/chef.  Nice touch.","predicted":1,"actual":0,"pos_prob":0.9696602609,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-24 18:00:00.0","ID":65455871.0,"Restaurant":"Via Vite"},{"REVIEWTEXT":"The food and service were excellent. We had the greatest waiter, he made sure we had everything we needed and just at the right time. The food was great. We were celebrating my husbands birthday and they made sure to bring him a slice of Key Lime Pie which he said was the best he's ever had.","predicted":1,"actual":0,"pos_prob":0.9901712247,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-27 18:00:00.0","ID":76369255.0,"Restaurant":"Fairbanks Steakhouse @ Hollywood Casino - Aurora"},{"REVIEWTEXT":"The food was unbelievable!!!! Very flavorful. Service was also very good. I would definitely recommend this place. Yummy!!","predicted":1,"actual":0,"pos_prob":0.9801547234,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-18 19:15:00.0","ID":65269483.0,"Restaurant":"Valanni"},{"REVIEWTEXT":"Our waitress was great...friendly and very prompt!!","predicted":1,"actual":0,"pos_prob":0.975635709,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-29 13:00:00.0","ID":76473849.0,"Restaurant":"Iron Hill Brewery - North Wales"},{"REVIEWTEXT":"It was a great night to eat outside.  The service was great.","predicted":1,"actual":0,"pos_prob":0.9753448665,"food_rating":2,"overall_rating":3,"dined_date":"2015-03-19 20:30:00.0","ID":76131647.0,"Restaurant":"GG's Bistro"},{"REVIEWTEXT":"Like always. The staff was excellent as was the food. This visit we brought along another couple who loved everything. Our waitress was great.","predicted":1,"actual":0,"pos_prob":0.9925884947,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-01 20:30:00.0","ID":66962929.0,"Restaurant":"Lonesome Dove Western Bistro"},{"REVIEWTEXT":"Me and my wife loved Edge it is going to be our new romantic get away. We had a very good time and the food was excellent!! We asked the waiter to let us have a drink and relax and he was great he did not rush us so we really got relaxed and enjoyed the restaurant and the night! Very good experience! So would recommend to a friend.","predicted":1,"actual":0,"pos_prob":0.9747329536,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-13 18:00:00.0","ID":66126746.0,"Restaurant":"EDGE Restaurant & Bar"},{"REVIEWTEXT":"Good, friendly service and food was very good.  Try the butternut squash soup-outstanding!","predicted":1,"actual":0,"pos_prob":0.9729707056,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-18 13:00:00.0","ID":67793444.0,"Restaurant":"Lark Creek Walnut Creek"},{"REVIEWTEXT":"The food was really really good, Perfect Steaks  cooked just right and side dishes?(go for the Mac and Cheese every time). Special occasion for Christmas Eve, our family tradition. This one was special. Try it, you won't be disappointed. Corey, our server is terrific. 2nd time with him in the last 4 months?  So many reasons to try BSS!  Please leave room for a special desert! Generous and so very tasty! Homemade?its all about big Eddy! Glad we returned?  See you all soon. Loren and Mike","predicted":1,"actual":0,"pos_prob":0.9722705294,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-24 18:45:00.0","ID":69936107.0,"Restaurant":"Bourbon Street Steakhouse & Grill"},{"REVIEWTEXT":"I rarely write reviews, but I highly recommend Fiola Mare. My wife and I celebrated our wedding anniversary there and were treated to a free glass of champagne and dessert sample. The mixed seafood grill was perfectly prepared, the service was engaging and attentive, and the ambience (outdoor seating above the Potomac on a beautiful DC night) was intimate. It all made for a memorable evening.","predicted":1,"actual":0,"pos_prob":0.9741978249,"food_rating":2,"overall_rating":1,"dined_date":"2014-09-29 19:00:00.0","ID":65608937.0,"Restaurant":"Fiola Mare"},{"REVIEWTEXT":"This country-French restaurant was perfect from start to finish. The French onion soup and oysters with \"mignonette\" were wonderful appetizers. Our table of four all selected \"Salmon Roti\" served with fresh corn polenta, turnips, carrots and a whimsical \"corn dog\", a mini corn on the cob battered and fried.  Our server's recommendations for wines were spot-on.  Definitely will return.","predicted":1,"actual":0,"pos_prob":0.9775125666,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-02 18:45:00.0","ID":65803607.0,"Restaurant":"Ang?le Restaurant & Bar"},{"REVIEWTEXT":"Loved the drinks on the porch.  People were soooo friendly.  Food was truly Southern delicious  Can't wait to be able to go again.  Loved our piano player,","predicted":1,"actual":0,"pos_prob":0.9936302007,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-09 19:30:00.0","ID":70385716.0,"Restaurant":"Pittypat's Porch Restaurant"},{"REVIEWTEXT":"The food was great all fresh.   I wished the portion was a little bit bigger. Great ambiance.  I will definitely go back!!","predicted":1,"actual":0,"pos_prob":0.9940488587,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-13 12:45:00.0","ID":66153124.0,"Restaurant":"Town"},{"REVIEWTEXT":"Went for lunch to Poggio, coming from SF. A beautiful drive over the GG Bridge, into Sausalito and forget looking for parking, valet service right in front of the restaurant.  Sat outdoors on a wonderful afternoon.  Great, attentive service from our waiter.  The food was exquisite.  From a simple tomato and mozzarella dish to perfectly prepared salmon, everything was just right.  The pastas are excellent and dessert is worth leaving some room for.","predicted":1,"actual":0,"pos_prob":0.9913393001,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-08 12:15:00.0","ID":64994979.0,"Restaurant":"Poggio"},{"REVIEWTEXT":"It was the second time I have been there and I do think it is wonderful . It was the best salmon I have ever tasted bar none. I love everything about  the restaurant,....food atmosphere and service.Can't wait to come back!","predicted":1,"actual":0,"pos_prob":0.9571049768,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-03 12:00:00.0","ID":80102231.0,"Restaurant":"Seasons 52 - San Diego"},{"REVIEWTEXT":"We dine here a lot. Can't beat the selection of wines. The cassoulet is one of our favorite dishes.","predicted":1,"actual":0,"pos_prob":0.9536373663,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-21 18:30:00.0","ID":67787199.0,"Restaurant":"Bistro La Source"},{"REVIEWTEXT":"Had a great time. Celebrated my husband's 50th birthday and it was our first time there and we really enjoyed it! Will certainly return. Would love to come and enjoy the outdoor patio in the summer.","predicted":1,"actual":0,"pos_prob":0.9749808343,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-09 18:30:00.0","ID":76996880.0,"Restaurant":"Public Kitchen + Bar - MN"},{"REVIEWTEXT":"I am embarrassed to say that I live 10 minutes away and have never been.  We met our friends there who always rave about the food.  Our bar tender Bobby was outstanding.  He had a great deal of knowledge about bot beer and wine, and gave a taster along with his suggestions.  We stayed at the bar to eat, the atmosphere was comfortable so  we didn't the need to move to a table.  We all tried different tings so we could share.  I had pork belly, gumbo & a specialty salad. ALLL great! My pork belly with pepper jelly was sooo delicious & voted top choice by our group. My husband had the black pepper seafood pasta, the amount of seafood and the delidcate sauce made it a favorite.  Our friends had the steak poor-boy and gumbo, and the Brasza(not spelled correct, I'm sure) fish special - unbelievable what a great twist the steak sandwich had.  The fish cooked perfectly with a great rissotto was also very delicious.  I guess what the moral of my story is, This place is a gem tucked into a plac","predicted":1,"actual":0,"pos_prob":0.9546192039,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-06 18:00:00.0","ID":70231679.0,"Restaurant":"Shango Bistro"},{"REVIEWTEXT":"We had an outstanding experience having dinner at the Skyline Club. Everyone was friendly, knowledgeable and helpful. Our waiter, Chad was very cordial and thoughtful. All the server staff went out of their way to see to it that we were well cared for. Our food was delicious, perfectly prepared and nicely presented. Our experience was better than we had even anticipated. Thank you, Skyline Club!","predicted":1,"actual":0,"pos_prob":0.9930115931,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-29 19:00:00.0","ID":78265660.0,"Restaurant":"Skyline Club"},{"REVIEWTEXT":"Celebrating a major birthday at Kincaids in Bloomington has become a tradition and we have had good service for the most part. This time our server, Jennifer, was outstanding. She really took an interest in our party, watched our coffee and water levels and interacted well with the group. The food was excellent as usual with our party ordering a wide variety of meals. We had asked for a quiet, round table in a quiet area and we were happy to see that that request was honored.","predicted":1,"actual":0,"pos_prob":0.9706460204,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-04 12:30:00.0","ID":70179358.0,"Restaurant":"Kincaid's - Bloomington"},{"REVIEWTEXT":"we have been in Myrtle Beach for al for a special occasiohas become our go to place for just a nice night out for a special occasion. very consistent excellent food service and ambience","predicted":1,"actual":0,"pos_prob":0.9510537198,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-10 19:00:00.0","ID":70327920.0,"Restaurant":"Aspen Grille"},{"REVIEWTEXT":"Shannon and chef Guy were great, the meal excellent, Guy's wine recommendation spot on. Overall the experience was excellent plus.  Chef Guy reminded me of Anthony Bourdain - very outgoing, sense of humor, fun to talk with, knowledgeable on food and wine, a real people person. Oh yeah almost forgot - a GREAT cook!!  If you haven't been you must go.","predicted":1,"actual":0,"pos_prob":0.9869252176,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-11 18:30:00.0","ID":68639606.0,"Restaurant":"Ortygia"},{"REVIEWTEXT":"surf light theatre and the Tuckers- a perfect evening - excellent wait staff ( Pete) and very good food- wish we lived closer","predicted":1,"actual":0,"pos_prob":0.9951724224,"food_rating":2,"overall_rating":2,"dined_date":"2014-12-06 17:15:00.0","ID":68280160.0,"Restaurant":"Tuckers Tavern"},{"REVIEWTEXT":"I've been to japan and they have the best wings, yamachan, the spices are perfection and the wings are crispy and juicy.  I would come back here for dessert only.","predicted":1,"actual":0,"pos_prob":0.9685559334,"food_rating":2,"overall_rating":3,"dined_date":"2014-11-11 17:00:00.0","ID":67252631.0,"Restaurant":"TanakaSan"},{"REVIEWTEXT":"Excellent dinner and service. Special was delicious and service was pleasant and efficient.","predicted":1,"actual":0,"pos_prob":0.9943629246,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-24 18:00:00.0","ID":66550355.0,"Restaurant":"Otto's Restaurant and Bar"},{"REVIEWTEXT":"Fabulous dinner and service, as always. The lobster bisque was the best of all time and the Monchong and other fish specialty was also top drawer. Great wine list and 18 year old scotch. Merriman's is our favorite Maui restaurant and has been for years. They never disappoint.","predicted":1,"actual":0,"pos_prob":0.9828573578,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-17 19:45:00.0","ID":77474251.0,"Restaurant":"Merriman's - Kapalua, Maui"},{"REVIEWTEXT":"Excellent Steaks - We think the best in Philadelphia!","predicted":1,"actual":0,"pos_prob":0.9794977878,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-29 18:30:00.0","ID":64560405.0,"Restaurant":"The Prime Rib"},{"REVIEWTEXT":"Our server Eric was wonderful. He was attentive and a true professional.  The food was exceptional tonight. This is the perfect place for our pre-theater dining. The Brussels sprouts were amazing and the sweet potato and parsnip-potato were fabulous. This is a must stop for every theater night","predicted":1,"actual":0,"pos_prob":0.9982215958,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-19 18:00:00.0","ID":75980075.0,"Restaurant":"Rumpus Room"},{"REVIEWTEXT":"with friends and great food and wine plus the best waiter in town.","predicted":1,"actual":0,"pos_prob":0.9973687062,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-23 19:45:00.0","ID":64365002.0,"Restaurant":"Le Fou Frog"},{"REVIEWTEXT":"Food was delicious and I liked being able to combine starter, middle & end courses, because everything sounded so yummy!  Additionally, by having 2 portion sizes, you could opt to just have 1 item for your full meal. Not huge portions, but I did not leave hungry!  Presentation was also outstanding.  My husband had the salmon rolls for a starter and couldn't stop talking about them.  The pastry chef was trying out a new dessert recipe, so we got to have a sample.  It was such a unique combination of flavors including a topper of chai marshmallow fluff!  Hope to see it on the menu when I return.  The staff was very attentive.  I'd also like to mention the subtle design nods to the former Maisonette were really well done.  The 2 story chandelier was outstanding!  We'll definitely be back.","predicted":1,"actual":0,"pos_prob":0.9617187136,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-15 20:00:00.0","ID":70616371.0,"Restaurant":"BOCA"},{"REVIEWTEXT":"Took my extended family out and we had the best time.  Everyone's meal was amazing - both steak and vegetarian dishes alike, and the service was warm and friendly.  Would definitely return!","predicted":1,"actual":0,"pos_prob":0.9938984583,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-14 17:45:00.0","ID":75780663.0,"Restaurant":"Robert's Restaurant"},{"REVIEWTEXT":"This historic downtown restaurant is beautiful.  Truly a French\/European setting.  The Salmon appetizer was delicious and beautiful to see.  The Sole was very nice.  The Chocolate Souffle was wonderful.  The Sommelier was knowledgeable and we had some wonderful wine to compliment the dinner.  Even the table setting had elegant touches like crystal knife rests, crystal flowers to hold the palate cleansing sorbet, and a little silver dome to cover the butter.  The waitstaff were charming and attentive without rushing.  The chef sent us home with a little banana nut cake for breakfast.  Also, before dinner we had an awesome Martini in the lobby bar.  Will definitely return when we are in Dallas.","predicted":1,"actual":0,"pos_prob":0.9722421087,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-15 18:00:00.0","ID":70751952.0,"Restaurant":"The French Room"},{"REVIEWTEXT":"Visit NYC often from North Jersey. First time at Clyde's. Nice, warm and friendly atmosphere. Food was well prepared and tasteful. Will return soon and bring friends who've never been.","predicted":1,"actual":0,"pos_prob":0.9774078145,"food_rating":2,"overall_rating":2,"dined_date":"2015-02-13 14:00:00.0","ID":72444164.0,"Restaurant":"Clyde Frazier's Wine and Dine"},{"REVIEWTEXT":"Excellent food in a great location.  Would definitely come back.","predicted":1,"actual":0,"pos_prob":0.9901723875,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-17 12:00:00.0","ID":75917751.0,"Restaurant":"Wood Tavern"},{"REVIEWTEXT":"Egg plant pie is exceptional.  Our waiter was excellent.  I will want to try the mushroom rissotto on my next visit.  Hope it remains on the menu for awhile.","predicted":1,"actual":0,"pos_prob":0.9597861081,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-23 17:45:00.0","ID":70879813.0,"Restaurant":"Gravy"},{"REVIEWTEXT":"Our group of 12 people gathered there for a post wedding celebration and we had a terrific dinner. Everything went really well with the owner and waiters attentive to us all the time. Perfect starts with appetizers and the wine, then soups and salads, then dinner and finally desserts and coffee. Everyone had a blast and everything was wonderfully delicious! Everyone was raving about their risotto's.  I had the Seared Rare Tuna with Herbed Mushroom Risotto, Wilted Arugula and White Truffle Oil. It was heavenly! We had never been to this restaurant. It was a nice find and we plan to go back.","predicted":1,"actual":0,"pos_prob":0.9856470766,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-23 18:00:00.0","ID":67824444.0,"Restaurant":"Geranio"},{"REVIEWTEXT":"Wonderful service,  great food, exceptional dining experience.  Perfect for a special occasion or to celebrate the holiday season.","predicted":1,"actual":0,"pos_prob":0.9979182482,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-11 12:30:00.0","ID":68567508.0,"Restaurant":"1906 at Longwood Gardens"},{"REVIEWTEXT":"We come every year during our ski trip and have never been disappointed.  Great selection of food and wine and everything tastes great.","predicted":1,"actual":0,"pos_prob":0.9930388209,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-22 18:15:00.0","ID":70885783.0,"Restaurant":"Ristorante Ti Amo"},{"REVIEWTEXT":"never fails to meet expectations.  great food and service.  look forward to returning.","predicted":1,"actual":0,"pos_prob":0.9842820693,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-05 12:30:00.0","ID":77326904.0,"Restaurant":"Nick & Toni's East Hampton"},{"REVIEWTEXT":"I have all special occasions at Winston's.  Everything there is perfect in my opinion.","predicted":1,"actual":0,"pos_prob":0.9726477648,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-02 18:00:00.0","ID":71324602.0,"Restaurant":"Winston's Grille"},{"REVIEWTEXT":"It's been a few years since we visited the The Roycroft for dinner so when we saw they were included in the 2015 Spring Restaurant Week we decided to go. I am so glad we did. The service was first class. Our waitress was attentive, friendly and helpful - not at all intrusive. The food was beyond our expectations - we had the Salmon Fillet and Hanger Steak. Both were perfectly prepared, well presented and delicious. The White Chocolate Raspberry Cheesecake was worth the calories. Even the take home container was a step up from the typical Styrofoam -  looking almost like a gift box. The ambiance itself - stained glass windows, Craftsman furniture - alone was worth the trip. We will definitely not wait so long to return.","predicted":1,"actual":0,"pos_prob":0.9594086346,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-12 17:00:00.0","ID":75729562.0,"Restaurant":"The Roycroft Inn"},{"REVIEWTEXT":"excellent food and service in a convenient location  near Rockefeller Center.  Broiled Lobster is fantastic!  excellent selection and quality of wines by the glass so everyone can choose their favorite grape!","predicted":1,"actual":0,"pos_prob":0.9947956927,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-08 17:30:00.0","ID":65969901.0,"Restaurant":"Oceana"},{"REVIEWTEXT":"We had a party for 7, good quiet table, great service.  Great wine suggestion, great food! Definitely come back next time!","predicted":1,"actual":0,"pos_prob":0.9934246915,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-08 18:00:00.0","ID":70295900.0,"Restaurant":"Canaletto"},{"REVIEWTEXT":"We hosted a birthday party for my daughter and her roommates at Season 52. The food was fantastic and we all liked the seasonal menu. The staff made the event special by taking a photo of the group and giving us four copies in a Seasons 52 sleeve. They also brought out a dessert tower with a candle in the middle. It was nice to be able to sample the dessert options. My daughter and her friends enjoyed the evening.","predicted":1,"actual":0,"pos_prob":0.954985556,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-19 18:30:00.0","ID":67159356.0,"Restaurant":"Seasons 52 - Chestnut Hill"},{"REVIEWTEXT":"We have had a great experience every time at the 1604 location. Been there most times in the dining room but stopped by for happy hour in the bar and the food was great there too and served quite quickly even with the Bar packed. Friendly staff and happy patrons. Will return for sure.","predicted":1,"actual":0,"pos_prob":0.9747245957,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-26 17:45:00.0","ID":63289988.0,"Restaurant":"SILO Elevated Cuisine - 1604"},{"REVIEWTEXT":"This particular Bartolotta's restaurant is our favorite of all.  And they are all excellent in their own right!  But Ristorante Bartolotta is just a gem.  The ambiance reminds us of the little restaurants in Italy that we enjoyed so much.  The food has ALWAYS been excellent, no matter what we order.  And the staff is always friendly and efficient.  We've been dining at this spot for years and have taken clients, family and friends there and have never been disappointed.","predicted":1,"actual":0,"pos_prob":0.9819596543,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-26 19:00:00.0","ID":65506547.0,"Restaurant":"Ristorante Bartolotta - Wauwatosa"},{"REVIEWTEXT":"The restaurant has a San Franciso Bistro feel. We have been here many times and find the food and service always  good.  Wine selections are also good and many by the glass wines are quite reasonable and good. Try the  Chianti.","predicted":1,"actual":0,"pos_prob":0.9620664744,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-26 19:30:00.0","ID":71072616.0,"Restaurant":"Il Fornaio - San Jose"},{"REVIEWTEXT":"We love Zinnas the food is always awesome this visit we took our 15 year old he \"wanted some good food \" he absolutely loved everything from  fried calamari to ligunni carbonara","predicted":1,"actual":0,"pos_prob":0.9874208489,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-11 19:30:00.0","ID":77219561.0,"Restaurant":"Zinna's Bistro"},{"REVIEWTEXT":"A group of friends have been having an annual feast at Buca downtown Minneapolis for many years.  Its great to pass a variety of plates, wine bottles and bread and have a great time.  Service is always attentive and pleasant.  My family also visits several times a year with guests and to celebrate special occasions.  Its always, always fun!","predicted":1,"actual":0,"pos_prob":0.9854050767,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-09 17:30:00.0","ID":68604717.0,"Restaurant":"Buca di Beppo - Minneapolis"},{"REVIEWTEXT":"Very enjoyable evening\/dining experience! Great dishes to share and very helpful staff. Nice Job.","predicted":1,"actual":0,"pos_prob":0.9813890542,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-14 18:30:00.0","ID":72372564.0,"Restaurant":"Limon"},{"REVIEWTEXT":"This wonderful restuarant has been a favorite of ours for almost 40 years.  Located within the shadows of the Castillo de San Marcos, the beautiful old home is a romantic and pleasant venue for a great evening. The prices may seem a bit high at times, but the food will usually be enough to make you glad you came. Pleasant continental quiet dining in a delightful atmosphere. The Boullibaise is to die for and the Grouper is a perrenial favorite. If you like Crepes...nough said. Theirs are excellent.","predicted":1,"actual":0,"pos_prob":0.9736504625,"food_rating":2,"overall_rating":3,"dined_date":"2014-08-23 19:30:00.0","ID":64436346.0,"Restaurant":"Le Pavillon"},{"REVIEWTEXT":"Buddy V's offers great Italian food. I had the Valastro Sunday gravy--which includes meatballs, italian sausage, pork, and lamb all cooked in sauce, plus rigatoni pasta on the side.  Delicious! The lamb and pork were so tender and the meatballs and sausage were fabulous.  My husband had the veal parm-huge veal chop-and it was also delicious.   The dessert menu is a menu\/family photo album-cute concept.  We shared the nutella cake, and it was very good.  The portions are huge-so go with an appetite!  I would definitely eat there again.  Bonus-Carlo's Bake Shop is right across the hallway from the restaurant, and the desserts there are to die for.","predicted":1,"actual":0,"pos_prob":0.9800635444,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-08 17:00:00.0","ID":68425891.0,"Restaurant":"Buddy V's at The Venetian"},{"REVIEWTEXT":"Food was good. Wine was great. Brook was fantastic.","predicted":1,"actual":0,"pos_prob":0.9654669888,"food_rating":2,"overall_rating":3,"dined_date":"2014-11-01 22:15:00.0","ID":66772694.0,"Restaurant":"Scapa Italian Kitchen"},{"REVIEWTEXT":"My first time there.  Met some friends for lunch. Service was awesome. Good was great","predicted":1,"actual":0,"pos_prob":0.980208187,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-07 12:15:00.0","ID":71508139.0,"Restaurant":"Bridges Restaurant - MD"},{"REVIEWTEXT":"Always on mark have never been disappointed food is presented perfectly and the drinks are generous","predicted":1,"actual":0,"pos_prob":0.9759678518,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-14 19:00:00.0","ID":75825193.0,"Restaurant":"Mill Pond House"},{"REVIEWTEXT":"excellent service   thanks,everything from the outside bar to the food was great","predicted":1,"actual":0,"pos_prob":0.9933557693,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-17 17:45:00.0","ID":65235965.0,"Restaurant":"Canoe"},{"REVIEWTEXT":"Can't wait to go back. Our new special occasion restaurant. One of the best meals of my life including Paris and most of Europe AND the French Laundry! Flavors and combinations were so pure and you could taste every flavor:) Loved it, and the service could not have been more attentive and informative and kind:)","predicted":1,"actual":0,"pos_prob":0.9782553716,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-01 19:00:00.0","ID":78206770.0,"Restaurant":"Providence"},{"REVIEWTEXT":"I've been there many times, and have always enjoyed myself. The dinner was good, the desert was fantastic, and the service was very, very good, Always love the salad bar, I'll be back!","predicted":1,"actual":0,"pos_prob":0.9778488396,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-13 17:15:00.0","ID":68691466.0,"Restaurant":"Windjammer Restaurant"},{"REVIEWTEXT":"We had the best experience as we celebrated my husband's birthday.  The wait staff, managers and everyone else were all terrific.  The food was excellent.  Thank you.","predicted":1,"actual":0,"pos_prob":0.9964301624,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-08 18:00:00.0","ID":64945146.0,"Restaurant":"Buca di Beppo - Greendale"},{"REVIEWTEXT":"Hard to share soupy dishes with each other, but we all wanted tastes of everything.  The fried watercress is too delicious!!","predicted":1,"actual":0,"pos_prob":0.9567307058,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-06 17:00:00.0","ID":64908774.0,"Restaurant":"May Kitchen + Bar"},{"REVIEWTEXT":"From the moment my party arrived,  we received great service,  including them holding our reservation, since we had to walk 3 miles due to a marathon being held on the strip and not being able to get a cab. Our waiter answered all of our questions, and the good arrived in a timely manner.  There were constant checks on my party with our every need being met. The food was fabulous. I had the best pork chop ever! Loved this place!","predicted":1,"actual":0,"pos_prob":0.9506951026,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-16 17:00:00.0","ID":67455850.0,"Restaurant":"Delmonico Steakhouse"},{"REVIEWTEXT":"The selection for the Sunday brunch is amazing.  The spread is perfect for any mood you might be in on a Sunday morning. It covers the traditional breakfast menu along with an excellent seafood selection that is very fresh and has all the garnishes needed to accommodate your taste. The service was excellent. They did a great job of keeping the table clean and clear of plates which is very important because we had a party of 4 men that took full advantage of a buffet with this much quality food.","predicted":1,"actual":0,"pos_prob":0.9635897028,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-22 11:00:00.0","ID":76633663.0,"Restaurant":"Shaw's Crab House - Chicago"},{"REVIEWTEXT":"It was our 15th wedding anniversary. We changed it up to have lunch instead of dinner to enjoy the city. Needless to say Nico was outstanding! From the moment we entered.. the bar area it was open, relaxing and inviting to enjoy the oysters before lunch. The oysters!! Simply a must!  Then after enjoying the bar area we went to the restaurant?and start an amazing culinary experience..The beet salad is a must! Then relaxed with a glass of Prosecco...We had the Tuna and Grilled Octopus al Pomodoro?The most amazing Tuna we have ever had?the Octopus?so tender ?we thought it was going to melt in our mouths!!  If this makes you hungry?GOOD!   This was exactly what I wanted for our 15th anniversary?Cannot thank Nico enough for their service (which was incredible) and for a day that my wife will never forget!! We will be back well before our next anniversary!","predicted":1,"actual":0,"pos_prob":0.983030546,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-18 12:30:00.0","ID":69646594.0,"Restaurant":"Nico Osteria"},{"REVIEWTEXT":"We were pleased to return to Orchids to honor an anniversary.  Three servers took outstanding care of us and neither hovered nor hurried.  The scallops and lobster were beyond compare, every course with exceptional flare.  They will specialize sauces and gravies , as well as bread, for those of us with gluten-free needs.  The Hawaiian coconut layer cake was mouth-watering, of course.  There was soft music coming from the House Without a Key lounge along with a Hawaiian dancer.  It was a most supreme evening.  Thank you.","predicted":1,"actual":0,"pos_prob":0.9611143527,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-04 19:00:00.0","ID":75368647.0,"Restaurant":"Orchids at Halekulani"},{"REVIEWTEXT":"We recently enjoyed brunch at Christopher's for my son's birthday.  As usual, the food was wonderful and the service was excellent - we were never rushed nor did we ever need anything.  Everyone enjoyed their meal - especially the house filet and the desserts!  I highly recommend the grand mimosa!  A meal at Christopher's is  great any time - but they make a special event even more special.  For this reason,  Christopher's has become our go to restuarant when we have something to celebrate and we are in the Bryan-College Station area.","predicted":1,"actual":0,"pos_prob":0.9904599944,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-16 12:00:00.0","ID":67437212.0,"Restaurant":"Christopher's World Grille"},{"REVIEWTEXT":"it was a great night out, the entertainment was amazing, the reataurant has great flair with a wonderful walk through garden, the service was great. The only complain I had was the food, Not very tasty for my likings but we still had a great time","predicted":1,"actual":0,"pos_prob":0.9794492758,"food_rating":2,"overall_rating":3,"dined_date":"2014-11-04 19:30:00.0","ID":66991099.0,"Restaurant":"Mai-Kai Restaurant"},{"REVIEWTEXT":"Great Experience.   First time there.  We brought our 10 year old with us for dinner and they were very accommodating.  We would definitely recommend and we will be returning.  Scallops and grits and brisket for entrees, both very good.   Salmon chips and calamari were very good for small plates. Servers were very attentive, knowledgeable and prompt.","predicted":1,"actual":0,"pos_prob":0.9795257208,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-28 18:00:00.0","ID":74342490.0,"Restaurant":"TWO urban licks"},{"REVIEWTEXT":"Celebrated my son's 24th birthday. Chef Hank was excellent and the food was delicious. Had excellent sushi, as well as a large group that all had their food perfectly prepared. Everyone enjoyed themselves.","predicted":1,"actual":0,"pos_prob":0.9997279169,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-07 18:00:00.0","ID":75424083.0,"Restaurant":"Osaka - Lansdale"},{"REVIEWTEXT":"My wife and I went to Gabriel's for our 29th wedding anniversary. We have lived in Albuquerque all of our lives and never really heard about Gabriel's until one of my wife's coworkers mentioned it to her how wonderful it is. We just wanted to get away for the weekend so I got online and found Gabriel's and made a reservation online for Saturday night. The ambiance, the food, and the service are all excellent! This hidden away spot is worthwhile the trip from any place in New Mexico and we highly recommend it to anyone. we are looking forward to the next time to go to Gabriel's for a quick get away.","predicted":1,"actual":0,"pos_prob":0.9540223959,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-06 17:00:00.0","ID":80169609.0,"Restaurant":"Gabriel's - Santa Fe"},{"REVIEWTEXT":"We all had delicious appetizers, salads, entrees and desserts. The service was outstanding. They paid special attention to one in the group who was celebrating her birthday.","predicted":1,"actual":0,"pos_prob":0.9761799949,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-21 17:30:00.0","ID":76080449.0,"Restaurant":"The Capital Grille - Chestnut Hill"},{"REVIEWTEXT":"We haven't been to the Lakeshore Grill since it has been remodeled. It was a great experience and the food was very good and our waiter was awesome. Tim did a wonderful job and added to a very nice experience. Lunch was on a Friday, so it was noisy, but we enjoyed it very much.We enjoyed it so much that we went back for dinner on Saturday.","predicted":1,"actual":0,"pos_prob":0.9775790681,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-05 12:30:00.0","ID":64844944.0,"Restaurant":"Lakeshore Grill-Macy's - Ridgedale Mall"},{"REVIEWTEXT":"Great service and food as always. Great place for special occasions.","predicted":1,"actual":0,"pos_prob":0.9946252061,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-31 17:00:00.0","ID":64634325.0,"Restaurant":"The Gas House"},{"REVIEWTEXT":"Memorable Thanksgiving 4 course dinner --every bite was wonderful.","predicted":1,"actual":0,"pos_prob":0.9525432516,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-27 15:00:00.0","ID":67966186.0,"Restaurant":"ABC Kitchen"},{"REVIEWTEXT":"The celebration on Saturday evening  of two 39th wedding anniversaries was a delight for the four of us. Everything was perfect. Many thanks to Dan for his gesture of kindness to our party. You can be sure we'll be back.","predicted":1,"actual":0,"pos_prob":0.978067038,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-30 18:45:00.0","ID":64609738.0,"Restaurant":"Steel and Rye"},{"REVIEWTEXT":"I loved the food and my waiter was awesome. My only compliant was I had a 39 min wait when I made a reservations.","predicted":1,"actual":0,"pos_prob":0.9648322494,"food_rating":2,"overall_rating":3,"dined_date":"2014-11-08 13:45:00.0","ID":67201155.0,"Restaurant":"Texas de Brazil - Addison"},{"REVIEWTEXT":"Our family of four adults spent another great evening and had another great meal at Maggianos this week.  We always go to celebrate any occasion - birthdays, anniversaries, or just getting together.  We all have our favorite dishes and are never disappointed.  The wine list is great too.  We'll be back again and again.","predicted":1,"actual":0,"pos_prob":0.9921866437,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-17 18:15:00.0","ID":69376167.0,"Restaurant":"Maggiano's - Naperville"},{"REVIEWTEXT":"Dining at Monterey Bay on Mt. Washington is an experience to be enjoyed by everyone.  The entire staff is friendly from the time your enter until you leave.  The food is always above and beyond all expectations.  The wait staff is professional and attentive to the max.   No one should leave without trying one of the Pastry Chef's desserts.  Thank you (Eugene) I think is his name, is the best in town.","predicted":1,"actual":0,"pos_prob":0.9799655228,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-03 18:00:00.0","ID":70118885.0,"Restaurant":"Monterey Bay Fish Grotto - Mt. Washington"},{"REVIEWTEXT":"Celebrated 31st wedding anniversary. The staff treated us with special care and started us off with a glass of complimentary champagne. Superb waitress (Laney)!  Best grilled salmon ever.   We just moved to the area and plan on making this restaurant a regular stop.","predicted":1,"actual":0,"pos_prob":0.9629285829,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-07 19:00:00.0","ID":70286994.0,"Restaurant":"Old Village Post House"},{"REVIEWTEXT":"Excellent food and service.  The menu isdiverse and specials change frequently.","predicted":1,"actual":0,"pos_prob":0.9806898876,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-04 18:45:00.0","ID":65816026.0,"Restaurant":"Patrick's Bakery Cafe"},{"REVIEWTEXT":"Going to Trabocco is always like going home....walking in and being greeted by Guisseppe sets to tone for the entire dining experience....the staff is well trained and wonderful...the food always perfect.....what a wonderful treasure hidden on alameda....","predicted":1,"actual":0,"pos_prob":0.9898426576,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-10 14:00:00.0","ID":65014115.0,"Restaurant":"Trabocco"},{"REVIEWTEXT":"We chose the 5-course tasking menu with wine pairings.  Outstanding service, memorable food preparations, and excellent ambiance.","predicted":1,"actual":0,"pos_prob":0.9694284754,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-19 21:00:00.0","ID":64355446.0,"Restaurant":"Topolobampo"},{"REVIEWTEXT":"Thank you so much for a fabulous evening with my family. We like to celebrate the starting of school with a great night out. Spezia has become our go to spot. We absolutely love the menu. The wine list is perfect! A wonderful place for about any occasion. Our whole family feels comfortable and satisfied every time.  Beautiful!.............................................","predicted":1,"actual":0,"pos_prob":0.997995951,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-09 18:45:00.0","ID":63990350.0,"Restaurant":"Spezia - Steaks, Italian & Seafood"},{"REVIEWTEXT":"Wonderful food, fantastic timely service by Tyler and support staff, view of charleston to die for!","predicted":1,"actual":0,"pos_prob":0.9878472854,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-29 19:30:00.0","ID":66091534.0,"Restaurant":"Fleet Landing Restaurant & Bar"},{"REVIEWTEXT":"We invited friends to dine with us and we so enjoyed the great service and wonderful food.  We felt like we were top priority during the entire evening.  A great time was had by all.","predicted":1,"actual":0,"pos_prob":0.9822420666,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-06 17:30:00.0","ID":68312285.0,"Restaurant":"The Gallery Grille"},{"REVIEWTEXT":"I appreciate how easy it is to make a reservation on Open Table.  I always know what to expect when I visit a Maggiano's restaurant.  Always have a good experience.  Food and service were great.","predicted":1,"actual":0,"pos_prob":0.9673479795,"food_rating":1,"overall_rating":1,"dined_date":"2015-06-05 20:00:00.0","ID":80169952.0,"Restaurant":"Maggiano's - San Antonio"},{"REVIEWTEXT":"My husband I loved the pasta dishes. They also have a great Happy Hour with half price drinks and appetizers from 2:30 to 6. When we come back to Denver we will definitely dine here again.","predicted":1,"actual":0,"pos_prob":0.9546486754,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-03 19:00:00.0","ID":63671827.0,"Restaurant":"Panzano"},{"REVIEWTEXT":"We had a terrific experience at Live Oak!  Everything was outstanding from our food to our waiter!  We can not wait to return!","predicted":1,"actual":0,"pos_prob":0.961521158,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-09 19:45:00.0","ID":66248728.0,"Restaurant":"Live Oak"},{"REVIEWTEXT":"FABULOUS  bananas foster dessert!!   Waiter was th very best ...perfect service without being \"snotty\"!","predicted":1,"actual":0,"pos_prob":0.9810634097,"food_rating":2,"overall_rating":2,"dined_date":"2014-08-26 18:30:00.0","ID":64442958.0,"Restaurant":"Eddie V's - Fort Worth"},{"REVIEWTEXT":"Dahlia's been our favorite for many years. Always a delicious and delightful experience.  Pleased to brag it up and grateful for the privilege.","predicted":1,"actual":0,"pos_prob":0.9843327604,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-05 12:00:00.0","ID":65875332.0,"Restaurant":"Dahlia Lounge"},{"REVIEWTEXT":"This was our 3rd visit to this wonderful restaurant. We have now had lunch, dinner  and brunch, all were excellent. The choices of menu items , the service , the incredible view, the value are all great. It's impossible to beat his combination. We will return as soon as we are in the area again.","predicted":1,"actual":0,"pos_prob":0.9829858888,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-15 18:00:00.0","ID":64064194.0,"Restaurant":"Chateau Morrisette"},{"REVIEWTEXT":"Went to dinner with friends and had one of the best Italian meals ever .  Started off with pear salads, soups, and foi gras - delicious - we all shared.  Then we had a three pasta tasting for our group that ramped up the flavors - oh my. But the best was main course!  Had the very best rib eye ever! Aged for 25 days grilled with a balsamic reduction gently poured on when served - to die for.  Other guests had veal and steelhead trout (WOW) and scallops (WOW again). Wine was paired perfectly. Finished off dinner with Tiramisu - so light and fluffy it melted in ones mouth - unbelievable dinner from start to finish.  This restaurant is relatively new and not on conventioneers radar as of yet - so very very,  good.","predicted":1,"actual":0,"pos_prob":0.980318252,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-27 18:45:00.0","ID":71115740.0,"Restaurant":"Baffo @ EATALY CHICAGO"},{"REVIEWTEXT":"Food, wine list and service. Not often enough does a restaurant have them of these factors. Personally, I value most those restaurants which ?have it all? and find that afterwards I walk away feeling that I had a great ?Experience?. This great ?Experience? doesn?t mean that one area was better than another but that the restaurant had everything working seamlessly together. Congratulations to UleleRestaurant in Tampa where last night we had a fantastic dinner; were able to play with a great wine list and enjoyed fantastic service from the beginning to the end?even with the valet service. Take it from me, this is a place to go...many times. The four of us look forward to going again very soon!","predicted":1,"actual":0,"pos_prob":0.9761331514,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-30 20:15:00.0","ID":65616474.0,"Restaurant":"Ulele"},{"REVIEWTEXT":"Local, easy vibes in that NYC chic that only NYC can do! Fantastic brunch, even the homemade granola with yogurt was notable.  Croque Madame was amazing and banana pancakes simple and delicious. Service was super friendly and attentive to detail (wish I could remember her name!). Easy like Sunday morning!","predicted":1,"actual":0,"pos_prob":0.9944301797,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-12 10:00:00.0","ID":77237739.0,"Restaurant":"The National Bar & Dining Rooms"},{"REVIEWTEXT":"I really love your restaurant the food was delicious the price was reasonable but my only thing is that parking and all the congestion at the shopping mall other than that everything was great","predicted":1,"actual":0,"pos_prob":0.9940754972,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-22 15:00:00.0","ID":73210044.0,"Restaurant":"Hom Wood Fired Grill"},{"REVIEWTEXT":"The atmosphere is super charming and comfortable, I went on a summer evening of August and the weather was great to seat outside. Is a nice place to enjoy with friends or love.","predicted":1,"actual":0,"pos_prob":0.9585049349,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-29 21:30:00.0","ID":63797759.0,"Restaurant":"The Ivy"},{"REVIEWTEXT":"Great service (Nicki). Delicious food. Celebrated my birthday there and want to come back soon.","predicted":1,"actual":0,"pos_prob":0.9873336381,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-31 17:30:00.0","ID":66711699.0,"Restaurant":"Terrace Room at The Harbor Grand"},{"REVIEWTEXT":"As always, our server was courteous, attentive, and the food was delicious, with just the right serving sizes.  We are never disappointed at Seasons 52!","predicted":1,"actual":0,"pos_prob":0.9964734529,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-17 18:30:00.0","ID":69315272.0,"Restaurant":"Seasons 52 - Tampa"},{"REVIEWTEXT":"Great wine, delicious food, a fabulous band, & the gem that is your hostess. She was very positive & accommodating. I thoroughly enjoyed my birthday dinner.","predicted":1,"actual":0,"pos_prob":0.9953138209,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-19 19:15:00.0","ID":65303244.0,"Restaurant":"Buttons Food and Music-Fort Worth"},{"REVIEWTEXT":"Went for my hubby's 55th bday with 12 friends and had a blast, food was great and atmosphere was wonderful!","predicted":1,"actual":0,"pos_prob":0.9561046507,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-20 20:00:00.0","ID":67707963.0,"Restaurant":"Fleming's Steakhouse - Woodland Hills"},{"REVIEWTEXT":"The food was delicious, service excellent.  We will certainly be back?","predicted":1,"actual":0,"pos_prob":0.9988152934,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-19 18:30:00.0","ID":65397206.0,"Restaurant":"Chablis Food + Wine"},{"REVIEWTEXT":"was pleasantly surprised at the delicious food combinations.  service was super friendly, but a little disjointed.  worth the trip!","predicted":1,"actual":0,"pos_prob":0.9758871283,"food_rating":2,"overall_rating":3,"dined_date":"2014-11-01 13:30:00.0","ID":66782199.0,"Restaurant":"solita Tacos & Margaritas - Huntington Beach"},{"REVIEWTEXT":"Fun filed atmosphere! Great food and dancing. Perfect!","predicted":1,"actual":0,"pos_prob":0.998705171,"food_rating":2,"overall_rating":3,"dined_date":"2014-09-20 20:30:00.0","ID":65331185.0,"Restaurant":"Barbakoa"},{"REVIEWTEXT":"I loved that we celebrated our wedding anniversary here and were able to have our beloved dog at our feet. The views are amazing, Mount Rainier at sunset, with mt Adams looking on. The summit house is always a special spot for us. Great staff. I got the feeling everyone working there was truly happy to be at work and serving guests.","predicted":1,"actual":0,"pos_prob":0.9821050106,"food_rating":2,"overall_rating":3,"dined_date":"2014-09-13 16:15:00.0","ID":65094746.0,"Restaurant":"Summit House Restaurant - Seattle"},{"REVIEWTEXT":"From the moment you walk in, GM Joel and Chef Roberto  welcome you and feel at home. The classy ambiance, great service, and fresh food ingredients put this restaurant on top of the Reston restaurant scene. Try the linguine Mare for the fresh seafood mix. The home-baked Faccacia bread is wonderful. Maria the server is very attentive and professional.","predicted":1,"actual":0,"pos_prob":0.9594254679,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-19 18:30:00.0","ID":75997304.0,"Restaurant":"Il Fornaio - Reston"},{"REVIEWTEXT":"This is our 5th visit to the Pullman and we love the food and creative drinks!!!  The wait staff is knowledgeable and timely!!   This last visit we brought my parents for dinner and they loved it!!!   Keep up the good creative work!   Cheers!","predicted":1,"actual":0,"pos_prob":0.9793665981,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-29 19:00:00.0","ID":69970506.0,"Restaurant":"The Pullman"},{"REVIEWTEXT":"Very good food, good service, and quite festive. A great place to go on special occasions or for a romantic evening.","predicted":1,"actual":0,"pos_prob":0.9752872572,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-25 18:00:00.0","ID":63277549.0,"Restaurant":"Flight Restaurant & Wine Bar - Memphis"},{"REVIEWTEXT":"Everything about Nick Ryan's was better than expected since we had made a last minute, late reservation.  However, the food was delicious and timely!  Shane was a very efficient and personable server.  Best lettuce wraps ever!","predicted":1,"actual":0,"pos_prob":0.9633472749,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-27 20:15:00.0","ID":65530228.0,"Restaurant":"Nick Ryan's Saloon"},{"REVIEWTEXT":"Black Olive has been on my list since my daughter was a Hopkins freshman four years ago and I only  wish that I had made it there in year 1 rather than just before her graduation so I could return again and again!  We dined at this lovely restaurant on a beautiful street in Fells Point on Monday night and had a picture perfect experience.  The food was delicious--Grilled Calamari stuffed with the most delicate but flavorful cheese , Grilled Scallops, the loveliest Eggplant Spread I have ever eaten and yummy flash fried zucchini with chesse and tzaziki, acccompanied by a $10 glass of perfectly balanced Greek wine.  The service was attentive but not intrusive and finally there was our wonderful conversation with Mr. Spilladis senior, the restaurant's owner, who made us feel like guests at his home. Black Olive is now on the top of our list for our graduation trip to Baltimore and is a great reason to return to this city which has so impressed us New Yorkers with its amazing range of din","predicted":1,"actual":0,"pos_prob":0.9853286993,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-06 21:15:00.0","ID":76885204.0,"Restaurant":"Black Olive"},{"REVIEWTEXT":"Celebrating my son's graduation from Drake and success with employment. We were promptly seated upon our arrival and asked if in fact this was a special occasion. Our waitress had impeccable timing. Never did we feel rushed and she was extremely responsive to our questions. We created our meal to our own specifications and everything was prepared perfectly! The wine recommendation was outstanding and a great pairing for the event. When our souffl? arrived there was a congratulatory message in chocolate. My past experiences at 801 Chophouse have given me the confidence to make this my go-to place when perfection is desired. Thanks so much and we will see you next time.","predicted":1,"actual":0,"pos_prob":0.980654242,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-11 17:30:00.0","ID":62745133.0,"Restaurant":"801 Chophouse ? Des Moines"},{"REVIEWTEXT":"It was our first time.Service was great, the various types of meats was unique . Didn't care for the sausage or lamb but the chicken, steaks  and turkey were tender and seasoned perfectly .The fresh vegetable medley, especially the kale was excellent. The salad was also fresh and very tasteful. Would definitely go back again!","predicted":1,"actual":0,"pos_prob":0.9578259835,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-12 20:00:00.0","ID":63969496.0,"Restaurant":"Samba Brazilian Steakhouse - The Mirage"},{"REVIEWTEXT":"Arturo's Ristorante is a great find.  Our meal was delicious and presented beautifully.  The wait staff is attentive and friendly.  We will be visiting this wonderful restaurant often.","predicted":1,"actual":0,"pos_prob":0.9994851399,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-23 18:30:00.0","ID":63270731.0,"Restaurant":"Arturo?s Ristorante"},{"REVIEWTEXT":"Their seafood is always very fresh and the staff are cheerful and pleasant. My favorite dish is scallops or halibut with a side of lime cilantro rice! It's also a very kid-friendly place with a great kids' menu. I'd love it if they could have some vegetarian options.","predicted":1,"actual":0,"pos_prob":0.9527556927,"food_rating":2,"overall_rating":3,"dined_date":"2015-01-08 18:00:00.0","ID":70400237.0,"Restaurant":"Yankee Pier Lafayette"},{"REVIEWTEXT":"My husband and I have always enjoyed our meals in this restaurant.  This was his birthday and we were just so pleased with our celebration dinner.  The portions are excellent, well prepared, well presented and just so superb with the wonderful sauces that your chef puts on them.  We've always had great service as well.  Thank you for making my hubby's birthday so special.  We were fortunate to have come on Restaurant Week.  Our crab bisque was out of this world and please, don't ever take the red snapper off of the menu.  That is one of our favorites.","predicted":1,"actual":0,"pos_prob":0.9911545093,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-20 17:30:00.0","ID":72871344.0,"Restaurant":"Alchemy"},{"REVIEWTEXT":"I have been to Vintana many times. I always leave stuffed and happy. The food is consistently excellent. Always a fun, great energy and a reliable place to go for any reason.","predicted":1,"actual":0,"pos_prob":0.9855974742,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-03 19:00:00.0","ID":64746923.0,"Restaurant":"Vintana Wine & Dine"},{"REVIEWTEXT":"It was great as usual. We normally order the same thing, our favorite dinner on a Friday evening, at the table we prefer.  We are always welcomed with gracious hospitality.","predicted":1,"actual":0,"pos_prob":0.9711687377,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-10 17:45:00.0","ID":66065176.0,"Restaurant":"Ruth's Chris Steak House - Portland"},{"REVIEWTEXT":"Great drinks! The antelope sliders, boar sausage and quail entree were delicious. I would recommend as a great spot for a few choice bites, rather than a full meal.","predicted":1,"actual":0,"pos_prob":0.9570871586,"food_rating":2,"overall_rating":3,"dined_date":"2014-11-08 19:30:00.0","ID":67170011.0,"Restaurant":"The Lion's Share"},{"REVIEWTEXT":"We had a fabulous dining experience, great service and food to die for. We will definitely be going back for special occasions.","predicted":1,"actual":0,"pos_prob":0.9985793038,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-21 17:30:00.0","ID":73132273.0,"Restaurant":"Bistro Bella Vita"},{"REVIEWTEXT":"Our waitress , Ashley was wonderful . We had a lovely evening.","predicted":1,"actual":0,"pos_prob":0.9529066941,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-01 18:30:00.0","ID":76636554.0,"Restaurant":"Azu Lucy Ho's"},{"REVIEWTEXT":"Thanks for a great night. Food, music, service and ambiance was wonderful.  Room comfortable. AAA","predicted":1,"actual":0,"pos_prob":0.9683498898,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-13 19:00:00.0","ID":65086931.0,"Restaurant":"Blue Water Grill - Jazz Room"},{"REVIEWTEXT":"We've lived in San Diego for over 20years and tried this restaurant for the first time.  Everything was fabulous.  We had a perfect night.","predicted":1,"actual":0,"pos_prob":0.9771873588,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-28 17:45:00.0","ID":64512931.0,"Restaurant":"Island Prime"},{"REVIEWTEXT":"Moderately price seafood plus.  The paella is always delicious.  The ocean view can't be beat","predicted":1,"actual":0,"pos_prob":0.97289752,"food_rating":1,"overall_rating":2,"dined_date":"2014-08-23 19:00:00.0","ID":64486416.0,"Restaurant":"Sea Watch Restaurant"},{"REVIEWTEXT":"very nice place to dine........love the service ,good very good,music excellent","predicted":1,"actual":0,"pos_prob":0.9880277184,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-30 19:00:00.0","ID":64583278.0,"Restaurant":"Bernie's Lounge and Supper Club"},{"REVIEWTEXT":"Delicious food with unique twists. Fabulous service","predicted":1,"actual":0,"pos_prob":0.9977121234,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-21 19:30:00.0","ID":76069986.0,"Restaurant":"Andrea's"},{"REVIEWTEXT":"Food was excellent. Tony was a great waiter. We  loved the original 12th Ave Grill.Moving to a larger space hasn't detracted from the food or experience.","predicted":1,"actual":0,"pos_prob":0.9674212662,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-21 17:30:00.0","ID":67735341.0,"Restaurant":"12th Ave. Grill"},{"REVIEWTEXT":"The crab cake was outstanding. And, the service was impeccable.","predicted":1,"actual":0,"pos_prob":0.9689773095,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-15 18:00:00.0","ID":65166700.0,"Restaurant":"David's Restaurant & Lounge"},{"REVIEWTEXT":"Daniels is a great place to dine, drink wine and celebrate a special event.  The view is wonderful.    The food is out of this world and they have great outdoor dinning.  Being able to watch the sea planes land is an extra bonus.","predicted":1,"actual":0,"pos_prob":0.9681340602,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-01 19:30:00.0","ID":65663860.0,"Restaurant":"Daniel's Broiler - Lake Union"},{"REVIEWTEXT":"Nick and Nino's is by far the best elegant dining venue in Springfield, Illinois. They do it all right!  The cuisine, view, service, etc. are simply fantastic.   Dr. Les and Cathy Hohenstein","predicted":1,"actual":0,"pos_prob":0.9599360552,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-18 18:15:00.0","ID":66265803.0,"Restaurant":"Nick and Nino's Penthouse Steakhouse-Hilton Springfield"},{"REVIEWTEXT":"Enjoyed the entire visit....the food was great, the service was outstanding (the waitress was attentive but not interruptive).  We were able to visit.  It was an enjoyable day.","predicted":1,"actual":0,"pos_prob":0.9754627675,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-17 13:00:00.0","ID":75919647.0,"Restaurant":"Eddie Merlot's - Burr Ridge"},{"REVIEWTEXT":"I recently celebrated my brothers 49th birthday dinner with family and friends. The Happy hour was awesome specials from 4:00 to 6:30 each day. The food was great alttle pricey but worth it. Our server was very good at explaining the entrees etc. the music was wonderful not loud, great to dance too. I would recommend Johnny's greatly. The fish was EXCELLENT!","predicted":1,"actual":0,"pos_prob":0.982954387,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-21 18:45:00.0","ID":73141531.0,"Restaurant":"Johnny's Cafe"},{"REVIEWTEXT":"Service was great, food was good, always enjoyable.","predicted":1,"actual":0,"pos_prob":0.9915917005,"food_rating":2,"overall_rating":3,"dined_date":"2015-03-16 18:30:00.0","ID":75929114.0,"Restaurant":"Charley's Steak House - Tampa"},{"REVIEWTEXT":"Our server was fantastic, he was attentive, professional and top notch!","predicted":1,"actual":0,"pos_prob":0.9978915099,"food_rating":2,"overall_rating":3,"dined_date":"2015-03-06 20:30:00.0","ID":75425198.0,"Restaurant":"Parc"},{"REVIEWTEXT":"I grew up in Chicago and would go to Carsons a couple times a year - usually when out of town guests came to visit. Everything was just as I remembered - the ribs tender and delicious, the corn bread cooked just right and still warm and the beer cold. We arrived about 15 minutes late for our reservation due to weather, but our table was ready. Thank you for the delicious food and great evening","predicted":1,"actual":0,"pos_prob":0.9722670871,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-12 19:00:00.0","ID":65054967.0,"Restaurant":"Carson's Prime Steaks & Famous Barbecue - Chicago"},{"REVIEWTEXT":"Great food and very profession staff.   It is quite loud.","predicted":1,"actual":0,"pos_prob":0.9764933938,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-11 19:00:00.0","ID":75614541.0,"Restaurant":"AMORE Ristorante"},{"REVIEWTEXT":"I have been to Wildfire many, many times; the food and service have always been fantastic!  I always make a reservation and they always honor the time give or take 5 minutes.  I will keep coming back!","predicted":1,"actual":0,"pos_prob":0.9512900369,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-16 18:30:00.0","ID":65203841.0,"Restaurant":"Wildfire - Lincolnshire"},{"REVIEWTEXT":"Food, service and ambience all great.  Highly recommend.","predicted":1,"actual":0,"pos_prob":0.9939362701,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-04 18:00:00.0","ID":71398849.0,"Restaurant":"A&B Lobster House"},{"REVIEWTEXT":"There food and staff are excellent. They do it righ you feel like a king when you leave with a full stomach.  There appetizers are excellent French onion soup is lushes prime rib fanatic sides are supper.  Deserts are fabulous and top off a great meal .","predicted":1,"actual":0,"pos_prob":0.9814189305,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-26 21:00:00.0","ID":65608120.0,"Restaurant":"Weber's Restaurant"},{"REVIEWTEXT":"We drove in from DC and totally enjoyed the service and food. Ate outside and the weather and view was fantastic.","predicted":1,"actual":0,"pos_prob":0.9532875434,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-03 17:30:00.0","ID":65868240.0,"Restaurant":"The Lazy Goat"},{"REVIEWTEXT":"Four of us ate dinner here during Restaurant Week, having the prix fixe menu.  Everyone enjoyed their choices. The food was fresh, very well presented and very tasty.  The service was commendable and we enjoyed eating outside on the large patio which was set back from the street traffic.","predicted":1,"actual":0,"pos_prob":0.950099745,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-03 17:00:00.0","ID":63956135.0,"Restaurant":"La Masseria"},{"REVIEWTEXT":"The grilled octopus appetizer is amazing....have never had a bad dish here","predicted":1,"actual":0,"pos_prob":0.9658522402,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-19 18:00:00.0","ID":69460113.0,"Restaurant":"Estia - Philadelphia"},{"REVIEWTEXT":"I enjoyed lasagne was wonderful. Nice outside patio. I will be back b","predicted":1,"actual":0,"pos_prob":0.9840164733,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-07 18:00:00.0","ID":62653260.0,"Restaurant":"Cafe Roma"},{"REVIEWTEXT":"It was the right combination of setting, food and service! Loved our evening!","predicted":1,"actual":0,"pos_prob":0.961994337,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-30 19:15:00.0","ID":64567581.0,"Restaurant":"Paladar Latin Kitchen & Rum Bar"},{"REVIEWTEXT":"We have been enjoying the Steak House Rest.  for 19 years i.e., every time we are in Las Vegas. GREAT food that is \"perfectly\" prepared with a wonderful romantic atmosphere.  The restaurant also offers a great place to conduct a business dinner.  We always feel we are in an Up- Town New York establishment that is not stuffy, to big nor noisy.  The wait staff is friendly, extremely professional offering good menu suggestions.   The bar area is also in step with its own \"neat\" atmosphere  and service.   Cheers to the owner\/s & team at The Steak House Rest.  We shall always return.","predicted":1,"actual":0,"pos_prob":0.9843312012,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-02 16:30:00.0","ID":76705646.0,"Restaurant":"THE Steakhouse at Circus Circus - Las Vegas"},{"REVIEWTEXT":"We were celebrating our 50th wedding anniversary and were treated to several different touches which made it a very special evening.   The food was delicious, the card was lovely and the serenade by the guitarist was beautiful!!   Thank you very much for making our anniversary so memorable.","predicted":1,"actual":0,"pos_prob":0.9624823412,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-17 17:00:00.0","ID":66245678.0,"Restaurant":"King's Arm Tavern"},{"REVIEWTEXT":"We celebrated or 45 wedding anniversary at Hugo's Frog Bar and it was wonderful.  We had our own private booth, the wait staff was amazing as was the food.  We would absolutely go back to try some of their other entrees.  Loved it!","predicted":1,"actual":0,"pos_prob":0.9764717431,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-04 18:30:00.0","ID":65798102.0,"Restaurant":"Hugo's Frog Bar & Fish House - Naperville"},{"REVIEWTEXT":"The food was great, the atmosphere was quiet and relaxed, the service was excellent.","predicted":1,"actual":0,"pos_prob":0.9775414761,"food_rating":2,"overall_rating":1,"dined_date":"2015-04-22 18:30:00.0","ID":77818983.0,"Restaurant":"Mourayo"},{"REVIEWTEXT":"Took my mom for her birthday. Had a great meal with great service plus they offered her a complimentary dessert!","predicted":1,"actual":0,"pos_prob":0.9710941824,"food_rating":2,"overall_rating":1,"dined_date":"2014-09-23 18:30:00.0","ID":65427713.0,"Restaurant":"Stone Creek - West Chester"},{"REVIEWTEXT":"We enjoyed an outstanding meal (4 different entrees and extras)  all were outstanding and enjoyed by out of country friends.  Service was dignified, knowledgeable and efficient.   An outstanding dinner and a credit to Missoula.  Wine was enjoyed and well served.","predicted":1,"actual":0,"pos_prob":0.99034088,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-27 18:30:00.0","ID":64484423.0,"Restaurant":"Red Bird - Montana"},{"REVIEWTEXT":"We celebrated our 40th on August 17.  Giada's was a wonderful place to celebrate. Service was the best...a View of the Fountains...Food was awesome.  We will certainly return next year on our Vegas vacation.","predicted":1,"actual":0,"pos_prob":0.9563158151,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-17 13:45:00.0","ID":64187970.0,"Restaurant":"Giada - The Cromwell"},{"REVIEWTEXT":"We went to Borough for my husband's birthday. I picked this restaurant because they are known for their Manhattan and that's his favorite cocktail. He loved it! The food was great. I requested a table in a relatively quiet area, and we got it. Definitely a great experience","predicted":1,"actual":0,"pos_prob":0.9825784427,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-20 18:00:00.0","ID":67684193.0,"Restaurant":"Borough"},{"REVIEWTEXT":"I love the food it is delicious & so nicely prepared & presented great selections, nice size portions, also variety of sm, med, or large plates. Wait staff are knowledgeable. Deserts are fabulous - yummy","predicted":1,"actual":0,"pos_prob":0.9984794841,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-05 18:30:00.0","ID":62556198.0,"Restaurant":"Andina"},{"REVIEWTEXT":"Second time here, food was great, wine selections are excellent and all in all a reasonably priced menu. Very friendly and accommodating service.","predicted":1,"actual":0,"pos_prob":0.9955457282,"food_rating":2,"overall_rating":3,"dined_date":"2014-07-23 20:30:00.0","ID":63207719.0,"Restaurant":"Crave Fishbar"},{"REVIEWTEXT":"We have never had a bad meal here.  We always enjoy it.","predicted":1,"actual":0,"pos_prob":0.9600853035,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-14 17:45:00.0","ID":66161535.0,"Restaurant":"Sapori Ristorante - Newport Beach"},{"REVIEWTEXT":"It was fantastic.  We loved the entire experience.  The crab, the salad and sides were all excellent!","predicted":1,"actual":0,"pos_prob":0.9932455489,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-09 17:00:00.0","ID":72382515.0,"Restaurant":"Truluck's Seafood, Steak and Crab House - Austin Downtown"},{"REVIEWTEXT":"This is a very neat restaurant in Savannah -full of history.  The staff is top notch!!  Our only complaint is that the food could be a little fresher","predicted":1,"actual":0,"pos_prob":0.9710487475,"food_rating":2,"overall_rating":3,"dined_date":"2015-05-11 17:45:00.0","ID":78828766.0,"Restaurant":"The Olde Pink House Restaurant"},{"REVIEWTEXT":"Ceres street, where this restaurant is located, has no street parking and no close by parking garage so the first pleasant surprise was the valet parking.  The ambiance is very pleasant and the rooms are quiet so conversation is pleasant.  The food was outstanding.  two of us had the seafod and puff pastry.  The seafood was cooked perfectly and included a small lobster tail, shrimp and scallops and the sauce was outstanding.  Our waitress was also very good.  All in all, an excellent evening and meal.","predicted":1,"actual":0,"pos_prob":0.9591897111,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-10 18:30:00.0","ID":66019213.0,"Restaurant":"The Oar House"},{"REVIEWTEXT":"We had attended the theater before, but had never enjoyed the dining room. In all phases it was a super delightful experience -- reserving a table, the service, the food, the atmosphere -- everything was \"top notch.\" When we go back to the theater we will make sure to include the dining room on our agenda.","predicted":1,"actual":0,"pos_prob":0.96155544,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-08 19:00:00.0","ID":63912080.0,"Restaurant":"Hanover Tavern Restaurant & Pub"},{"REVIEWTEXT":"Great evening! Food, service, ambiance wonderful! My favorite place. Only downside was that for 3 sea scallops the market price was $39. Ouch! But they were delicious.","predicted":1,"actual":0,"pos_prob":0.9829611472,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-05 18:30:00.0","ID":63865311.0,"Restaurant":"Bin on the Lake"},{"REVIEWTEXT":"I love this restaurant. The food is delicious, the atmosphere and ambiance is lovely, and the Tilapia is to die for!","predicted":1,"actual":0,"pos_prob":0.988935712,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-01 19:00:00.0","ID":71275916.0,"Restaurant":"Friday Saturday Sunday"},{"REVIEWTEXT":"We love the fixed price Sunday evening menu.  Our group of 5 women arrived early and had a wonderful waitperson.  The food was fabulous and we had a nice table for 5.  It's a great place for a relaxed Sunday night get together.","predicted":1,"actual":0,"pos_prob":0.9885905852,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-25 17:30:00.0","ID":70976249.0,"Restaurant":"801 Chophouse ? Des Moines"},{"REVIEWTEXT":"I have dined at Firebox only three times over the last three years.  Each time it has been an extremely excellent experience.  I need to remember to go here more often!  This last visit, the food was particularly delicious with a very nice presentation.  We shared the cheese plate and mushroom app, both excellent.  My friend had the duck and said it was perfectly cooked, I had the braised short ribs-outstanding.  Our server was knowledgeable and attentive and pleasant.  Hostess was welcoming, and pleasantly thanked us on the way out.  Firebox is going to be my dining spot anytime I'm heading downtown for a show or event from now on.","predicted":1,"actual":0,"pos_prob":0.9795553122,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-05 17:30:00.0","ID":68247241.0,"Restaurant":"Firebox Restaurant"},{"REVIEWTEXT":"In Spite of the foggy , chilly weather we still had a great dining experience on the patio with the heaters keeping us comfortable. Love the diverse menu we all had something different and we are never disappointed. Our out of towers from Colorado didnt care about the fog and were happy to eat outside and have some wonderful seafood!","predicted":1,"actual":0,"pos_prob":0.9579586297,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-25 18:30:00.0","ID":74048221.0,"Restaurant":"Guppy's"},{"REVIEWTEXT":"We took my son here for his graduation and it was fantastic. The food, the employees and the table was fantastic.  They even took a picture of all of us at the table so that my so could keep it for a great memory. I would suggest this to anyone as the Filet just melts in your mouth. The sauces are great too. Just remember that if you have a large party they add on the tip to your bill as I left ours a fantastic tip and got home and realized they added it on too so They really had a fantastic tip from our table To top off our meal we had ice cream and all ad all it was a fun fantastic day. Be sure to reserve your table before you go as they fill up fast and each meal takes about an 1 1\/2 to 2 hours to enjoy everything that they have to offer. Our cook made a heart out of rice and a sponge bob out of the eggs. If you Have kids they also have smaller portions for them too Remember Benihanas for your fantastic get togethers next time you want a great meal a want to have fun with a bunch o","predicted":1,"actual":0,"pos_prob":0.9865975694,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-28 11:30:00.0","ID":74194528.0,"Restaurant":"Benihana - Puente Hills"},{"REVIEWTEXT":"I took my whole family there for dinner the other night to celebrate my daughters birthday.  We had a terrific meal and our waiter was one of the best I have seen in a long time.  They also brought us a free scoop of ice cream and cake to celebrate her big day.  Everyone had a great time.","predicted":1,"actual":0,"pos_prob":0.9831183752,"food_rating":2,"overall_rating":1,"dined_date":"2014-08-10 19:00:00.0","ID":63949274.0,"Restaurant":"Black Angus Steakhouse - Northridge"},{"REVIEWTEXT":"Seasons always offers an excellent meal.   It is the only restaurant in Davis I would give an \"excellent\" rating for meeting one's expectations on multiple levels.","predicted":1,"actual":0,"pos_prob":0.9755605391,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-23 18:30:00.0","ID":65429656.0,"Restaurant":"Seasons - Davis"},{"REVIEWTEXT":"I continue to go to Big Bowl because of it's consistency.  You can always depend on getting great food, excellent service.","predicted":1,"actual":0,"pos_prob":0.983855226,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-10 17:45:00.0","ID":66022493.0,"Restaurant":"Big Bowl - Edina"},{"REVIEWTEXT":"Food was excellent, Fernando our waiter did a great job and we felt lucky to see Christopher Cross perform, it was a special night","predicted":1,"actual":0,"pos_prob":0.9609448076,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-24 20:15:00.0","ID":70958931.0,"Restaurant":"Spaghettini & the Dave Koz Lounge"},{"REVIEWTEXT":"Superb food, service, decor Comfortable & welcoming","predicted":1,"actual":0,"pos_prob":0.9716392131,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-05 18:30:00.0","ID":63729959.0,"Restaurant":"Bouche Bistro"},{"REVIEWTEXT":"We enjoy going for dinner so much on Saturday's nights that we are \"regulars.\" Their chili is excellent as well as the salmon and meat dishes. It is a casual, friendly environment in which many locals as well as out of owners feel comfortable and know that they will enjoy their experience. The outdoor bar area is very inviting and romantic. I highly recommend it. Management as well as service is superb!","predicted":1,"actual":0,"pos_prob":0.9842737634,"food_rating":2,"overall_rating":2,"dined_date":"2015-01-31 18:30:00.0","ID":71242960.0,"Restaurant":"Blue Adobe Grille"},{"REVIEWTEXT":"The food was outstanding and the ambiance great.  We always enjoyed eating at the other location, but feel this is even nicer.  Look forward to a return visit for dinner.","predicted":1,"actual":0,"pos_prob":0.9589055418,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-26 18:15:00.0","ID":63297177.0,"Restaurant":"Le Yaca"},{"REVIEWTEXT":"Typically a wonderful dining experience all around.","predicted":1,"actual":0,"pos_prob":0.9829435112,"food_rating":2,"overall_rating":3,"dined_date":"2014-10-27 18:00:00.0","ID":66621794.0,"Restaurant":"Ivar's Salmon House"},{"REVIEWTEXT":"We went to Minetta Tavern for the 1st time a couple of weeks ago.  There were 5 in our group and we were seated very comfortably in the back of the room.  We had plenty of space and never felt crowded or rushed. Our server (regrettably I don't remember his name) was friendly, helpful, funny and attentive. My husband had a lamb special that was incredible and my son and I shared the Cote de Boeuf for two-probably the best steak I've ever had. We will definitely be going back.","predicted":1,"actual":0,"pos_prob":0.9751941156,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-17 17:30:00.0","ID":71053799.0,"Restaurant":"Minetta Tavern"},{"REVIEWTEXT":"Roosters consistently nails it with great food and wine coupled with excellent service.","predicted":1,"actual":0,"pos_prob":0.9968392655,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-17 20:00:00.0","ID":70603644.0,"Restaurant":"Rooster's Wood-Fired Kitchen - South Park"},{"REVIEWTEXT":"I have been to Current several times at this point and every dish has exceeded my expectations.  The seafood is always cooked perfectly and the presentation is always great!  The Oysters and the sauces that come with them are different and delicious as well.  It is my goal to try everything on their menu!  Love the ambiance - great space, lighting and feel!  Always great service and the Servers are very knowledgeable about each dish!","predicted":1,"actual":0,"pos_prob":0.9978643537,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-30 19:15:00.0","ID":76562540.0,"Restaurant":"Current"},{"REVIEWTEXT":"great food great service not too loud, great when you want to  talk to your friends.","predicted":1,"actual":0,"pos_prob":0.9714320445,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-12 18:45:00.0","ID":67318548.0,"Restaurant":"Coco Pazzo"},{"REVIEWTEXT":"The food is fantastic, the ambience is awesome and the service is superb. Kudos to Jordan, the GM who spoke to us about a 5 minute wait, which we did not mind, he and his team are all on it!","predicted":1,"actual":0,"pos_prob":0.9716277534,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-30 20:00:00.0","ID":63452122.0,"Restaurant":"Fork"},{"REVIEWTEXT":"It was our wedding anniversary. The food and service were great. Best restaurant in the neighborhood.","predicted":1,"actual":0,"pos_prob":0.9635072731,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-21 18:30:00.0","ID":72871317.0,"Restaurant":"Camino"},{"REVIEWTEXT":"My husband and I try to go to a different restaurant every year on our anniversary.  The location was right in our backyard.  The food was excellent and the waitress was very helpful while we were indecisive with our selections.  We will definitely put M & S on the list to visit again!","predicted":1,"actual":0,"pos_prob":0.9735023592,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-05 19:15:00.0","ID":75624004.0,"Restaurant":"McCormick & Schmick's Seafood - Austin (Century Oaks)"},{"REVIEWTEXT":"We dined at the Painted Pony last Friday with our neighbors. Eventhough we both had experienced the Pony before it was delightful and refreshing to visit again. The food was great and our waiter Brice was exceptional. Brice was very professional, attentive, and not pushy. The Pony offers standard menu items which are great, but the salad and main course specials were creative and tasty as well.  Thanks for the great dining experience and we'll see you again.","predicted":1,"actual":0,"pos_prob":0.9576103329,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-29 18:30:00.0","ID":64543975.0,"Restaurant":"Painted Pony"},{"REVIEWTEXT":"All busy and excellent for business lunch.  Service is always slow and when you are on a business lunch, I am always looking at my watch!  Food is good and perfect for the steak loving customers!","predicted":1,"actual":0,"pos_prob":0.9651060128,"food_rating":2,"overall_rating":3,"dined_date":"2014-06-26 11:45:00.0","ID":62070723.0,"Restaurant":"The Stockyards Restaurant & 1889 Saloon"},{"REVIEWTEXT":"the food was wonderful and the server andrew was excellent.","predicted":1,"actual":0,"pos_prob":0.9816818622,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-01 11:30:00.0","ID":65654579.0,"Restaurant":"Big Bowl - Minnetonka"},{"REVIEWTEXT":"Impeccable service (thank you to our fantastic server - Ivan) and delectable food and beverage\/wine list. We selected dining at the Revolution based on proximity to DPAC and positive remarks from family and coworkers. Great option to celebrate a special occasion -- definitely pricey, but worth every penny!","predicted":1,"actual":0,"pos_prob":0.9959900674,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-02 17:45:00.0","ID":68170376.0,"Restaurant":"Revolution - Durham"},{"REVIEWTEXT":"I always enjoy Gilberts dining and their bar is outstanding with their bartender Sam","predicted":1,"actual":0,"pos_prob":0.9754032511,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-11 17:30:00.0","ID":65053791.0,"Restaurant":"J. Gilbert?s ? Wood Fired Steaks & Seafood ? Glastonbury"},{"REVIEWTEXT":"Love the all you can eat\/all you can drink aspect! Great way to spend a sunday with friends :)","predicted":1,"actual":0,"pos_prob":0.9584932793,"food_rating":2,"overall_rating":2,"dined_date":"2015-01-25 12:00:00.0","ID":71002200.0,"Restaurant":"Zengo"},{"REVIEWTEXT":"Reliable, dependable and delicious! Love the flat breads, burgers and sticky toffee pudding!","predicted":1,"actual":0,"pos_prob":0.9762622782,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-13 12:00:00.0","ID":66136001.0,"Restaurant":"Westside Tavern"},{"REVIEWTEXT":"Service was excellent, and the bar drinks innovative.","predicted":1,"actual":0,"pos_prob":0.9782027785,"food_rating":2,"overall_rating":3,"dined_date":"2015-05-01 18:45:00.0","ID":78201603.0,"Restaurant":"Kingfish - New Orleans"},{"REVIEWTEXT":"The menu is quite diverse and appetizing. In our party of nine, everyone enjoyed their entrees. I am very fussy, but everything delivered (food, service, and beers) was outstanding.","predicted":1,"actual":0,"pos_prob":0.9558717416,"food_rating":1,"overall_rating":2,"dined_date":"2014-08-17 18:00:00.0","ID":64123225.0,"Restaurant":"Iron Hill Brewery - North Wales"},{"REVIEWTEXT":"You can always count on great food and great service.  Love the management team as well.","predicted":1,"actual":0,"pos_prob":0.9987760612,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-17 20:30:00.0","ID":77421770.0,"Restaurant":"Mystic Fish"},{"REVIEWTEXT":"This was our first time and had so much fun.  As crowded as it was, we were seated immediately, and we had no trouble talking. The short rib risotto was amazing.  The sampler app was perfect for four.  Can't wait to go back.","predicted":1,"actual":0,"pos_prob":0.9845715741,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-10 18:45:00.0","ID":70372215.0,"Restaurant":"Cooper's Hawk Winery & Restaurant - Richmond"},{"REVIEWTEXT":"The beer choices including the IPA flight were great, food was both unique and delicious, and our server was very knowledgeable and attentive.  Will DEFINITELY go back again (and again!)","predicted":1,"actual":0,"pos_prob":0.9989064586,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-03 18:30:00.0","ID":65795326.0,"Restaurant":"Craftsmen Kitchen and Tap House"},{"REVIEWTEXT":"Didn't love my Penne Piccantine but my friend's Salmone Scaloppato (salmon and spinach) looked amazing.  My Insalata Delizie was excellent. Super cute restaurant, will definitely try again.","predicted":1,"actual":0,"pos_prob":0.9505454645,"food_rating":2,"overall_rating":3,"dined_date":"2014-08-18 18:00:00.0","ID":64151165.0,"Restaurant":"Delizie"},{"REVIEWTEXT":"Ivar's delivers good food for a reasonable price. We particularly love it for entertaining out-of-town guests. White clam chowder is the best!","predicted":1,"actual":0,"pos_prob":0.9517399212,"food_rating":1,"overall_rating":1,"dined_date":"2015-03-04 18:00:00.0","ID":75232031.0,"Restaurant":"Ivar's Salmon House"},{"REVIEWTEXT":"I had lunch with friends at Palazzo recently. The food was excellent and service very professional.","predicted":1,"actual":0,"pos_prob":0.9596542263,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-16 12:30:00.0","ID":72483907.0,"Restaurant":"Palazzo Restaurant"},{"REVIEWTEXT":"Once again, a great place for a romantic lunch\/dinner, excellent food, outstanding service","predicted":1,"actual":0,"pos_prob":0.9970438743,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-15 12:00:00.0","ID":72202092.0,"Restaurant":"Maggiano's - San Jose"},{"REVIEWTEXT":"Great Resturant! Food was wonderful as always, service is excellant","predicted":1,"actual":0,"pos_prob":0.9928360914,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-10 11:15:00.0","ID":68453706.0,"Restaurant":"Via Real"},{"REVIEWTEXT":"Awesome food, sevice and ambiance.  Loved the experience.","predicted":1,"actual":0,"pos_prob":0.9825785844,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-19 14:00:00.0","ID":66324346.0,"Restaurant":"Pelican Grill"},{"REVIEWTEXT":"The Depot is our restaurant of choice in Sonoma. It provides a quiet, friendly professional atmosphere, superb menu, and excellent wine list in pleasant surroundings.  All this and the ability to be heard in a private conversation as well.!","predicted":1,"actual":0,"pos_prob":0.9746009188,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-11 19:00:00.0","ID":70393457.0,"Restaurant":"Depot Hotel Restaurant"},{"REVIEWTEXT":"Iron Hill is a family favorite because of the wide variety of choices to please all tastes from seniors to toddlers.  On our last visit, I was blown away by the delicious and creative blackened catfish entree served with an andouille hash and lovely little salad. It was a perfect summer meal in my estimation.","predicted":1,"actual":0,"pos_prob":0.9896599469,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-22 18:30:00.0","ID":63226664.0,"Restaurant":"Iron Hill Brewery - Lancaster"},{"REVIEWTEXT":"we had a great time.  everything was wonderful. The food was great the waitress and waiter were very nice and helpful  when ordering our meal.","predicted":1,"actual":0,"pos_prob":0.9872608838,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-23 18:15:00.0","ID":65491394.0,"Restaurant":"Coach Insignia"},{"REVIEWTEXT":"A college friend came to town on short notice and we found ourselves a the Gage for dinner.  It was the perfect choice!  The exquisite food and wine were made all the more enjoyable by our fantastic server and the manager of the restaurant, Dennis Bruno.  Thank you!","predicted":1,"actual":0,"pos_prob":0.9740141339,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-03 18:00:00.0","ID":66963631.0,"Restaurant":"The Gage"},{"REVIEWTEXT":"My husband and I spent a wonderful 47th anniversary dinner at Sullivan's.   The food and service was outstanding.  We will definitely return to Sullivan's soon.","predicted":1,"actual":0,"pos_prob":0.9944206091,"food_rating":1,"overall_rating":1,"dined_date":"2014-06-25 17:30:00.0","ID":62034519.0,"Restaurant":"Sullivan's Steakhouse - Palm Desert"},{"REVIEWTEXT":"As is always 'par for the course', Dressler's Birkdale hit the mark for a wonderful way to celebrate an anniversary!  The atmosphere was nice, the service was excellent, and the food was outstanding.  The chef's special MahiMahi over lobster risotto was so delicious, and my filet was cooked to perfection and sliced like butter!  Thanks for another great evening and dining experience!","predicted":1,"actual":0,"pos_prob":0.9928454835,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-09 19:00:00.0","ID":65012964.0,"Restaurant":"Dressler's Restaurant - Birkdale Village"},{"REVIEWTEXT":"Our Valentine's Day dinner experience was great!  Beautiful view, service and food were top notch.  Would recommend to anyone wanting a fine dining experience.","predicted":1,"actual":0,"pos_prob":0.9716550073,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-14 17:45:00.0","ID":71811130.0,"Restaurant":"La Gran Terraza - University of San Diego"},{"REVIEWTEXT":"We had a lovely time with great food and great service.  The waitress paced everything well so we did not seem rushed but did not have to wait.","predicted":1,"actual":0,"pos_prob":0.9635621322,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-10 18:00:00.0","ID":66021657.0,"Restaurant":"Prasino - La Grange"},{"REVIEWTEXT":"The service was the best I have ever had. The food and drinks were amazing! There is nothing about this place we didn't love. We will visit this place every time back!","predicted":1,"actual":0,"pos_prob":0.969530223,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-23 21:00:00.0","ID":70954538.0,"Restaurant":"N9NE (NINE 9) Steakhouse Las Vegas"},{"REVIEWTEXT":"We have been here several occasions usually for a birthday or celebration.  If seems every time we go it tops the previous time. Excellent food from the salad\/side bar to the expertly prepared meats.  Service. . . .outstanding! Our server wonderful and very attentive if we like a particular type of meat to be brought to our table. The gauchos very polite and patient while we chose and decide what we wanted.  Highly recommended to experience at least once if your pocket book will allow.","predicted":1,"actual":0,"pos_prob":0.9556036548,"food_rating":1,"overall_rating":1,"dined_date":"2014-12-10 18:00:00.0","ID":68506707.0,"Restaurant":"Boi Na Braza - Cincinnati"},{"REVIEWTEXT":"Great spot on the waterfront. Shaking beef was delicious. Restaurant was a too crowded and noisy.","predicted":1,"actual":0,"pos_prob":0.9527470888,"food_rating":2,"overall_rating":2,"dined_date":"2014-07-24 18:00:00.0","ID":63245667.0,"Restaurant":"Slanted Door"},{"REVIEWTEXT":"I brought a group of five, some vegetarian, some not. All were astounded at how unique, unusual and delicious our dinner was. On the veg side, if you're a vegetarian or vegan, you haven't lived till you've tried the croquettes, for real! And on the carnivore side, the tartare is by far the best I've had anywhere anyhow. Also most pleased to find marrow back on the menu! Tartine is ever an inspiration...","predicted":1,"actual":0,"pos_prob":0.9567508662,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-22 17:30:00.0","ID":73187276.0,"Restaurant":"Bar Tartine"},{"REVIEWTEXT":"Went here for our anniversary-- this is just about our favorite spot in Cleveland.  Mary had the whole fish-- done to perfection; I had the lamb, also worth it.","predicted":1,"actual":0,"pos_prob":0.9832957627,"food_rating":1,"overall_rating":1,"dined_date":"2015-04-24 19:30:00.0","ID":77917446.0,"Restaurant":"fire food and drink"},{"REVIEWTEXT":"The variety and quality of offerings is great. Tagine was flavorful and perfectly cooked, couscous was fragrant and light. My companion was equally happy with her lunch. Staff very friendly from valet parking attendant to waitstaff. I\"m told that the wine list is great, but this was a working lunch. I'll definitely try dinner in the near future.","predicted":1,"actual":0,"pos_prob":0.9613260312,"food_rating":1,"overall_rating":1,"dined_date":"2014-10-10 12:00:00.0","ID":66017688.0,"Restaurant":"Andrei's"},{"REVIEWTEXT":"We had our Valentine's Day Dinner at the Bistro Francais. The ambience was wonderful. The food was very good. We had the duck, which the Bistro prepares perfectly. The noise level is just loud enough that you cannot hear other diners' conversations while being able to hear your table mate\/s.  I would return and I would recommend the Bistro Francais to my friends.","predicted":1,"actual":0,"pos_prob":0.9719328375,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-14 16:00:00.0","ID":72442070.0,"Restaurant":"Bistro Francais"},{"REVIEWTEXT":"The service was great.  The waiter was very attentive and informative.  He explained all of the options and, he was open to answer questions.  The noise level was a little loud.  It would be helpful to have a special place for birthdays, especially when it has been identified when the reservation is made.  The hostess was very friendly and timely when seating guest.","predicted":1,"actual":0,"pos_prob":0.9529767817,"food_rating":2,"overall_rating":2,"dined_date":"2014-10-15 19:30:00.0","ID":66191197.0,"Restaurant":"Stephan Pyles"},{"REVIEWTEXT":"The service and food were exceptional.  We were celebrating a B-Day and all had had a great, fun evening.  I would highly recommend this gem.","predicted":1,"actual":0,"pos_prob":0.997043664,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-11 19:00:00.0","ID":65039233.0,"Restaurant":"Pescatore on Bala"},{"REVIEWTEXT":"We always enjoy Dondero's when we visit Kauai. The service is warm yet professional . The menu is interesting and all the food is fresh and and wonderful. We will return there every time we visit the island.","predicted":1,"actual":0,"pos_prob":0.9880824837,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-03 19:00:00.0","ID":67065760.0,"Restaurant":"Dondero's - Grand Hyatt Kauai"},{"REVIEWTEXT":"All of the entrees were prepared perfectly. The service was great. Everyone enjoyed the evening","predicted":1,"actual":0,"pos_prob":0.9948381717,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-01 17:00:00.0","ID":63566779.0,"Restaurant":"Jack Binion's - Horseshoe Casino - Southern Indiana"},{"REVIEWTEXT":"We had the \"surprise\" 4 course meal.  I am a picky eater, so I was a bit worried, but every course was different, but delicious!","predicted":1,"actual":0,"pos_prob":0.9858226214,"food_rating":2,"overall_rating":1,"dined_date":"2014-11-05 19:00:00.0","ID":66999629.0,"Restaurant":"Nuvo at Greenup"},{"REVIEWTEXT":"We had an extremely great waitress and the food was fantastic also. Service was quick and elegant.","predicted":1,"actual":0,"pos_prob":0.9663972932,"food_rating":1,"overall_rating":1,"dined_date":"2014-07-26 15:00:00.0","ID":63324882.0,"Restaurant":"BakerStreet"},{"REVIEWTEXT":"The BBQ Oysters were to die for and the shrimp with fried green tomatoes was excellent!","predicted":1,"actual":0,"pos_prob":0.9604378113,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-15 19:00:00.0","ID":72528917.0,"Restaurant":"Red Fish Grill"},{"REVIEWTEXT":"Great food, fantastic service. They had a kitchen issue that prevented us from getting entrees","predicted":1,"actual":0,"pos_prob":0.9718806787,"food_rating":2,"overall_rating":2,"dined_date":"2015-01-23 20:30:00.0","ID":70893062.0,"Restaurant":"David Burke Prime at Foxwoods"},{"REVIEWTEXT":"Made reservations for a group of 8, and called the morning of the reservation to add a last minute addition if possible.  They managed to increase the reservation number with no problem.  Food was great and the noise level as low enough that you could easily hold a conversation with everyone at the table.  Service was excellent as well - highly recommended!","predicted":1,"actual":0,"pos_prob":0.9834738259,"food_rating":2,"overall_rating":1,"dined_date":"2014-07-15 11:30:00.0","ID":62844581.0,"Restaurant":"Maggiano's - Denver Pavilions"},{"REVIEWTEXT":"Great food and very fresh fish.  Attentive service.  Excellent proximity to the Dallas Arts District.  Thumbs Up!","predicted":1,"actual":0,"pos_prob":0.9931676326,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-07 17:00:00.0","ID":71708853.0,"Restaurant":"Amberjax at Trinity Groves"},{"REVIEWTEXT":"The service is exceptional. Staffers are knowledgeable, polite and friendly. They make you feel welcome and happy to be there.","predicted":1,"actual":0,"pos_prob":0.9843164758,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-17 18:30:00.0","ID":70609292.0,"Restaurant":"Castello"},{"REVIEWTEXT":"Delicious food from the less well known area of Puglia, with excellent wines to match. The pasta, which is made fresh daily by the owner's mother, can't be beat!","predicted":1,"actual":0,"pos_prob":0.9862837992,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-09 19:00:00.0","ID":71583215.0,"Restaurant":"I Trulli"},{"REVIEWTEXT":"The food was excellent, the service was excellent, the view from the outside dining area was quiet.","predicted":1,"actual":0,"pos_prob":0.9721181089,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-21 20:00:00.0","ID":64219690.0,"Restaurant":"Plank's Tavern"},{"REVIEWTEXT":"The food was very good as always and the server was outstanding.","predicted":1,"actual":0,"pos_prob":0.9903515047,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-15 11:30:00.0","ID":65183529.0,"Restaurant":"Winston's Grille"},{"REVIEWTEXT":"My wife and I had another delightful and delicious meal at the Red Onion","predicted":1,"actual":0,"pos_prob":0.984596376,"food_rating":1,"overall_rating":1,"dined_date":"2014-08-02 18:45:00.0","ID":63615260.0,"Restaurant":"The Red Onion Restaurant & Bar"},{"REVIEWTEXT":"Great food, reasonable prices, great service, good beer list!!! 8)","predicted":1,"actual":0,"pos_prob":0.9905735443,"food_rating":1,"overall_rating":1,"dined_date":"2014-09-27 18:00:00.0","ID":65542574.0,"Restaurant":"The Drafting Room Taproom & Grille"},{"REVIEWTEXT":"We have been to Patt's before, and it is always a wonderful experience.  We took friends there, and they loved it, too!","predicted":1,"actual":0,"pos_prob":0.9639772825,"food_rating":1,"overall_rating":1,"dined_date":"2015-02-10 13:00:00.0","ID":71625156.0,"Restaurant":"Patti's 1880's Settlement"},{"REVIEWTEXT":"We had our 28th Anniversary Dinner at Aspens West Cobb and was very impressed with the service, food and friendly atmosphere. Wait staff was excellent and food was great. Our party of nine was seated in a timely manner and each made positive comments to my wife and I. We highly recommend Aspens and will return soon","predicted":1,"actual":0,"pos_prob":0.9961983696,"food_rating":1,"overall_rating":1,"dined_date":"2014-06-28 17:15:00.0","ID":62186555.0,"Restaurant":"Aspens West Cobb"},{"REVIEWTEXT":"Bar service excellent, wait staff very efficient, friendly -- would highly recommend for happy hour.","predicted":1,"actual":0,"pos_prob":0.9851395088,"food_rating":1,"overall_rating":3,"dined_date":"2014-07-25 18:00:00.0","ID":63277017.0,"Restaurant":"PRISM"},{"REVIEWTEXT":"Enjoyed an evening out at Bob's Steakhouse in Grapevine. The steak was great as usual and the service was impeccable. Perfect evening and great experience.","predicted":1,"actual":0,"pos_prob":0.9927410652,"food_rating":1,"overall_rating":1,"dined_date":"2015-01-12 18:30:00.0","ID":70458484.0,"Restaurant":"Bob's Steak & Chop House - Grapevine"},{"REVIEWTEXT":"The food is always good here, they always have availability, or are able to accommodate my needs, and the noise is always kept to a minimum.","predicted":1,"actual":0,"pos_prob":0.9652110354,"food_rating":2,"overall_rating":2,"dined_date":"2014-07-22 17:00:00.0","ID":65921408.0,"Restaurant":"The Hamilton"},{"REVIEWTEXT":"The food was wonderful!  The service was great!  The meal was expensive - but absolutely worth every penny!  We will be back and back again and again!  Great find tucked away down-town Grand Junction!","predicted":1,"actual":0,"pos_prob":0.9918638076,"food_rating":1,"overall_rating":1,"dined_date":"2015-05-02 18:00:00.0","ID":78236086.0,"Restaurant":"The Winery Restaurant"},{"REVIEWTEXT":"Usually Berryhill has awesome food and a cozy atmosphere and piano music.  Incredible tomato soup and other yummy dishes and the wait staff is always pleasant and helpful!","predicted":1,"actual":0,"pos_prob":0.9853031978,"food_rating":2,"overall_rating":3,"dined_date":"2014-12-25 18:30:00.0","ID":69632999.0,"Restaurant":"Berryhill & Co."},{"REVIEWTEXT":"I took my friend to Ray's on the River for his 50th birthday.  The table was beautiful with discreet confetti (accurate, if oxymoronic).  Our main server, Brian, was amazing.  He was kind and engaging.  My friend is extremely talkative, and Brian was happy to engage.  He went above and beyond to make the night special.  He also recommended an amazing wine, and reminded me that I could drink it responsibly and take the re-corked bottle home.  The supporting cast of servers (including Trey) and the manager who stopped by our table also helped to make the night wonderful.   My New York strip was delicious and the brussel sprouts were divine.  Don't get me started on the praline basket and bourbon ice cream!  I will definitely be back.","predicted":1,"actual":0,"pos_prob":0.9920797907,"food_rating":1,"overall_rating":1,"dined_date":"2014-11-09 20:30:00.0","ID":67203093.0,"Restaurant":"Ray's on the River"}]